[{"id":"7636833139","version":"3.10.14","date":"2021-07-30T22:07:28.000Z","authorName":"Hold'em addict","rating":3,"title":"Latest version shows wrong model","body":"Latest version of the app seems slow to wake the car. Not sure if that can be attributed to the mobile app or the API. It also shows the wrong model number for my 2020 Model X Long Range. It displays it as a 100D in the app. The console was in the car displays my model info correctly.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7636036691","version":"3.10.14","date":"2021-07-30T16:43:27.000Z","authorName":"nada0425","rating":3,"title":"Can’t connect","body":"Can’t connect","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7633685030","version":"3.10.14","date":"2021-07-30T02:44:38.000Z","authorName":"Taffy27","rating":3,"title":"Not Sure About the Issue","body":"Bought a used Tesla and finally has it connected to the app. Was able to lock the door but now unable to unlock it via the app and now the key fob! I can do everything else BUT that. \nIt’s late at night with no help whatsoever, and to add insult to injury, the Tesla app on my iPhone 12 just keeps spinning","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7633464029","version":"3.10.14","date":"2021-07-30T01:21:58.000Z","authorName":"Joe Da Pro","rating":2,"title":"Horrible Customer service","body":"No contact info online, must use app for all customer service inquiries even though it only gives options strictly for vehicle repairs and not account issues. No live chat.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7633037172","version":"3.10.14","date":"2021-07-29T22:59:36.000Z","authorName":"ClassicsRox","rating":1,"title":"iPhone 12 phone key failures and slow to wake car","body":"Phone key with iPhone 12 and 12 Pro models have constant issues with Phone Key. If you turn climate on/wake up your Tesla in the app and then use phone key to open the car upon approaching it, it will not work every few times. You have to turn Bluetooth on and off to get it to work. incredibly frustrating especially for the price of the car.\n\nAlso generally slow to wake the car even when things are working well. Could be a lot better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7628585522","version":"3.10.14","date":"2021-07-28T19:07:15.000Z","authorName":"Monica Burdine","rating":1,"title":"Not Working and No Help","body":"My Tesla app has not worked in a week. It’s not connecting and I haven’t been able to find a Tesla Customer Service Rep to help either. Tryin to get someone to help is crazy!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7625080116","version":"3.10.14","date":"2021-07-27T20:55:37.000Z","authorName":"The Wall 08","rating":1,"title":"Service thru app is a nightmare","body":"I booked an appointment to upgrade the computer in my model 3 for full self driving. The app required me to make an appointment for mobile service. Then they moved my appointment without telling. Then, they said the mobile service in Los Angeles cannot do the full self driving upgrade, and I must go to a service center. Then, the service center said the next appointment was a month out. The app should not let me make the appointment for mobile service in that situation.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7622798913","version":"3.10.14","date":"2021-07-27T07:12:54.000Z","authorName":"Erikjasonmartinez","rating":1,"title":"“Premium” connectivity","body":"Been acting more like lost in the forest connectivity. It was excellent a few months ago but recently has gone downhill quick","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7620580669","version":"3.10.14","date":"2021-07-26T15:58:06.000Z","authorName":"Pedrojf1","rating":4,"title":"Great app for my powerwall","body":"The app is very good. The storm watch feature has worked when tropical storms were advised. It is now my third year with the system and it has proven to be an excellent acquisition. After hurricanes Irma and Maria devastated our power grid we promptly installed it and have benefited from both protection from power outages as well as spikes and low voltages conditions all of which have been increasing in Puerto Rico. \nI would like to suggest a couple of simple tweaks which should be added. The backup history could benefit from adding the time the power was lost. Also sometimes the notifications are not reaching us so looking into this should be good. Maybe a history of the notifications could be added. Last it would be good if the app could display the voltage coming from the grid. I presume this is measured so having it displayed would be good. We experienced a problem with the transformer from our power company and the report from the Tesla support here was a great tool which I used to make the power company react and fix the problem. I wish this report would also be available to us users as well.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7618160046","version":"3.10.14","date":"2021-07-26T00:56:08.000Z","authorName":"BGIL708","rating":2,"title":"More work to do","body":"I would like to see a map of all super chargers not just a few the app has selected. I would like to be able view the live camera feeds from my car so I can see why my alarm is going off. Also the interior camera please.\n\nIf there is information on charge rate for best charging efficiency I would like to see that info.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7618007362","version":"3.10.14","date":"2021-07-25T23:46:33.000Z","authorName":"neo_savvy","rating":2,"title":"Love the car, but app is garbage","body":"Especially the service feature. Elon needs to hire a design firm to build an excellent car and mobile app for the Tesla car platform.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7617928208","version":"3.10.14","date":"2021-07-25T23:08:12.000Z","authorName":"BR009KEC","rating":3,"title":"Request for Powerwall","body":"Specific request below ... but generally shocking their have been no updates to this app for over a year?? For a tech company I expect changes every two weeks. Embarrassing. Check out “sense”. Uses ai to give more details on individual e.g. appliance use ... what is sucking power. Buy this company? Also — One of my cars is non Tesla. Would be nice if the gateway could recognize the car (similar to Tesla charger) and moderate the charge (or turn off) based on solar kWh available (see Sense above). It would also be nice to have the option to turn off certain breakers if the power goes out (eg hot tub or other high power needs). I do it manually at the breaker ... but would be nice to have remote option if I’m not home / traveling.\n\nUpdate:\n- bought a model 3 … app is much better for the car\n- request: Powerwall needs much more integration with the car. Would be nice to have an option to charge only with solar vs grid (adapts to solar)\n- request: allow me to change the amp / charge rate on the app (I’m manually changing to adapt to solar conditions).","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7617895327","version":"3.10.14","date":"2021-07-25T22:52:15.000Z","authorName":"bobgdd","rating":1,"title":"Worst made decision of buying Tesla","body":"Tesla model y when we turn on AC it’s throwing hot air 🤨🤨🤨 and it’s says climate keeper unavailable due to system fault 😞😞 very disappointing with every issue of Tesla can someone help if thye had same issue before.? Tesla service appointment aviable 10th august can’t bare this heat in summer..\n\nIt was our dream car but day by day our dream car turning into disaster choice we made and we are regretting so bad right now why we choose this car 😞😞😞\n\nMy Sunday and day is made by our dream car Tesla today in 91F without AC🙏🏻\n\nCan anyone help or any idea to fix ?\n\nWe did turn on and off software system dint work out 🤨","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7617796876","version":"3.10.14","date":"2021-07-25T22:04:05.000Z","authorName":"buffalosold","rating":2,"title":"App Continue to disconnect","body":"The app continues to disconnect from my Tesla Y.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7610388169","version":"3.10.14","date":"2021-07-23T21:47:27.000Z","authorName":"LKC54","rating":2,"title":"App stopped working","body":"We’ve had our Tesla for 3 months and the app stooped working. Tesla customer service is unable to assist. Uninstalled app and reinstalled, still not working…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7607334719","version":"3.10.14","date":"2021-07-23T02:41:47.000Z","authorName":"Melvin P. Thorpe","rating":2,"title":"Notification harassment","body":"The stupid app is notifying me every twenty minutes of a software update being available. This is excessive to say the least, but it’s the exactly the sort of thing I’ve come to expect from Tesla’s slipshod quality ethos. Don’t ever buy anything from this company.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7607219743","version":"3.10.14","date":"2021-07-23T01:56:47.000Z","authorName":"Luiscarrascob","rating":1,"title":"Can’t share a map location to the Tesla app anymore","body":"This used to work. It was the best thing about the app! Bring it back","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7597845167","version":"3.10.14","date":"2021-07-20T13:05:14.000Z","authorName":"TINRABBIT","rating":3,"title":"Payment option","body":"Would like to have the option to pay my Tesla bill on this very same APP.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7593807540","version":"3.10.14","date":"2021-07-19T10:55:45.000Z","authorName":"LukasTX","rating":4,"title":"Can you add the function to adjust charging current on this app","body":"Hello, just a suggestion for future updates. Can you add the function to allow owners to adjust charging amps on the cellphone app? Currently we can only change the setting on the center console. It would be much convenient if we can adjust it without going back to the car. Thanks.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7591719529","version":"3.10.14","date":"2021-07-18T20:10:14.000Z","authorName":"DEADITES23","rating":3,"title":"iOS 14 widgets & share sheet support","body":"Please add iOS 14 widgets to the Tesla app and add back the share sheet support. Why did you remove that feature??","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7585651621","version":"3.10.14","date":"2021-07-17T05:42:10.000Z","authorName":"benderino","rating":3,"title":"Walk up unlock doesn’t work well","body":"The car won’t unlock unless the phone’s screen is lit. So I always have to get my phone out or reach into my pocket to tap the screen.\n\nNeeds a reminder function to notify me to plug in the car after I park at home or work.\n\nRemote camera viewing. I have apps that let me see what my security cameras and doorbell camera see, why not be able to see what the car’s cameras sees thru the app?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7585443733","version":"3.10.14","date":"2021-07-17T04:15:44.000Z","authorName":"Masq","rating":3,"title":"Latest update 07/16/21)","body":"App update has put a “P100D” at the bottom of the screen for my 2021 Model X Performance.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7583629802","version":"3.10.13","date":"2021-07-16T16:10:02.000Z","authorName":"MadRa88it","rating":4,"title":"A few minor things before it’s polished","body":"Can we get the ability to adjust car charging amps from the app? Or an option on the home /gen3 charger side that while “self powered” to send all PV AND over X% in the PowerWalls to the car(s)?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7565001119","version":"3.10.13","date":"2021-07-11T16:58:47.000Z","authorName":"Sleepiihead100","rating":5,"title":"The Best App","body":"Don’t listen to all these other chumps complaining about this app. The car is beyond amazing, the app is extremely convenient. You can check your charge status, roll up your windows, turn on your AC, open doors, turn on your car for keyless driving, the list goes on and on. They really thought of everything and it really does seem like they kept the consumer in mind when they built this app. Elon is literally the GOAT and watching Tesla become this success story after everyone doubted them, is the best thing I’ve seen unfold. All in all, this app is the freakin best and this car is the best. To anyone thinking about buying a Tesla, you will never regret it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7563176504","version":"3.10.13","date":"2021-07-11T05:50:21.000Z","authorName":"*bignasty*","rating":1,"title":"Very disappointing","body":"They don’t even answer the phone if you have an issue with your car, they insist via automated recording to use the app, This is very disappointing if your requests are of urgent nature. Then, the app chooses when and when not to work and let you type a message. Unfortunately, I can’t even reach service when I needed to respond, or set up appointments.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7550872398","version":"3.10.13","date":"2021-07-07T21:56:41.000Z","authorName":"🇯🇵Otaku 30🇯🇵","rating":4,"title":"Problem","body":"Maps are not updating the current location","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7550548140","version":"3.10.13","date":"2021-07-07T19:38:06.000Z","authorName":"DanAug1984z","rating":2,"title":"Service error","body":"When I try to submit a service, right after the location submission   “It says error processing appointment slots”. I wish calling was an option, but I haven’t gotten Tesla on a phone call in 2 years.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7550070871","version":"3.10.13","date":"2021-07-07T16:43:02.000Z","authorName":"Butt-Boy","rating":1,"title":"App Doesn’t work and locks out of car","body":"App is incredibly glitchy, frequently doesn’t load, and doesn’t work properly. Huge issue if this is your “key”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7549426473","version":"3.10.13","date":"2021-07-07T13:25:54.000Z","authorName":"HippieChic60","rating":2,"title":"Tesla App issues","body":"Our Tesla App for solar we have done EVERY troubleshooting on the app and nothing is working. It is so aggravating and you can’t get a human on the phone for several business days.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7534292554","version":"3.10.13","date":"2021-07-03T11:42:28.000Z","authorName":"josik123","rating":4,"title":"Good app, couple of suggestions/flaws","body":"Service scheduling should provide the capability to load the appointment to the iPhone or other calendar. I have missed appointments bc I had the date/time confused and the appointments aren’t visible outside the app. You could also build in reminder notifications.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7530895052","version":"3.10.13","date":"2021-07-02T13:44:06.000Z","authorName":"vhfsun","rating":2,"title":"Works Better on Android, Service Features are Busted","body":"Every feature worked fine on my android, now on iOS I cannot send messages, reschedule, or cancel my service visits and there is no other way to contact Tesla Service Agents outside of the app. Really leaves a sour taste in my mouth.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7528722144","version":"3.10.13","date":"2021-07-01T23:50:54.000Z","authorName":"DNA_Navid","rating":3,"title":"Widget not readable when iOS Dark Mode is enabled","body":"The widget needs to be updated to adjust contrast for dark mode.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7524799995","version":"3.10.13","date":"2021-06-30T23:33:40.000Z","authorName":"foresstfirre","rating":3,"title":"Idea","body":"I want to be able to view my car’s cameras thru the app","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7523132514","version":"3.10.13","date":"2021-06-30T13:34:45.000Z","authorName":"surebutnotsosure","rating":1,"title":"Buggy app for key card","body":"Considering this is my main key for getting in and out of my car it only works half the time.It constantly disconnects and I have to turn Bluetooth off and on I don’t understand why I have to do that every time I go to get into my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7520449556","version":"3.10.13","date":"2021-06-29T20:24:27.000Z","authorName":"Ritgo","rating":4,"title":"Upgraded","body":"I upgraded to the latest version of the app just now and it worked fine after all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7519946371","version":"3.10.13","date":"2021-06-29T17:14:32.000Z","authorName":"Chad51333","rating":5,"title":"Solid for my M3P","body":"App works very well for my Model 3. There are some things I would add, like start/stop charge and charge scheduling but overall it works very well. Also fastest in the industry by far.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7515630127","version":"3.10.13","date":"2021-06-28T14:17:41.000Z","authorName":"MrCaballo","rating":3,"title":"Fair app overall. Lots of room for improvement.","body":"The app’s works as expected for everyday use. However, it should improve by adding more energy management and analytics features, setting charging amperage within the app, watching sentry mode videos from app, and better integration with other apps such as Maps and Spotify. Also they should fix the Loot Box issues and sharing for residents of Puerto Rico since it does not work here and we have written to support without answers.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7505033737","version":"3.10.13","date":"2021-06-25T16:55:52.000Z","authorName":"THE BOT#1","rating":5,"title":"It is great. I have no problems with it","body":"My Tesla is great i love it so much super safe a a self driving car and I love the key.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7504592772","version":"3.10.13","date":"2021-06-25T14:38:26.000Z","authorName":"Project24Films","rating":3,"title":"Smart summon option missing?","body":"2021 model Y and i cant seem to find the smart summon option on the app. Looked at forums and still to no avail.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7500580883","version":"3.10.13","date":"2021-06-24T12:48:16.000Z","authorName":"Jvon6","rating":3,"title":"Still an issue - please fix","body":"I’m not sure what’s going on with this update, but my car barely recognizes when I approach even with my phone in hand. Sometimes sentry mode will start and it won’t open until the icon disappears from the screen. I literally had to take my phone out, open the Tesla app and then unlock the door. This wasn’t always the case. It used to work about 85% of the time, now it’s closer to 40%. Please update this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7497684746","version":"3.10.13","date":"2021-06-23T16:45:51.000Z","authorName":"David_S8324","rating":1,"title":"MAJOR charging bug","body":"I didn’t believe my wife when she said she set the charge limit to 90% and it charged to 95% until it happened to me. \n\nThe UI charge limit and the actual charge limit are at mismatch. \n\nIf set any charge limit lower than 90%, it’s accurate. If you set it to 90%, it will charge to 95% or higher (we charge in the middle of the night so it could have been to a higher amount but dropped a few percentage points). \n\nThis will degrade the battery faster and is an extremely dumb bug to have in an app that is responsible for charging an expensive car.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7497607260","version":"3.10.13","date":"2021-06-23T16:20:05.000Z","authorName":"enter.another","rating":2,"title":"HomeLink lacks channel selection","body":"It's good that there is a HomeLink option in the app, but it's bad that you can't tell it what channel you want it to trigger (e.g. garage vs gate). This make it between useless and dangerous, if you have multiple channels at the same location, as the command is sent to all devices.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7484128739","version":"3.10.13","date":"2021-06-20T01:21:33.000Z","authorName":"trinidadbrad","rating":1,"title":"Apple Watch compatibility","body":"Why do I need to buy another app or download another app to use on my watch…it negates the purpose of this all but I enjoy using it for the “service” and car control…is there any time you guy will be making this a Apple Watch app friendly soon?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7481047295","version":"3.10.13","date":"2021-06-19T05:58:22.000Z","authorName":"junlanlu","rating":4,"title":"Needs improvement","body":"I think the app can benefit from having more statistics like the stats app and use ios widgets","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7479464715","version":"3.10.13","date":"2021-06-18T18:50:20.000Z","authorName":"haritherebel","rating":4,"title":"WIDGETS","body":"We need more Widgets.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7475074391","version":"3.10.13","date":"2021-06-17T14:50:54.000Z","authorName":"DuT.@","rating":4,"title":"pls fix this","body":"the characters in the widget are uneasy to read due to the color doesn't work appropriately with iOS dark mode. pls fix this. thx","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7471031749","version":"3.10.13","date":"2021-06-16T12:55:29.000Z","authorName":"SierraCarver","rating":1,"title":"App siphons battery life when running","body":"Tesla needs to optimize this app’s use of battery on the iPhone/iPad. \n\nWhat’s the point of having a power storage device “backing up” your grid power if you are  hesitant to run it during outages to check the Powerwall status?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7464747289","version":"3.10.13","date":"2021-06-14T18:40:16.000Z","authorName":"KyleB715","rating":3,"title":"Feature Request - NEEDS SCHEDULED CHARGING!","body":"Currently the only way to switch to scheduled charging is inside the car..\n\nPlease add scheduled charging to the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7454495761","version":"3.10.13","date":"2021-06-12T02:40:42.000Z","authorName":"yanni2222","rating":3,"title":"Needs some improvements","body":"The Controls page on iPhone 12 mini does not allow the user to scroll down. \n\nPLEASE, PLEASE add Bluetooth connection for unlocking and starting vehicle. Also, added granular controls for climate system would be very useful.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7452960655","version":"3.10.13","date":"2021-06-11T16:28:49.000Z","authorName":"CHerlocker","rating":1,"title":"Will not load app nor connect to ANY Tesla webpage via cellular data","body":"Just recently I discovered that I could not access the app nor any of the Tesla websites on cellular data. I can access them all fine on any WiFi. I contacted AT&T, went through their technical support and it was concluded on their end. I contacted Apple support and they stated it was not on their end as there was not a VPN. When I contacted my Tesla sales rep he stated it was a known issue but stated it was AT&T issue. \nI pick up my car in a couple hours…… I can’t use certain functions now because it won’t load 😭😭😭","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7449800519","version":"3.10.13","date":"2021-06-10T19:41:16.000Z","authorName":"mrhappyappy","rating":5,"title":"iOS Share to Tesla","body":"Great feature","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7445894742","version":"3.10.13","date":"2021-06-09T18:57:37.000Z","authorName":"Kritini","rating":2,"title":"Allows 10k upgrades without confirmation","body":"More than 18 months after this issue was first identified, this app is still allowing upgrades with no Face ID, no touch ID, no password nor any other kind of confirmation. I failed to lock my phone before I put it in my pocket (that’s on me) and I got a $10,000 purchase on my credit card. This is not OK.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7440666559","version":"3.10.13","date":"2021-06-08T11:25:22.000Z","authorName":"Slothritis","rating":3,"title":"Needs work","body":"Needs more work. It does the job, but there are a lot of problems. For one, if you get a notification from a service center and your appointment is cancelled or rescheduled , you cannot see that message for that appointment. There is a notification for an unread message always there.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7439572025","version":"3.10.13","date":"2021-06-08T03:58:37.000Z","authorName":"broddy24","rating":3,"title":"I hope Tesla reads these","body":"I use this app for my model Y. \nI greatly enjoyed the car and don’t see my self going back to any other make or model. \n\nThis app how ever needs some attention. \nI can see that they update it for bug fixes and improvements but if has been over a year since they have added any new features. \n\nFeathers I think would be nice to add:\n• A map of chargers\n• Trip/Route planning with waypoints\n• Saved trips or routs with waypoints \n• Scheduling departure with time\n• Scheduling departures with calendar appointments\n• Over heat mode on and off\n• Live sentry mode/ camera viewing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7435894904","version":"3.10.13","date":"2021-06-07T05:04:21.000Z","authorName":"jackintheboxdad","rating":2,"title":"PowerWall Backup History does not show YEAR","body":"PowerWall Backup History does not show YEAR. My power wall recorded 7 power loss events over the two years since installation. Going forward it would nice to show the full date mm/did/yyyy of the power loss event.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7432120238","version":"3.10.13","date":"2021-06-06T05:32:09.000Z","authorName":"Os2casey","rating":2,"title":"Can’t locate chargers on the app","body":"Seriously, how does this app have a map function built into it, yet you can’t find charging stations on it? This needs to be addressed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7412035071","version":"3.10.12","date":"2021-06-01T02:46:20.000Z","authorName":"deagia and dora","rating":2,"title":"M3P OWNER","body":"The app is great but needs to get as many updates and refreshes as the car does or at least as many as a low budget phone game. Their is a massive glitch where if the car is home plugged in on WiFi and goes to sleep it can’t be woken up in the app for at least 1-2 minutes if lucky so this happenes every time if you have sentry off at home and some times if u have it on. Some times if you put ur phone on cellular it is able to wake the car other times not. If car is not plugged in or not on wifi this doesn’t happen. This is a app glitch and a car glitch. Some of the cars cpus can be on but if the infotainment one is not on or what ever cpu is for the Internet then u can only do basic tasks that don’t use it. Like unlock, lock, open trunk, open frunk.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7411908562","version":"3.10.12","date":"2021-06-01T02:05:45.000Z","authorName":"Th3Dra9on","rating":5,"title":"Add on","body":"Can you guys add a fart on demand button ? Or other buttons from the boom box ?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7406222464","version":"3.10.12","date":"2021-05-30T13:53:20.000Z","authorName":"johnnyflewerty","rating":1,"title":"BEWARE of SOLAR","body":"First I want to say I am a huge Tesla fan but this experience with Tesla solar has been terrible and I would not recommend. It’s not worth the headaches or the money. \n\nShading billing practices and hidden fees have cost me thousands. My quote for solar noted free installation but the night before install Tesla slid in a 3k line for installation into the final bill without telling me. The way they present bills is confusing and I did not realize it had been added. They will not return my calls or emails asking for clarification on why I was added to the final bill.\n\nTesla came out to my house two times to decide on a location for the powerwalls but during install they decided to put them somewhere else which I had not agreed to. What I learned was that Tesla does what they want and they do not want any input from the homeowner. \n\nTesla also broke my gutters with their ladders  but they will not return my calls to fix them. In their eyes the job is done.\n\nIn short, communication is non existent and they take weeks to reply to any question if they even reply at all. I expect more from from a premium solar company especially with the cost. They get back to you when they feel like it. They are out to get as many jobs done as possible and they don’t care how they are done.\n\nMy project was supposed to take 3-4 months and it took over 8 months to complete. I expected a lot more from Tesla and this has left a really bad taste in my mouth. BEWARE!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7403234216","version":"3.10.12","date":"2021-05-29T18:32:45.000Z","authorName":"wrspgood","rating":1,"title":"Fails to connect to car","body":"Model S connects to home wifi. Tesla app connects to home wifi. But app will not connect to car so cannot ‘wake up’ when not on cellular.\n\nTesla please fix the software glitch","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7402464304","version":"3.10.12","date":"2021-05-29T14:25:53.000Z","authorName":"Myllertime","rating":1,"title":"Needs more features","body":"Super simple app that only tells my solar generation. Doesn’t tell consumption, no extra features if you only have solar without powerwall. I want to be able to see my consumption, metering etc","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7395925946","version":"3.10.12","date":"2021-05-27T21:52:55.000Z","authorName":"Woodtree Live","rating":1,"title":"Buggy and slow","body":"This app is slow to open and use. Doesn’t sync with my calendar. I could write a better mobile app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7391113614","version":"3.10.12","date":"2021-05-26T16:08:41.000Z","authorName":"!VJ","rating":2,"title":"Unable to view Powerwalls usage","body":"The app worked like a charm initially, but now are a month or so of installation I am unable to see either the production/powerflow or power wall usage and charge level, don’t see any fix coming through.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7389023999","version":"3.10.12","date":"2021-05-26T03:46:52.000Z","authorName":"vtboyarc","rating":1,"title":"Buggy","body":"Buggy, slow, even on an iPhone 12 Pro Max. \nThis app is the worst part about owning a Tesla.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7380410630","version":"3.10.12","date":"2021-05-24T01:05:47.000Z","authorName":"swissbank79","rating":1,"title":"Door unlock issues!!","body":"Rarely ever unlocks car doors when I’m in front of the car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7368339000","version":"3.10.12","date":"2021-05-21T03:01:29.000Z","authorName":"a–p","rating":4,"title":"Can’t fold side view mirrors but decent overall","body":"Pretty decent app. Use it to interface with our MY. @Devs please kindly add side view mirrors folding. It can be done from your Tesla’s dashboard and Teslas are always online so it *should* be possible to add this feature to the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7356338768","version":"3.10.12","date":"2021-05-18T15:47:02.000Z","authorName":"J3With","rating":5,"title":"World Changing","body":"Buying a Tesla is the best thing an individual can do to improve the quality of their life! Not only that but it helps the lives of all by reducing pollution and bringing together a community united for the betterment of the planet.\n\nThe app is awesome; you can find YouTube videos on your phone and make your car play them! Plus cool or defrost your car remotely! Notifications are super helpful. Schedule service, pay invoices and communicate with the mothership.\n\nThe best thing is I’ve enjoyed all these things since 2016...imagine what features we’ll have by 2026 🦾","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7353841046","version":"3.10.12","date":"2021-05-18T04:17:23.000Z","authorName":"RawwrBag","rating":3,"title":"Sick of the white screen of death","body":"Been an issue for at least of year. You’ve got a lot of money and can do better. Repro: leave a service appointment open. Leave the app for awhile. Come back to the app and observe that it’s a blank white screen. The only fix is to force close.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7344164800","version":"3.10.11","date":"2021-05-16T02:31:24.000Z","authorName":"Malvin11111","rating":2,"title":"Not the best app","body":"I use this app on the iPhone 12 Pro Max and it crashes often especially in the service menu. Outside of that the app is decent.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7342545515","version":"3.10.11","date":"2021-05-15T16:43:07.000Z","authorName":"Meg2girlz","rating":3,"title":"Wish it installed on Apple Watch too.","body":"Would love to be able to open my car when my watch is on. I hate having to open the app for my car to unlock. Or refresh the app. Keyless entry is better","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7328943079","version":"3.10.11","date":"2021-05-12T10:13:03.000Z","authorName":"Sportzluver91997","rating":1,"title":"Wish we had never installed solar","body":"Solar city was great but when Tesla took over , the billing became a nightmare. Be would think that they would have a grip on technology to make billing easy! Not! I’ve spent literally hours on the phone with them just to be able to sign on.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7324465227","version":"3.10.11","date":"2021-05-11T07:38:57.000Z","authorName":"Wow zombies","rating":2,"title":"Freezing app","body":"This app has to many bugs in it. It keeps freezing up constantly and won’t let you into the car sometimes. It makes things difficult especially when you need to go places. And also they should have a feature on the app just in case you need to reset the car if the car screen freezes or reset the charge connection when charge stops midway when plugged up at home instead of having to always unplug the cord.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7321421238","version":"3.10.11","date":"2021-05-10T12:57:41.000Z","authorName":"Dfhbcxcbnn","rating":1,"title":"Terrible Programming","body":"1. Logs you out potentially leaving you locked out of car\n2. Log on done unprofessionally: it should store your user/pass and let you touchid to sign in (see any banking app)\n\nGuess my previous post was removed for citing an app I rated 5 stars in contrast to this mediocre app. Just program it in Swift and fix the login issues. Not that hard.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7318140512","version":"3.10.11","date":"2021-05-09T16:21:06.000Z","authorName":"Jnt.RG","rating":1,"title":"Access denied","body":"Major issues trying to load and connect app. Says access denies, disconnected to server. Tried removing, adding, removing, adding etc. Tesla has no straight forward support contact info. Trying to set up my key for my new phone has been a pain. Not understanding why this app is performing this way and there’s no assistance available.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7316173934","version":"3.10.11","date":"2021-05-09T06:07:09.000Z","authorName":"allbows","rating":1,"title":"App is not working!!!","body":"This app is not working it says access denied for all 3 of my iPhones. Older app works","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7310610571","version":"3.10.11","date":"2021-05-08T01:36:17.000Z","authorName":"Cu$+0m3r","rating":1,"title":"Solar App","body":"Months after some scathing criticism in regards to the Solar Management UX, the app continues to live up to the pathetic reviews.  I expect considerably more from a UX team operating under the name ’Tesla’.  Whaddayagonnado?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7309625298","version":"3.10.11","date":"2021-05-07T19:28:09.000Z","authorName":"Bmbmusic","rating":1,"title":"Bad app","body":"First, it doesn’t work half the time.  There are so many times I go to unlock my car, and the app doesn’t respond.  I’d prefer a key fob.\nSecond, it changes, sometimes it shows a service button, sometimes it doesn’t.  And even when the service button is there, it doesn’t allow you to respond to messages with the service center, nor does it tell you that you have a new message.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7305384164","version":"3.10.11","date":"2021-05-06T16:34:11.000Z","authorName":"Bladewil","rating":4,"title":"Missing many useful features","body":"The Tesla app does what it was designed to do very well. Only rarely has something not worked like turning on climate control or failing to open the door automatically when you get close. Those work enough to be 5 stars.\n\nWhat is like to see is the trip planner added to the app as well as the ability to set up scheduled charging/departures from the app.\n\nI also have a V3 home charger and would love to see the status of that in the app so I can see everything is good, how many kWh used this charging session, and to see alerts when the charging slows down (which it has for me and I can’t tell what the issue is).","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7304991351","version":"3.10.11","date":"2021-05-06T14:28:49.000Z","authorName":"loyalist starting to turn.","rating":1,"title":"Servicing messaging doesn’t work.","body":"The service department only wants to communicate via the app, but it’s hit or miss on actually working. If I can’t get my car serviced what’s the point of owning one of their cars?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7302780470","version":"3.10.11","date":"2021-05-05T23:30:39.000Z","authorName":"Pee Kay","rating":3,"title":"Lack of watch support disappointing","body":"The app itself is pretty good; there are a few features (specific to the car) that are unfortunately missing. The challenge is the lack of a companion watch app which I find often means I need to go get my phone to get into the car. I don’t trust third party account access, which makes it annoying.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7301857261","version":"3.10.11","date":"2021-05-05T17:57:23.000Z","authorName":"dissapointed customer :(","rating":3,"title":"Good UI but could connect better","body":"I think the app is pretty user friendly but when using the phone key, it sometimes does not connect. It literally makes me look like i’m breaking into my car. The bluetooth function definitely has gotten better but it lags a lot more often than not.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7300535802","version":"3.10.11","date":"2021-05-05T10:48:33.000Z","authorName":"tootsiegirl60","rating":1,"title":"Solar panels won't link to account","body":"My solar panels are not linked to my account and I don't see anyway to connect them.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7295453273","version":"3.10.11","date":"2021-05-04T02:56:34.000Z","authorName":"Alden Guy","rating":1,"title":"Continue to disappoint","body":"Tesla continues to soil the proverbial bed linen, when it comes to customer service. I have a lease of theirs and recently moved. I’m trying to update my address on the app and on the website. It’s a complete mess. I finally found a place on the website where I can submit a question and chat with a customer service rep. However, the hours are unrealistically short. If it can be believed, they close off the chat at 3 PM Pacific. For a digital first company headquartered in California to be so naïve and ridiculous is almost unbelievable.  Wow!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7295071119","version":"3.10.11","date":"2021-05-04T00:35:59.000Z","authorName":"CurtisJacob","rating":3,"title":"Summon","body":"Option to pull forward or backward is gone?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7282812635","version":"3.10.11","date":"2021-05-01T00:12:37.000Z","authorName":"Tango486","rating":2,"title":"The Most Money Most People Will Spend for Something Not to Work","body":"Once we get into our Tesla Model Y, me and my wife agree it is the most technological car we have ever driven. Once. We. Get. In. See, one of the things that is sold is that you’ll never have to take your keys out of your pocket to open or start it. You have a card for backup but your phone is the main key you use everyday. And it all sounded exciting. I heard about the new tech they were putting into cell phones allowing them to open cars. Until I realized.....(Palm slaps face and drags hand down, pulling down bottoms of lower eyelids) they made it a software feature instead of hardware like keyless entry/keyless start cars that every other car now has pretty much standard. How did they not see this coming? So what’s even more annoying that a Tesla cannot be geofenced to your home so that it will not auto-lock every time you leave it, as if you will never have to just grab something from your car real quick without your cellphone as it is parked in your garage, but a software upgrade to either my phone or the Model Y has prevented me from leaving my phone in my pocket to open the car about 75% of the time. Think about that. Having a set of keys is now easier to open your car then having to reach into your pocket, unlock your phone by code with your mask on, open the app and then press unlock on this app. Pretty advanced, huh? 65 thousand dollars for this model folks and we’ve been rolling like this for about four months. It’s affected both mine and my wife’s phone. And yes we have already made sure Bluetooth is connected, background app refresh, blah, blah, blah.....\n\nMakes the car feel like garbage. When Apple makes that car they’re talking about, you know everything will work on it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7281963479","version":"3.10.11","date":"2021-04-30T18:45:41.000Z","authorName":"Militarynut","rating":1,"title":"App displays unknown error","body":"Since yesterday the app fails to show current status of location, status (driving or parked), and current miles left on battery.\n\nTried forgetting my phone and reinstalling it as a new device and that didn’t fix it. iPhone doesn’t allow deleting and reloading the app either.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7272008114","version":"3.10.11","date":"2021-04-28T02:45:24.000Z","authorName":"kyktv","rating":4,"title":"Feature Request: Depart at...","body":"For charging, how about setting the departure time from the Mobile App?  Since this can just be the default charging method, changing plans from the app would be great. Also, why does summon fail to connect even after tapping “reconnect” so many times? Can you support summon through BT for times when you quickly want to adjust your parking? Just be faster than climbing back in the driver’s seat!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7252794906","version":"3.10.11","date":"2021-04-23T00:28:05.000Z","authorName":"++ Dave Mac ++","rating":5,"title":"Notification sounds (update)","body":"Previous review noted that notification sounds were not working and it was tested on multiple phones. I think I solved the problem by signing out of other phones and creating a new Tesla account and sharing access with family members.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7237698219","version":"3.10.11","date":"2021-04-18T21:30:56.000Z","authorName":"Jay112323","rating":1,"title":"Concerned About Craahes","body":"I’m concerned about all the Tesla crashes, especially the fiery ones.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7236245536","version":"3.10.11","date":"2021-04-18T13:18:15.000Z","authorName":"Sirhc Nosckire","rating":1,"title":"Terrible on boarding","body":"I placed an order for a car, and installed the app like they said to while waiting. After logging in, all it says is “let’s go over the features of your model y”, but there are no buttons to click or anything. Pretty sad levels of QA which makes it disconcerting since the app is used to control the car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7232188772","version":"3.10.11","date":"2021-04-17T12:34:09.000Z","authorName":"yangz0327","rating":1,"title":"Can’t even log in","body":"Got error message that’s even humanly understandable... \n\nmethod: getOnBoardingData()\nserver failed to response. Is the server running?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7230199729","version":"3.10.11","date":"2021-04-16T23:32:23.000Z","authorName":"Qs Tesla","rating":4,"title":"Great App","body":"Very functional.  I just wish sentry video clips could send alerts to the app with video clips viewable in app.  Tesla should have their app engineers on it.  Would be nice to have 🤔","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7228242649","version":"3.10.11","date":"2021-04-16T12:03:30.000Z","authorName":"TeslaUSA","rating":4,"title":"Couple of improvement suggestions","body":"Couple of improvement suggestions:\n\n1. Notification when Tesla is parked at home and charging cable is NOT connected at charging start time: this will prevent waiting up in morning, realizing I forgot to connect charge cable previous night and now do not have enough charge to drive to work. \n\n2. Direct phone and chat function to communicate with Tesla vehicle support","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7220101609","version":"3.10.11","date":"2021-04-14T05:47:58.000Z","authorName":"Ohfficial","rating":2,"title":"Needs massive UI improvements and NEEDS to listen to customers","body":"I’ve had this app for only 2 weeks and I’m already wishing third party developers make a better UI and remote control for this car but I’m still sticking to this app since it doesn’t cost me $49.99/year for a remote control. \n\nMany companies like NIO and other EV cars are making their apps much better and easier to use but Tesla is still sticking to their 2016 phone app and isn’t updating much features.\n\nHaving widgets for this app would be a blessing as well. I’d love to open my trunk (not frunk) as I have used my frunk once. \n\nI love your cars Tesla! But the app needs work....\nCars deserve 5 stars. This app deserves 2.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7212247849","version":"3.10.11","date":"2021-04-12T01:17:29.000Z","authorName":"S20_K21","rating":2,"title":"Hardly works as a key unless you open the app","body":"Recently switched to iPhone from Android and thus started using this app. Unfortunately app quality is quite bad and doesn’t suit a tech company like Tesla. Phone as a key function is pretty much useless. It seldom works when I approach the car. I have to unlock the phone to get it working or turn Bluetooth on and off to get in the car even though  app has all the permissions it needs. Never had any access issue with the Android version. And I don’t think it is a Bluetooth range issue since it even happened when I was sitting in the car.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7207007826","version":"3.10.11","date":"2021-04-10T17:21:58.000Z","authorName":"ZAckrisson","rating":1,"title":"Reviews not in order of date","body":"Can’t you get the reviews in order of when they were written? Perfectly worthless for seeing what happened, did Tesla fix anything?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7204504501","version":"3.10.11","date":"2021-04-10T03:02:45.000Z","authorName":"SebastianLA","rating":3,"title":"Not connecting to car","body":"Please help","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7194902620","version":"3.10.11","date":"2021-04-07T16:47:57.000Z","authorName":"AZDoodle","rating":3,"title":"Notifications","body":"The app is set to show notification banners, sounds, and badges. I only get Lock Screen notifications. Please fix so I get sounds and badges.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7189127659","version":"3.10.11","date":"2021-04-06T05:15:03.000Z","authorName":"SiddG21","rating":3,"title":"Waking up and vehicle connection errors","body":"I'm tired of seeing \"waking up\" and \"vehicle connection error\" messages. I'm sitting 10 feet away from my car and there is still no connection. \nConnect using Bluetooth.\nConnect using my gigabit internet with mesh satellites everywhere.\nConnect using something.\nPlease!!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7183901298","version":"3.10.11","date":"2021-04-04T19:50:26.000Z","authorName":"G37x","rating":3,"title":"Good except real time tracking","body":"The app no longertracks rhe car location in real time. You have to click lication and then back and again to see an update. Please fix it!\nThanks.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7179059654","version":"3.10.11","date":"2021-04-03T14:32:49.000Z","authorName":"Lurosari","rating":4,"title":"Sugestion in the Backup history","body":"Hi \nIt’s posible in the are of Backup History, the program report the hour when we have the electric failed. That give the user the date, hour of the failed and from how many time.\n\nI can give more star, but my system have few month only. Probably other review in one year.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7176714662","version":"3.10.11","date":"2021-04-03T00:05:26.000Z","authorName":"Napoleon Bunnypart","rating":2,"title":"ETA is soooo off","body":"I just want to report that the ETA on the GPS routing is waaayyy, way off. I drove from Bellevue to Portland while checking my ETA on Apple Maps and Waze. Both were within reasonable distance from each other, around 1 minute difference. The Tesla estimate was off by THIRTY minutes. That is unjustifiable!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7176569965","version":"3.10.11","date":"2021-04-02T23:06:30.000Z","authorName":"S.Lebowski","rating":1,"title":"WARNING BEFORE UPDATING","body":"This release seems to have removed the ability to share an address from any other mapping locations to the Tesla application so for now I would suggest skipping this as hopefully it’s just a bug but maybe Tesla is removing features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7175979314","version":"3.10.11","date":"2021-04-02T19:05:59.000Z","authorName":"BenGentzler","rating":2,"title":"Widget","body":"What happened to the widget in the latest update? No longer available to add to my home screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7167656344","version":"3.10.10","date":"2021-03-31T18:31:48.000Z","authorName":"Andy19B","rating":2,"title":"No longer reliable","body":"For over a year this app would reliably wake up the car and allow control. But for months the car will no longer reliably wake up. \n\nSince this problem exists for both my iPad and Android phone, I expect it’s the car and not the app, but still. . . the end result is the app isn’t usable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7156867985","version":"3.10.10","date":"2021-03-29T02:12:03.000Z","authorName":"rLUCAS21","rating":1,"title":"Inconsistent","body":"Constantly disconnects so I have to turn off Bluetooth and turn it back on. Unlocking the car by walking up to it doesn’t work over 50% of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7149510587","version":"3.10.10","date":"2021-03-27T06:15:09.000Z","authorName":"Angu's Dad","rating":5,"title":"Great App. A suggestion","body":"Overall a great App. However, I would like to see charging status when phone is in Lock Screen. When using supercharger, it would be a nice feature to check status and remaining time w/o constantly unlocking the phone.  Along the same line if Apple Watch app can show charging % and time remaining, it would be awesome.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7149092157","version":"3.10.10","date":"2021-03-27T03:18:26.000Z","authorName":"stickeyn","rating":5,"title":"Developer","body":"Developer settings! I can’t download","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7140326932","version":"3.10.10","date":"2021-03-24T19:35:19.000Z","authorName":"fhskernfjshe","rating":5,"title":"Technoking","body":"Elon is a god","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7138748849","version":"3.10.10","date":"2021-03-24T11:12:57.000Z","authorName":"sjw2019","rating":3,"title":"From the app","body":"Turning on seat warms and fan works here and there does not work every time from the app when setting the temperature and seat warmer app needs improvement for this feature","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7133580470","version":"3.10.10","date":"2021-03-23T01:29:51.000Z","authorName":"610412","rating":5,"title":"Needs iWatch App","body":"The app works great. But it does need iWatch support.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7122474065","version":"3.10.10","date":"2021-03-20T03:08:57.000Z","authorName":"reb727","rating":4,"title":"One fix needed","body":"I wish the trunk open button was on the Home Screen instead of the “frunk” open button.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7111294229","version":"3.10.10","date":"2021-03-17T01:33:41.000Z","authorName":"xyc-81","rating":2,"title":"Made a service appointment and can’t view due to error","body":"It’s been a week and the app is failing again.  I have unread messages in regards to my upcoming service yet when I try and view the messages it says “Error please try again - error fetching service tracker”.  The app is buggy and  l constantly have to force quit and restart the app several times until it works.  This time it hasn’t worked in a week to find these messages.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7108457291","version":"3.10.10","date":"2021-03-16T07:47:03.000Z","authorName":"Vienna Tom","rating":3,"title":"Power Wall","body":"I have two power walls for my home. Is it possible to monitor or view each battery separately on the app? The app only shows one battery with a 2x on it. Do both batteries discharge at the same time? Or does my system use one battery, then the next? How would I know if a battery is faulty if only one battery is shown? Also only one battery serial number is shown on the app. I would love it if I could view both.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7108222743","version":"3.10.10","date":"2021-03-16T05:55:33.000Z","authorName":"Joeshow1981","rating":3,"title":"Solid app","body":"I use this to manage solar and powerwall. Needs support for multiple peak price schedules. These aren’t uncommon. Would be 5 stars with that feature.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7107428326","version":"3.10.10","date":"2021-03-15T23:54:30.000Z","authorName":"Sevak","rating":1,"title":"Cannot message service","body":"App needs a update asap can’t type text to respond back... the app is super slow needs a ui overhaul asap!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7107379014","version":"3.10.10","date":"2021-03-15T23:34:04.000Z","authorName":"Gmanrrrr","rating":4,"title":"Works but please add","body":"I use the app both for the car and solar/power wall. Generally other then a few minor staleness issues with some of the data/states, it is a pretty clean and simple app. My only request is that Tesla add some iOS widgets for the app. Would be really nice to be able to glance and see what my power management is doing and any events like loss of power or storm watch. I would add so it my lock screens. Or even home screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7104206397","version":"3.10.10","date":"2021-03-15T03:24:28.000Z","authorName":"FreshAB","rating":4,"title":"Not bad but still have issues to work on","body":"The experience with Tesla app has been improved a lot since I installed it last year, but  there’re still more things to improve to continue accelerating the world’s transition to sustainable energy. \nThe phone key hasn’t been stable, it’ll pop up at some point during driving, which degrades the driving experience. The app only contains the function to open the front trunk, and it’s still not accessible for viewing the sentry mode videos on the phone side. I hope Tesla could publish the new version sooner, not every quarter or longer, since most of Tesla users would expect more fresh things to accomplish with the car and the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7104004349","version":"3.10.10","date":"2021-03-15T01:54:49.000Z","authorName":"JustinK101","rating":3,"title":"Needs a refresh and native iPad support","body":"The U/I is a bit dated and lacking in features. Also, there is no native high resolution iPad version.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7095589784","version":"3.10.10","date":"2021-03-12T19:48:22.000Z","authorName":"sxegti","rating":3,"title":"Issues with reading messages","body":"Still unable to view and send messages to the service. It says I have messages but I have no way to view those.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7088898819","version":"3.10.9","date":"2021-03-11T00:24:55.000Z","authorName":"psicobloc","rating":3,"title":"Real shame..","body":"It’s a shame that a company with enough money to throw 1.5 billion dollars at Bitcoin can’t invest a tenth of a single percent of that into the darn app that powers their core product. At the very minimum - I would like to see updated widgets for my phone. Next would be actions available for the shortcuts app - an easy addition. Trip and charging history, battery drain history, etc would be nice as well. \n\nTesla could easily wrap all these features together and eliminate my reliance on third party apps - which I must give my credentials to… and which poll the car continuously throughout the day, every day.\n\nPlease Tesla! Give this app some love!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7081445323","version":"3.10.9","date":"2021-03-09T00:15:41.000Z","authorName":"why vvyy","rating":1,"title":"Can't get into the car!","body":"Not sure if it's the app or the car but it's more glitchy to unlock the car. Getting tired of the app trying to troubleshoot/unlock the car in the cold.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7067369758","version":"3.10.9","date":"2021-03-05T09:19:07.000Z","authorName":"PWSinNYC","rating":4,"title":"More charging control please","body":"Works well. Has improved with time. Could be better. \n\nI would specifically like to be able to adjust charging settings from the app. My schedule is not the same every weekday. It would be helpful to be able to change the scheduled departure time from the app.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7062494816","version":"3.10.9","date":"2021-03-04T01:34:27.000Z","authorName":"Rydeeerrrd","rating":3,"title":"The app is meh","body":"It does the basics like controlling the cars climate, trunk, frunk, and summon but it’s kind of dumb considering the car it’s used for. It lacks the ability to schedule charging, integrate with Siri and Apple Watch, view super chargers on a map in the app, among other basic integrations.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7061821263","version":"3.10.9","date":"2021-03-03T20:45:15.000Z","authorName":"Joe 610","rating":4,"title":"Model 3 and Energy customer","body":"The app is great for the car, there's some minor bugs with the phone key that still pop up sometimes.\n\nThe energy side of the app still needs a lot of work.  The biggest issue for me is the lack of customization for time-of-use billing.  The system is so close to what I want, just need a few more options; such as being about to charge the powerwalls from the grid during off-peak hours for days with low solar output. And better integration with the car for charging during off-peak hours.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7060927181","version":"3.10.9","date":"2021-03-03T15:18:21.000Z","authorName":"David662","rating":4,"title":"Love the app","body":"But with iPhone 12 the car would 99% of the time won’t open not sure what the issue is and from what I heared it seems like I’m not only one having that issue all iPhone 12 users do","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7057217341","version":"3.10.9","date":"2021-03-02T15:38:23.000Z","authorName":"OkieMD","rating":1,"title":"Okie36","body":"This app looks as though it is all about the cars and noting for the old Solar City customers. I can’t even log into the app. There is no where that I can find information on how to contact a live customer service person to ask questions.\n\nEverything worked so smoothly with the Solar City app that I had not even attempted to look up anything since the change in ownership. With looking forward to spring I wanted to look at how much energy we are making now and compare after spring. \n\nIt would be nice to be able to use the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7054828497","version":"3.10.9","date":"2021-03-02T00:47:28.000Z","authorName":"Zac_LOL","rating":4,"title":"Few suggestions","body":"Love the app.  Love the car.  But I feel like a few tweaks would make it so much better.  \n\n1) Trunk button on main page (Not just frunk)\n2) Log of drive and charge statistics for the nerds. \n3) The ability to switch how charging is displayed.  Percentage and miles ( currently mirrors the cars current settings so I have to walk to my car and switch it each time I want to see something different) \n4) Valet mode options.\n5) Would be great to see sentury mode events or previews on the phone. For when you’re away from the car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7047336410","version":"3.10.9","date":"2021-02-28T03:00:18.000Z","authorName":"dbg2241","rating":4,"title":"Good. Needs Apple Watch app.","body":"I know tesla will probably never see this. But please, please make an Apple Watch app. The app is good on iPhone; way better than any other car manufacturers offer, but because this is tesla I know you can do more. There are a couple of third-party apps that already do most of this, but please add some more info about driving habits and especially an Apple Watch app. Maybe you could have it to where the car will unlock automatically even if you just have your watch. (It’s just Bluetooth)\nUPDATE ADD IOS 14 COMPATIBLE WIDGETS PLEASE! \nThe current one is a dated “legacy” widget, and can’t be on the Home Screen. Fix it please.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7046782732","version":"3.10.9","date":"2021-02-27T23:29:06.000Z","authorName":"jANIan23","rating":5,"title":"Love This App","body":"It’s such a great app/car key. From heating the car before I leave for work, notifying me if I’ve left a window open etc. and the Easter eggs are such a fun touch","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7042479161","version":"3.10.9","date":"2021-02-26T21:55:29.000Z","authorName":"noam124","rating":5,"title":"Amazing!","body":"10 out of five! This app is so amazing and convenient whether I’m summoning the car or setting the climate.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7041969138","version":"3.10.9","date":"2021-02-26T18:25:49.000Z","authorName":"Folkse","rating":4,"title":"Good app, needs one thing!","body":"Storm Watch does not work consistently. Determining which storms to trigger Storm Watch charging must be technically challenging. As that long term challenge is worked on, a short term solution (and drastic improvement in terms of functionality) would be to enable end users to turn on Storm Watch themselves, manually triggering the Powerwall to charge from the grid.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7033222890","version":"3.10.9","date":"2021-02-24T13:44:28.000Z","authorName":"A mom on the move","rating":3,"title":"Phone Key issues","body":"Great app. Has all the necessary features to manage your vehicle. Only issue is the phone key constantly disconnects. I have to delete and reinstall twice a week. Lost two stars for this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7031127665","version":"3.10.9","date":"2021-02-24T01:09:56.000Z","authorName":"chipmunkJ","rating":1,"title":"Powerwalls","body":"Update: it’s been over a year since I last wrote this comment about the problem of notification during power outage, no one in Tesla seem to be even reading these comments. Same problem still exist, and this is a major issue. We just had 4 major power outages in the past 3 months and each time I never received notification that grid is off, so I used up most my battery during a snow storm when I could have conserved energy if I had gotten the notification. I really like Tesla products, but until they can get their act together and put out better customer support on their apps, phone calls, emails, etc,  I won’t be purchasing anything else from them anymore. This is really disappointing and unacceptable.\n\nI use this app mainly for my powerwalls. It’s nice to see live power usage on the app. Sometimes when our power goes out and powerwalls kick in, it doesn’t always notify me that it’s now using powerwalls even tho it was set in settings. This is important bc we frequently get outages over 14-16hrs and would be nice to know so we can conserve energy. It would also be nice to see the time power went out in the history instead of just showing how long it went out. Lately the energy usage chart doesn’t seem accurate. As I’m writing this our power is out (bc shown on PUD outage map plus all street lights,  neighbor house lights all out) but it’s showing normal consumption on app, not showing outage. Also, sometimes powerwall shows 0% left when in fact it’s fully charged. I expected more from Tesla esp after 2yr wait on the powerwalls and the price.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7027581133","version":"3.10.9","date":"2021-02-23T03:10:31.000Z","authorName":"adamcnaglich","rating":2,"title":"It works, but it should be better","body":"The app is definitely of lower quality than the car. The widget is broken in dark mode. Adding support for Apple CarKey and Apple Watch is missing. Unable to create or modify the scheduled departure and preconditioning.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7027249485","version":"3.10.9","date":"2021-02-23T01:00:12.000Z","authorName":"drummr160","rating":5,"title":"Looking Forward to Version 4","body":"Love this app, but I am looking forward to version 4 and hoping for more functionality.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7015191742","version":"3.10.9","date":"2021-02-19T23:22:55.000Z","authorName":"Dkde007","rating":1,"title":"No longer wakes car","body":"Used to work fine. Now won’t wake up my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7014187741","version":"3.10.9","date":"2021-02-19T16:50:01.000Z","authorName":"DRock3800","rating":3,"title":"Sharing location with Apple Maps no longer works","body":"Please recode your sharing feature so it once again works with Apple Maps on iOS devices.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7011169881","version":"3.10.9","date":"2021-02-18T22:50:43.000Z","authorName":"PDinNY","rating":3,"title":"Not up to par vs in-car software","body":"Yes, App is functional. Handles the basic tasks well. But would be nice to be able to:\n- read about latest software release \n- schedule charging/depart times from the App\n- send routes to navigation remotely, in addition to supercharger locations, via the App\n- send Sentry event alerts and clips (even if only a snapshot) to the App via notifications on phone","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7010179552","version":"3.10.9","date":"2021-02-18T16:27:58.000Z","authorName":"teslamikemen","rating":1,"title":"It’s worse tam the worst always crashes.","body":"The app is great been great but for the past 20 days it’s been crashin. It takes forever to load and sometimes when I open it it says and error has occurred and stops.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"7003048728","version":"3.10.9","date":"2021-02-16T23:42:02.000Z","authorName":"Jamezam","rating":1,"title":"Major app update over a year ago!","body":"You’d think there’d be more major app updates and that the app bugs would be addressed. Also, the Service Messaging function does not work. Have notice of new messages from Service Team, but can’t read them!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6997620943","version":"3.10.9","date":"2021-02-15T14:33:19.000Z","authorName":"Scooter McBoogerballs","rating":2,"title":"Unstable at any speed","body":"The app has had more and more of a difficult time connecting to my Model 3. Features like “summon” that rely on the connection are therefore unavailable.  I’ve tried uninstalling and reinstalling the app. Really poor and no ability to get in touch with Tesla to schedule service without the app. Everything customer service about Tesla is poor and done through the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6997209347","version":"3.10.9","date":"2021-02-15T12:30:13.000Z","authorName":"JiltedFool","rating":2,"title":"Ignored Software","body":"Tesla put the software out and it had huge promise. Like all things Tesla, it gets ignored primarily because Tesla isn’t a software company. Performance of the app is spotty, some times requiring you to quit the app multiple times before you get a connection to your car. Notifications for sentry mode or alarms never happen, even though there are setting air each. Controls are limited, even though Musk has promised full control. “Hey Siri” features are a mystery (and also limited). It seems that the primary purpose of this app is to get Tesla car owners to swipe left one too many times to start an annoying Tesla home charging options page. \n\nCan’t wait for more competition in the EV space. Particularly from companies that: 1) know how to make and service cars, and 2) know how to develop, release, and support software.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6996369007","version":"3.10.9","date":"2021-02-15T07:42:44.000Z","authorName":"Baby toy","rating":3,"title":"This app is getting better","body":"However inconsistent communication between the vehicle and it makes it to 3 stars. Perhaps admin can add consumption graphs in terms of $ in charging, remote window roll ups etc.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6994507200","version":"3.10.9","date":"2021-02-14T18:59:39.000Z","authorName":"JayGuz","rating":5,"title":"Poor Connection","body":"I am dropping this review to two stars. The app keeps telling me it is waking up then says “Connection Failed” and not sure why. I’be tried in WIFI and LTE and still have this issue. Very sad since I would like to consistently check on the miles and up the temperature before heading to my vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6987244862","version":"3.10.9","date":"2021-02-12T23:55:16.000Z","authorName":"chromium protogen","rating":5,"title":"One suggestion.","body":"An Apple Watch app would be great for this app. Would love to see it happen!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6986185470","version":"3.10.9","date":"2021-02-12T17:09:36.000Z","authorName":"Sergio Momarsh","rating":5,"title":"Remote Control Car","body":"Seriously, this app lets you drive a full size car remotely. It lets you open and close your garage, heat your seats, precondition your battery, control your stereo, follow your car on a map if you aren’t in it, wash your dishes, fold your laundry... rich people future stuff. Get a car. Download this app. Be the future.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6981576433","version":"3.10.9","date":"2021-02-11T13:29:59.000Z","authorName":"Sachin Wadhawan","rating":2,"title":"Buggy","body":"Services appointment not working. Overall not a stable app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6970465215","version":"3.10.9","date":"2021-02-08T17:43:15.000Z","authorName":"bontup","rating":2,"title":"PV & PW User","body":"Functional for solar and power walls, but some screens don’t seem to have anything on them. Needs a next level of polish (iPad res) and some more stats for nerds (temp). PRETTY PLEASE make a widget for the home screen!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6963000971","version":"3.10.9","date":"2021-02-06T22:46:54.000Z","authorName":"Zach Granata","rating":4,"title":"Widget needs a dark mode revision","body":"The colors of the widget remain dark even when using dark mode therefore it is very difficult to use. Should be an easy fix, I hope the fix it soon. Other than that, this app is amazing and is light years better than other vehicle apps! The ratings that are lower with frustration on connections and stuff is not the app itself - you can’t control your cars cellular quality with app reviews...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6958452295","version":"3.10.9","date":"2021-02-05T20:10:58.000Z","authorName":"BCR1969","rating":1,"title":"Constant Connection trouble","body":"Daily challenges with no ability to connect. When this is supposed to be a key part of the value prop and it is clear this is a ubiquitous problem, indicated a serious flaw and a lack of focus on aftercare.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6953383430","version":"3.10.9","date":"2021-02-04T15:04:14.000Z","authorName":"jmatero","rating":3,"title":"Missing Features","body":"Use the app with my Model Y and works well for the most part. There are 4 missing features that would be helpful:\n1. No manual or auto control for rear defogger.\n\n2. There’s a button to open frunk but not for hatch.\n\n3. No ability to send destinations to nav from app.\n\n4. No Siri Shortcut integration.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6945166243","version":"3.10.9","date":"2021-02-02T15:16:14.000Z","authorName":"kingsobfb","rating":1,"title":"Super slow","body":"You can make a car drive itself, but tapping on service within the app takes literally a minute to load...","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6942859929","version":"3.10.9","date":"2021-02-02T02:22:20.000Z","authorName":"A very nice tesla owner!","rating":3,"title":"Great app for my Tesla model s! But..","body":"The app doesn’t work well for iPads. So I would like to have an iPad version of this app so it works better. Still, a great app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6942142531","version":"3.10.9","date":"2021-02-01T22:00:23.000Z","authorName":"নওেসের","rating":1,"title":"Turning on climate control","body":"Tesla app takes about 10 to 15 minutes just to connect..","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6936022189","version":"3.10.9","date":"2021-01-31T10:52:09.000Z","authorName":"Daveruvolo","rating":3,"title":"Works well but could use a few more features","body":"Would love to be able to:\n- preschedule a single departure. If I know I’m going somewhere later today that isn’t part of my normal routine for a daily schedule I’d like to preschedule that 1 trip so the car can precondition\n\n- view sentry recordings or sync them to an outside data storage like Dropbox \n\n- offer a watch companion app\n\n- limit what shared access users can do. If I share the key with someone I don’t necessarily want them tracking my every movement or controlling the hvac\n\n- configure additional limits based on driver such as speed limit. For example sharing the car with a new driver could allow me to set speed limits and acceleration limits.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6933591230","version":"3.10.9","date":"2021-01-30T19:16:26.000Z","authorName":"Vindyii","rating":4,"title":"Great overall but zoomed view doesn’t work","body":"The zoomed view has a large gap on the top. Much appreciated if can be fixed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6933395642","version":"3.10.9","date":"2021-01-30T18:06:58.000Z","authorName":"Yraegel","rating":2,"title":"No face or Touch ID","body":"App requires recurring login. Touch and Face ID are never used.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6932753617","version":"3.10.9","date":"2021-01-30T14:47:19.000Z","authorName":"Forbes3152","rating":1,"title":"Customer Service","body":"The customer service aspect of the app is horrible. You will be expected to chat with them via text and the app and they can take weeks, sometimes months to reply. I finally had an issue escalated to email, and they take 1 month to reply to each correspondence dealing with an overheating issue. It’s a fire hazard and they don’t even reply.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6931183901","version":"3.10.9","date":"2021-01-30T06:10:53.000Z","authorName":"zacrn","rating":3,"title":"Solar deleted from app","body":"I’ve been using the Tesla app to control my car and check the production of my solar panels.  Yesterday when I opened the app, it showed a message that I don’t own the solar panels anymore then it deleted it from the app.  I do not know why it did that.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6930113283","version":"3.10.9","date":"2021-01-29T23:23:21.000Z","authorName":"kingstar_42","rating":1,"title":"Where is dual peaks for solar!?","body":"Edit: Situation is worse now. They just killed the api so we can't even use scripting to make up for the shortcomings of the app. During off peak, I don't want any power coming from the Powerwalls to save cycles on the battery and not have the 10% loss going in and out.\n\nI live in AZ in SRP territory. During the winter they have 2 separate peak times, yet there is no way to set up 2 peaks in the app. People have resorted to creating Pithon scripts or using outdated SmartThings apps to create a pseudo dual peak. I know we aren’t the only ones with dual peaks. Please implement a solution.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6928414013","version":"3.10.9","date":"2021-01-29T13:42:50.000Z","authorName":"timcschmidt","rating":1,"title":"Buggy and with little quality control","body":"Today, the app flaked out again showing I have no products associated with my account. When it works, monitoring and metrics available for tesla PV systems are extremely basic.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6928330703","version":"3.10.9","date":"2021-01-29T13:18:28.000Z","authorName":"AT-TVB","rating":1,"title":"Useless app!!!","body":"Every other day apps only have “Welcome to Tesla” but nothing else beside “get support”! Nothing can be done! Useless!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6925200216","version":"3.10.9","date":"2021-01-28T19:19:02.000Z","authorName":"RozNY64","rating":4,"title":"Works well, please add support for multiple garage doors.","body":"The app works well. I wish they’d add the ability to choose from multiple garage doors with homelink. All are accessible from the car’s screen, but only one is available from the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6923318676","version":"3.10.9","date":"2021-01-28T11:01:47.000Z","authorName":"PCG.","rating":3,"title":"Great, when it works","body":"It freezes or stops working and I get a error message","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6918510746","version":"3.10.9","date":"2021-01-27T06:27:21.000Z","authorName":"FilthyJeepGirl","rating":1,"title":"App is abysmal","body":"I cannot wrap my head around how Tesla is the leader of innovation with regards to a lot of products, especially the EV market. That said, this app constantly has connectivity issues that persist despite every conceivable workaround to try and fix it. I would say I cannot connect to my Tesla 90% of the time with this app no matter whether I’m at home, work, or any other location. Translation: I can’t pre-heat or pre-cool my cabin, initiate or stop charging, open the frunk/trunk, summon her, turn on Sentry Mode... nothing. Completely unacceptable considering the price tag that goes with a Tesla. When it comes to customer service Tesla is leagues behind BMW, Mercedes and even non-luxury cars like Subaru. Embarrassing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6916820040","version":"3.10.9","date":"2021-01-26T19:01:20.000Z","authorName":"Impressed of New York","rating":1,"title":"Rarely connects to car","body":"Really frustrating that it fails to communicate with the car most of the times I use it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6912317954","version":"3.10.9","date":"2021-01-25T15:18:01.000Z","authorName":"freestorageisgreat","rating":1,"title":"Worst app ever","body":"Tesla car is good but this app drugs the total user experience down. It always asks me to enter my password though it has been saved with the iPhone Face ID. Even you enter the correct password or reset password, it won’t allow you to log in. I have to use my card every time. It is very annoying.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6905411066","version":"3.10.9","date":"2021-01-23T20:32:19.000Z","authorName":"spinningtaz","rating":3,"title":"Connection issues with car","body":"While the app once connected to the car works fine and does its job, the ability for the app to actually connect is spotty. If like me you are hoping to warm up the interior before hand during the winter months, you may not succeed because of this issue. The Bluetooth will connect so that you can enter the car but getting other functions to work may not. Sometimes it is spotless and sometimes you just want to chuck it in frustration.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6903521691","version":"3.10.9","date":"2021-01-23T10:06:40.000Z","authorName":"Armando12195","rating":2,"title":"App","body":"Backup history do not show the time of an outage event. Must improve notification system. Most of the time when an event occurs, no notification is received or it is received hours after the event.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6898987529","version":"3.10.9","date":"2021-01-22T06:17:29.000Z","authorName":"....matttttttiiiiieeeee","rating":3,"title":"Updates?!","body":"Is there ever gonna be an update for the Tesla App? How is it that every single developer out there doing Tesla apps releases a new, more improved and updated version of their own 3rd party app every week with Widget features, improved performance, new designs and add ons vs the mother-ship “TESLA” app still looks like a high school kid designed and developed it. Where’s my iwatch integration? Where’s my Widget feature for the new iOS, where’s remote controlled features like “schedule charging/departure”, where’s charging and battery health report’s.. soooo many things are missing. You’re either working on a major update to be released fixing it all or you just simply don’t care about the mobile Tesla app experience. I would like to know which one it is.. thank you!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6881309891","version":"3.10.9","date":"2021-01-17T15:45:06.000Z","authorName":"jk12345678901","rating":3,"title":"Needs even faster access to car controls","body":"Can you please have a way to add frunk/unlock buttons to the iOS control center - perhaps through iOS Shortcuts integration?\n\nPlease also allow better integration with iphone media - like podcast library and other playlist controls?\n\nPlease add release notes of the car software updates to be available within the app for easier review.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6879419381","version":"3.10.9","date":"2021-01-17T04:47:45.000Z","authorName":"Austy2021","rating":5,"title":"Tesla app for Apple Watch?","body":"Hey, so the Tesla app is great and all, but is there a way we could get a simplified version for Apple Watch? I think that would be great and very useful. Something to show us the range, charging, and enable us to use a few features such as summon.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6878798877","version":"3.10.9","date":"2021-01-17T00:45:35.000Z","authorName":"Bacondoggie","rating":4,"title":"Great app, just needs more device support","body":"I wish this had Apple Watch support, so I don’t have to pull my phone out of my pocket to summon my car or to open the front trunk.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6878266636","version":"3.10.9","date":"2021-01-16T21:14:06.000Z","authorName":"Thejulman","rating":4,"title":"Tesla rules!","body":"Great app and a very user friendly interface. But where is the Apple Watch support? Seems like it would be a no-brainer for Tesla to support the smart watch. Come on!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6872568446","version":"3.10.9","date":"2021-01-15T12:04:33.000Z","authorName":"Alsalamah","rating":5,"title":"Hi Tesla","body":"Dear Tesla,\nI don’t have a Tesla in my country yet I’m happy to see How Tesla be coming improve and the apps to but I wish when I go to the app Servise not takes me to the website and I I wish Tesla include a faceID option because can open the app and I wish too if you add security code..","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6869201189","version":"3.10.9","date":"2021-01-14T14:42:11.000Z","authorName":"jotabeese","rating":1,"title":"Not woking at all.","body":"The app is not working.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6866000938","version":"3.10.9","date":"2021-01-13T18:59:20.000Z","authorName":"GadgetManRH","rating":2,"title":"App (Energy side of app)looks nice...but numbers are wrong","body":"I monitor my system and noticed anomalous numbers being reported for daily House energy use, solar production, PowerWall charge and discharge and grid use. I have downloaded the CSV files for a few days so I could compare numbers reported by the app against numbers in the downloaded files.  On Jan 10, 2031 the app reports that 33kWh were generated by my solar array. The downloaded file (from Tesla) shows instead 44.09kWh of energy from the solar array. The data from the inverter support the 44.09kWh number. There are discrepancies for other Tesla app reported numbers. The Tesla HW seems to record the data correctly, but the app does not add up the numbers correctly. This I can no longer rely on the app to really tell me what is going on. Tesla, what say you?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6858865812","version":"3.10.9","date":"2021-01-11T22:56:35.000Z","authorName":"zooommbbiieess","rating":1,"title":"Obvious detects on delivery","body":"Tesla is a joke. They deliver their cars with obvious detects at a great inconvenience to their customers. \n\nEdit: 2 service center appointments later and my car is still having issues. I’ve spent nearly 8 hours commuting to the service center and back.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6849737916","version":"3.10.9","date":"2021-01-09T15:29:46.000Z","authorName":"E'Zero","rating":2,"title":"summon is not working well with the latest softwear 2020.48.30 plz fix the issue","body":"hope that new update for the app regarding summon issue will be solved because it dosnt work when 2 sim is working in phone","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6843879706","version":"3.10.9","date":"2021-01-08T03:59:35.000Z","authorName":"AmanSL","rating":3,"title":"Good but ux could do with some tlc","body":"How long does it take for you to update the widgets so they are the right contrast for dark mode settings on iPhone ? Black on black is unreadable surprisingly...(!)","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6840309795","version":"3.10.9","date":"2021-01-07T05:19:35.000Z","authorName":"Toiletbrushxxx","rating":4,"title":"Good, but could be great.","body":"+1 to Heisenberg’s request below to have charging scheduling and departure scheduling control via the app.  If it could be integrated to coordinate with the location on the next day’s calendar event, that would be very Tesla-esque. Event time - estimated travel time under normal conditions as calculated by the nav system = suggested departure  time. Once the event is re-confirmed via the app (say, the night prior) the car sets its charging time to complete at departure like it currently does. \n\nApple Watch support would be nice too. Even for just limited functions like opening the frunk or setting climate. Getting push notifications for Sentry events could also be useful.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6832158882","version":"3.10.9","date":"2021-01-05T01:59:27.000Z","authorName":"stalinCCCP415","rating":4,"title":"Mostly great","body":"Please update the app to use iOS 14 style widgets. The current old style makes the black text unreadable when the phone transitions to dark mode.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6822513419","version":"3.10.9","date":"2021-01-02T14:48:16.000Z","authorName":"LockPav","rating":1,"title":"There is something wrong with this app.","body":"It works when it wants to and struggles to get signal most of the time. I’d say the app works really well about 40 percent of the time. All in all, I wish there were more features on the app. \nI also don’t particularly like their whole appointment thing they have going on. The whole getting a whole of a Tesla mechanic is kind of a drag. \nLove the car just wish the services were more adequate.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6819668126","version":"3.10.9","date":"2021-01-01T22:43:39.000Z","authorName":"Michael Wells","rating":1,"title":"Solar UI and functionality","body":"The app updates about 4 times a day with new and conflicting data. The graph is often wrong and numbers don’t add up correctly. \n\nIf you want an app to give you data on yesterday’s solar activity you’ve found the best app around. \n\nI’ve only tried the solar-side of the app but it’s mediocre at best. It’s embarrassing that it doesn’t work native on an iPad. Its 2021! \n\nMaybe Tesla’s doesn’t have enough money to do apps right.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6819481757","version":"3.10.9","date":"2021-01-01T21:28:40.000Z","authorName":"Йоллопуки","rating":5,"title":"Ukrainian store","body":"Tesla, please, publish app in Ukrainian store too.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6815913291","version":"3.10.9","date":"2020-12-31T22:53:20.000Z","authorName":"versacepapii","rating":2,"title":"App Restarts","body":"The app takes way too long to refresh. It’s almost like I need to have the app running all day for it to not take minutes to even refresh.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6815429922","version":"3.10.9","date":"2020-12-31T19:21:45.000Z","authorName":"Jase415","rating":2,"title":"Solar Disappointment","body":"These reviews are kind of pointless, because if you have Tesla solar panels this app is the only game in town. The app would actually be pretty decent and usable except for two shining disappointments: First, it doesn’t have a native layout for iPads so you’re stuck with a tiny iPhone size view or a scaled up view with jagged graphics. Apparently no Tesla developers know how to use Auto Layout in Xcode. Second, the app is at the mercy of your gateway device to collect and relay data, so if that device is buggy and slow this app feels buggy and slow (e.g., showing 0 kWh production when it is sunny and your panels/inverter are doing fine). Tesla probably can’t fix the latter shortcoming via this app, but they could certainly fix the former issue if they wanted.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6811902575","version":"3.10.9","date":"2020-12-30T20:30:48.000Z","authorName":"pdx-ne","rating":2,"title":"Slow, slow, slow","body":"For an app that controls everything that has to do with my car, it really doesn’t work well. It’s slow- often spinning for many minutes trying connect to my car. The scheduling service portion is really buggy and doesn’t load 80% of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6811349575","version":"3.10.9","date":"2020-12-30T16:56:21.000Z","authorName":"BigDaddyMoe","rating":4,"title":"Apple Watch app please?","body":"Come on Tesla, you’re changing the world but you don’t have an app for the Apple Watch?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6810119712","version":"3.10.9","date":"2020-12-30T10:09:32.000Z","authorName":"Heisenberg60","rating":4,"title":"Need scheduled charging functionality in the app","body":"I have no issues with existing functionality... it’s been reliable and handles almost everything I need. I would however love to have the ability to control scheduled charging and scheduled departures to precondition the car from the app instead of having to go to the car to do it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6808062519","version":"3.10.9","date":"2020-12-29T20:02:14.000Z","authorName":"MelodyHere","rating":2,"title":"“Waking up” takes too long","body":"I just want to warm up the car before I leave the house. Starring at the screen for a full minute for it to “wake up” the car is not fun. Can you please update it so I can queue a command to turn on the climate once it woke up the car? \nThank you!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6807929336","version":"3.10.9","date":"2020-12-29T19:07:31.000Z","authorName":"Georgiyaaa","rating":2,"title":"Cool app but not seeing my solar panels","body":"Couldn’t wait to check out this app and all the info it provides but when I log in, I’m not able to see my solar panels on the account. Called support a few times and they’re looking into it I hope!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6801804804","version":"3.10.9","date":"2020-12-28T03:49:21.000Z","authorName":"Nolefan144","rating":3,"title":"Requires Restart Often","body":"The app tells you to never force close the app but I have to do so often to re-establish communications with my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6790016737","version":"3.10.9","date":"2020-12-24T23:09:22.000Z","authorName":"bnramos","rating":5,"title":"Portrait mode screen","body":"Love this app. It just need a portrait mode screen when phone is on horizontal to be able to show speedometer when driving. It will be a cool feature as speedometer indicator","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6788768294","version":"3.10.9","date":"2020-12-24T14:41:17.000Z","authorName":"Mitchell Pash","rating":1,"title":"Model Y Owner","body":"This app is a joke. Your mobile service messages don’t deliver to both drivers on the account. The messages haven’t been showing up in the service page. A mobile tech just showed up today for an appointment I canceled 5 days ago because of this bug. AutoPilot doesn’t need anymore work Elon, your iOS apps are struggling for air. Hire more competent iOS devs.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6786239332","version":"3.10.9","date":"2020-12-23T21:42:57.000Z","authorName":"YHY0","rating":2,"title":"Need multiple accounts support","body":"I have different Tesla vehicles in different countries, but I cannot access all of them under one single account, so could you please add multiple accounts support in the app, especially for the model 3 and y without a key fob, I will have to log in and out every time I switch cars","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6786105440","version":"3.10.9","date":"2020-12-23T20:45:18.000Z","authorName":"Dda0307","rating":5,"title":"Excellent user interface and design","body":"I use it to monitor my solar energy generation and usage. It’s real-time and accurate.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6782221793","version":"3.10.9","date":"2020-12-22T18:23:43.000Z","authorName":"jamie sjeetshoota","rating":4,"title":"Vehicle unlocking whole phone is locked","body":"I find myself having to pull out my phone and wake it up just to unlock my model 3.\nSome times it works while my phone is in my pocket, but more often than not I have to wake my iPhone.\nHow can this be fixed?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6782194130","version":"3.10.9","date":"2020-12-22T18:12:16.000Z","authorName":"Robvme","rating":3,"title":"Lazy App Dev","body":"While the app is functional all it is is a browser link.  I was expecting a better app from Tesla.  This is just lazy app dev.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6767140341","version":"3.10.9","date":"2020-12-18T15:43:45.000Z","authorName":"Seattle-6","rating":1,"title":"Lacking basic functionality","body":"I love my Powerwalls.  This app leaves much to be desired though.  When I change the setting from “self powered” to “time based control” sometimes it doesn’t respond, takes a long to respond, or doesn’t respond at all. When it does go into Time Based Control, it doesn’t perform properly—discharging the battery during super off peak and pulling from the grid during peak hours.  \nI have submitted trouble tickets through the app, and have NEVER had Tesla respond.  \nThe interface to configure time based control is rudimentary and doesn’t have the capability to configure three price tiers, only two. Nor does it have any capacity to configure a different set of hours for weekends.  I could go on, but from my experience Tesla will not read this or take any interest in fixing the app or adding functionality.  We are stuck with what they give us.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6760927918","version":"3.10.9","date":"2020-12-16T21:55:38.000Z","authorName":"kerrymitchel91","rating":3,"title":"Not working.","body":"Guys get it together. App isn’t working. This is TESLA for crying out loud. Great thanks","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6750079920","version":"3.10.9","date":"2020-12-13T19:53:58.000Z","authorName":"losing confidence","rating":1,"title":"Worst app I have ever used","body":"The log in does not recognize my account. It says it has no record of my products.  There is zero help.  The app is not integrated with the products and there is no fix.  I would suggest using a different company","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6746284218","version":"3.10.9","date":"2020-12-12T19:20:47.000Z","authorName":"Triumph Saint","rating":1,"title":"Took forever!!!","body":"The inverter for our solar panels went out in June. We were told they were on back order in September from the manufacturer in Italy. Now after 2 canceled appointments by Tesla they are finally here today, December 12, 2020 to install the new one at it doesn’t work!!! Unbelievable!!! Sorry I ever bought TeslaX10000!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6745205482","version":"3.10.9","date":"2020-12-12T13:23:06.000Z","authorName":"Alijah Simon","rating":3,"title":"Doesn’t have EV Routing in Apple Maps","body":"Title says it all. Apple supports EV routing in the Apple Maps app, if the user’s car’s app integrates with it. Tesla clearly has yet to do this because no option to route my Tesla with superchargers on a longer trip shows up in my Maps app yet.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6742942766","version":"3.10.9","date":"2020-12-11T22:50:06.000Z","authorName":"Bruinsp","rating":1,"title":"Pretty terrible","body":"Just took delivery of my model y yesterday and noticed some fit and finish issues I wanted to get taken care of. I was told that I could do that from the app within the 3 days after taking delivery. Well the option to schedule delivery was not on my app so I called the store where I picked the car up from. The service department couldn’t be bothered but the sales rep told me to delete and reinstall the app. I did and now when I login to the app it appears as tho I have yet to take delivery of the car. So now the app is useless and I can’t schedule a delivery to get these issues fixed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6742453566","version":"3.10.9","date":"2020-12-11T19:34:42.000Z","authorName":"Pogohop","rating":4,"title":"I want a Tesla","body":"Or any electric car","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6734721157","version":"3.10.9","date":"2020-12-09T16:09:15.000Z","authorName":"hhfhkkgc","rating":1,"title":"Never lets me in my car","body":"Although I have the app set to always have my location on, it will never let me in my model y without first opening the app in my phone!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6732594277","version":"3.10.9","date":"2020-12-09T01:50:19.000Z","authorName":"oldArty","rating":4,"title":"Almost perfect","body":"I’m as in love with my Tesla model S today as I was when I got it 3 years ago, I can’t say that about any other car I’ve ever owned.  The app is great and like MANY Tesla owners I anxiously await each software update, authorize the update via the app, then make my way to the car to to read what was delivered.  I wish Tesla would enable the ability to read release notes via the app so I did not have to run to the garage to jump in the car and check especially since I’m in the beta group and updates are even more anxiously awaited.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6731364468","version":"3.10.9","date":"2020-12-08T16:56:49.000Z","authorName":"Zpectrym","rating":5,"title":"Reliable","body":"Very useful and reliable in my experience. I haven’t used a key card ever. Please release an app for Apple Watch!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6726974752","version":"3.10.9","date":"2020-12-07T11:53:54.000Z","authorName":"Smaug's Wrath","rating":5,"title":"Hardware not included","body":"Apparently, you have to buy the car separately. Waste of time downloading this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6721353747","version":"3.10.9","date":"2020-12-05T20:36:56.000Z","authorName":"Telsa hater","rating":1,"title":"Don Niu","body":"A head light defect couldn’t be fixed after 2 mobile service. The service center appointment is  a month wait and can’t be rescheduled even the schedule doesn’t wort. Try to contact the service center many times, no body respond. I won’t buy another Tesla.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6721296640","version":"3.10.9","date":"2020-12-05T20:12:10.000Z","authorName":"spamusubi","rating":1,"title":"Photovoltaic (Home Solar)Tracking Feature is pure Garbage","body":"I would expect more from a leading company in the area of transportation, energy storage & solar power generation. App’s Photovoltaic System (Home Solar Power) tracking is very poorly designed and offers only the very minimal tracking capabilities, only showing system output in 15 minute increments and daily power production. \n\nHorrible/Ugly/Plain/Lackluster App Design: 2-tone color scheme (gold & black) that leave a whole lot to be desired. \n\nNo features to troubleshoot system issues or see instantaneous power production, does not give you an option to drill down to view individual panel output static’s (output per each individual panel).\n\nAbsolutely NO options for setting up automated alerts for system issues or panel malfunctions. \n\nWould be nice to be able to go to a specific date two or three years in the past rather then having to tap the app day by day, if you wanted to go to a single day 1-year in the past you would effectively have to tap the back button 365 times!?!\n\nDoes allow you to select specific days within a week to view daily output stats, you have to cumbersomely go back out to day selection and locate the day you want again scrolling back one day at a time.  \n\nDefinitely expected A WHOLE LOT more from an industry leader in energy & transportation. \n\n👎🏼Extremely Disappointing to Say the Least 👎🏼","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6720970628","version":"3.10.9","date":"2020-12-05T17:57:20.000Z","authorName":"JewpiterJones","rating":2,"title":"I expect more from the most valuable auto maker","body":"Slow and clunky app built with hybrid technology. Build native! You can afford it!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6713680571","version":"3.10.9","date":"2020-12-03T17:02:52.000Z","authorName":"mbmast","rating":1,"title":"Fails instantly on first use","body":"I follow Tesla’s advice and install their app before taking delivery of my Model Y.  When launched for the first time I sign in and the app displays:\n\n“Hi Michael. Welcome to the Tesla family.  Let’s get started with an overview of your Model Y features.”\n\nBelow that is a button to tap. The button says “Get Support.”  There is no “Ok” or “Show Me” or “Let’s go” button.  Only Get Support. So I tap that. That just opens a browser at Tesla.com leaving me staring at Tesla‘s home page.\n\nI contacted support and they tell me that until I take delivery (scheduled for tomorrow) that’s all the app is capable of doing. \n\nSo despite the fact that the app says “Let’s get started with an overview of your Model Y features” it is incapable of displaying an overview of anything.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6708362504","version":"3.10.9","date":"2020-12-02T05:02:31.000Z","authorName":"donotlikealltheseads","rating":1,"title":"Waking up","body":"App gets stuck at waking up stage. Frustrating!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6695805609","version":"3.10.9","date":"2020-11-28T15:51:15.000Z","authorName":"drrx10","rating":3,"title":"Good functionality app - could be better!","body":"What I’m using: iPhone 11 128 GB, red \nCar: Model Y; July 2020\nNetwork: T-Mobile + WiFi when available \nRegion: Northeast\n\n1. Agree with previous comments about making widget adapt to light vs. dark mode for iOS. Font stays black on Tesla Widget making it fairy unusable \n\n2. Would love ability to customize / toggle quick buttons that’s current set to climate/frunk/unlock\n\n3. Would love ability to toggle between ENERGY/ DISTANCE from app; right now needs to be switched in car\n\n4. Maybe too much to ask - but voice command capabilities? Would be great to open trunk without having to pull phone out + unlock phone + open Tesla app + find trunk after accessing Controls section","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6695769470","version":"3.10.9","date":"2020-11-28T15:38:47.000Z","authorName":"sedrakpc","rating":4,"title":"Siri Shortcuts and widget","body":"Application is OK, but we need more functionality! Like “Siri open car trunk/frunk.And same functionality from the widgets without redirecting to them to the main application. And car direction using google maps - no one uses Apple Maps)\nPlease!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6694912543","version":"3.10.9","date":"2020-11-28T10:59:58.000Z","authorName":"RsJohnson","rating":5,"title":"Works well!","body":"Works as it should","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6693073803","version":"3.10.9","date":"2020-11-27T22:36:38.000Z","authorName":"HodgesHodges84","rating":1,"title":"Garbage. Doesn't report solar data","body":"Lame app! Occasionally connects to my solar inverters to report data but not reliably or often. Don't see any of the cool charts and graphs displayed in the app store screen shots. Pretty disappointed in the Tesla experience overall.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6688844996","version":"3.10.9","date":"2020-11-26T18:55:35.000Z","authorName":"Cantuzzie","rating":5,"title":"AT&T issues","body":"Update on 11/26: no app update has been available but the issue appears to be resolved. I’m not sure if this is a temporary resolution and the problem will come back in the future.\n\nUpdate: app update available did not fix issue. When the issue is resolved I will update this review.\n\nSince moving to the iPhone 12, the app does not connect while on data. The only I can connect is over wifi. There’s no point to the app if it can’t work when I’m not on a wifi network. Please fix it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6685961892","version":"3.10.9","date":"2020-11-25T23:43:12.000Z","authorName":"Rebxl","rating":1,"title":"Summon no longer works","body":"I have the 12 pro max and now the summon feature doesn’t work. Bluetooth absolutely is unreliable. It will not stay connected. Hard resets of the phone and car yield no solution. \n\nI hope Tesla/Apple look into the Bluetooth issues. If the developer wants to help me troubleshoot, contact me.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6682958943","version":"3.10.9","date":"2020-11-25T03:48:27.000Z","authorName":"ikari2_2000","rating":1,"title":"Why the app doesn’t display +kWh value total from charging","body":"In the car, there’s 4 charging values displayed. The kw rate, the kw gained, the amperage, and volt. The app, charging section, is not on parity as it only displays kw rate, amperage, and volt. That kw gained total from charging is helpful in calculating cost.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6681548608","version":"3.10.9","date":"2020-11-24T17:45:08.000Z","authorName":"Marco461","rating":2,"title":"Lame app","body":"It would help a small degree if it connected with Apple Watch","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6679339756","version":"3.10.9","date":"2020-11-24T03:02:01.000Z","authorName":"Abelisgod","rating":4,"title":"Widget bug","body":"The widget is not legible when iphone is in dark mode. Please fix.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6676268660","version":"3.10.9","date":"2020-11-23T06:35:56.000Z","authorName":"StanSorensen","rating":1,"title":"Unhelpful app","body":"I went to log into my Solar City App, and it said it was no longer in use.  Yes,I have been out of state for a very long time.\n\nSo I went and located the new Tesla App and installed on my iPad.\nGot to redo my Tesla ID and led, twice, and this app only seems to want to collect data from me and nothing else.\n\nCan’t even locate a link on it that will show me what my solar panels are doing.  My panels are working OK, according to them, but the Tesla App seems to only be treating me as a potential customer.  \n\nAnd yes, I’ve entered my address and phone number, all to no avail.\n\nNow I seriously miss the old Solar City App.  It was logical enough, and at least it functioned.\n\nIf someone from Tesla actually reads this, consider this an official request to have someone from (and in) the United States contact me via phone or my personal email.\n\nUnhappily Yours…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6675708737","version":"3.10.9","date":"2020-11-23T02:10:58.000Z","authorName":"Ackle55069","rating":1,"title":"Embarrassment","body":"Compared to the Android version this app is an embarrassment.  Where is the current iOS widget with quick actions like opening trunk and frunk?  Does anyone at Tesla actually use this app and realize they need to update the widget?  And that the old-school widget they left in there doesn’t support dark mode either, so you can’t even read the text or icons?  Fix the basics people.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6674386756","version":"3.10.9","date":"2020-11-22T17:00:58.000Z","authorName":"i dnt have 1","rating":2,"title":"Service center","body":"Service center selection is not showing on app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6670736698","version":"3.10.9","date":"2020-11-21T17:09:56.000Z","authorName":"Charlotte QU","rating":3,"title":"Can’t connect to the car","body":"Since new update. My phone can’t connect with my car at all. Keep showing connecting. Recently I locked out my car without knowing this issue. I no longer can unlock my car with the app, so ended up spending $90 to unlock the car!!! Serious issues, please fix! I still give three stars because it’s a good app when IT WORKS (FYI, I’m using iPhone 12 pro max with verison)","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6668940429","version":"3.10.9","date":"2020-11-21T06:46:49.000Z","authorName":"themeparkdad","rating":2,"title":"Connectivity issues with AT&T cellular","body":"Recently experiencing vehicle connection errors when using app with AT&T cellular. Unknown if problem with app, cellular service or iOS version.  This means occasionally it won’t quickly connect to vehicle to unlock, set controls, or use summon functions.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6663485899","version":"3.10.9","date":"2020-11-19T17:29:19.000Z","authorName":"Tripos","rating":4,"title":"Great app to control the car but the solar component could use a few tweaks!","body":"I have use this app for over two years to control and monitor my car and it has been great. In the last few months I have put up a 15 kWh solar array as well as added 3 Tesla powerwalls. I find the solar monitoring function of the app to be quite good with the exception of only two requests. It would be nice if the daily graph could also have a graph for a battery discharge as well as battery charge. It would also be excellent if there could be a date range set for the graph instead of just day, week, month and year. This way you could have a series of graphs that would represent your billing cycle. This would be very convenient to monitor your electric companies charges and data.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6660571060","version":"3.10.9","date":"2020-11-18T21:42:56.000Z","authorName":"Brimon","rating":1,"title":"Bad connection","body":"Fails to connect with my car at least 50% of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6660289785","version":"3.10.9","date":"2020-11-18T19:43:23.000Z","authorName":"Ochoafelipe","rating":1,"title":"Not working on ATT data","body":"App does not work “network time out” error while using on ATT data. Only works over wifi need update fix ASAP!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6657337777","version":"3.10.9","date":"2020-11-18T00:32:06.000Z","authorName":"El mataran","rating":1,"title":"No working","body":"does not work with Att 5g and LTE network","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6656755831","version":"3.10.9","date":"2020-11-17T20:24:32.000Z","authorName":"Fuvb","rating":4,"title":"I love this app and my Tesla","body":"This app allows me to enjoy my Tesla even more, the ability to remotely check on my Tesla and communicate with it is unlike no other vehicle I have ever owned. For this reason I will never not own a Tesla! \n\nApp developers, of course there are always ways to improve this app but one request that I feel would be very easy to add but very useful would be the ability to see how much kWh that was added to your battery on the last charge like inside the vehicle. Even better would be a history of your previous battery charges and kWh amounts! \n\nYou all are truly bettering peoples lives and creating new happiness! Thank you all and Elon! : )","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6655936776","version":"3.10.9","date":"2020-11-17T15:16:19.000Z","authorName":"Xóchi","rating":2,"title":"no notification when in backup mode","body":"there is no option to be notified if the grid goes down and the house is running solely on the battery. it is great that there is no loss of power and there is no loss of power to indicate when the grid goes down. if the electric in my neighborhood goes out (which doesn’t need a storm to do), i would like to be able to know so i can shut down the non-essentials so the battery power will last longer. i don’t have enough time to dedicate 24 hours a day to watch this app to determine if the battery has gone into backup mode. add a notification when the battery is in backup mode. the app already registers when that happens - why not add a notification? also, what constitutes a storm? we had 50mph winds the other day and we didn’t get any notification from this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6654187537","version":"3.10.9","date":"2020-11-17T03:56:12.000Z","authorName":"jcdubya","rating":1,"title":"Current version does not work with iPhone 12 Pro AT&T","body":"This version of the app has a widespread issue of not working with AT&T 5G or 5Ge and iPhone 12 Pro. It will work over WiFi.  This is pretty crippling and we need a fix.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6652915672","version":"3.10.9","date":"2020-11-16T19:05:17.000Z","authorName":"fastman1982","rating":5,"title":"Model Y 🔥","body":"Please keep improving that app. Thanks","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6652698045","version":"3.10.9","date":"2020-11-16T17:40:27.000Z","authorName":"jaenlle01","rating":1,"title":"No connection through LTE","body":"App does not connect to the vehicle using LTE. This stopped working in the latest update. If the vehicle is on WIFI it connects fine to the app. Otherwise I don't have any connection to the model 3.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6649698277","version":"3.10.9","date":"2020-11-15T21:27:06.000Z","authorName":"tesla London","rating":2,"title":"Time based control needs fixing","body":"I have a tesla power wall at home which I use to provide electricity for the house during peak hours, and would like to charge it during off peak hours. Now the app allows you to set the peak and off-peak slots, but for some reason I cannot set peak hours end time to any later than 23:30. My electricity provider only starts providing off peak hours electricity rates after midnight, so for 30 minutes each night I have a power hungry battery taking 4.6 kW from the grid at the highest rate. Surely this can be easily amended by your Tech guys, Tesla ?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6645109349","version":"3.10.9","date":"2020-11-14T17:34:21.000Z","authorName":"@202","rating":2,"title":"Too slow","body":"The features of the app are great. However, every time I open the app, it can’t update to my current location, leaving most of the features inaccessible. So, great ideas, but I can’t use them for my Model X","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6641424733","version":"3.10.9","date":"2020-11-13T18:24:58.000Z","authorName":"jeme8341","rating":1,"title":"Does not work on AT&T 5G","body":"Really nice application but it does not connect to AT&T’s 5G network unfortunately. Love my Tesla but this app does not work.  There are may other applications that work fine with AT&T’s 5G.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6638328287","version":"3.10.9","date":"2020-11-12T21:50:37.000Z","authorName":"John Nort","rating":2,"title":"Doesnt work a lot","body":"Half the time when I’m trying to unlock my car or drive it remotely from my app it doesn’t load correctly and I have to delete the app and re-download it again and again. Very frustrating","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6631565966","version":"3.10.9","date":"2020-11-11T01:28:10.000Z","authorName":"DerwoodMD","rating":1,"title":"Doesn’t work at all","body":"The app doesn’t recognize my account. Doesn’t load my solar panels. Won’t accept my address - I’ve entered it 20 times and it just disappears - I’ve deleted 3 times and reloaded it and it still doesn’t work. \n\nJust doesn’t work at all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6627150026","version":"3.10.9","date":"2020-11-09T19:44:29.000Z","authorName":"Mike Weasner","rating":3,"title":"Love the Powerwall, the Tesla app not so much","body":"The app has almost all the features you might expect, but it has one very serious limitation. Backup History displays very little information.  It shows only Date and Duration of outages. It really needs to show the Time of each outage as well. It also needs to do time math correctly. I have one outage that shows 36 hours on one day (days are still 24 hours long) when in fact the outage was only a couple of hours.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6627096909","version":"3.10.9","date":"2020-11-09T19:22:28.000Z","authorName":"PsychDoctor56","rating":5,"title":"Works great","body":"Works great. Recently I had an issue with the app. Turned out it was because after upgrading to hardware ll  and hardware for full self driving there was some thing that needed to be reset at the service center preventing the app from working fully as it should. Now it was reset App works perfectly.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6626486544","version":"3.10.9","date":"2020-11-09T15:43:49.000Z","authorName":"saullyman","rating":1,"title":"On Demand Pricing.","body":"So I live in Arizona. Starting on November 1st through April, we have a split on Demand from 5:00 am-9:00am then again from 5:00pm-9:00 pm\n\nThe app doesn’t allow for that. You need to allow for all/multiple demand shaving capabilities or the powerwall 2 IMHO is useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6623239410","version":"3.10.9","date":"2020-11-08T17:13:38.000Z","authorName":"gotexaslonghorns","rating":1,"title":"Broken on iPhone 12 Pro and AT&T with or without 5G","body":"The Tesla App had been able to connect via cellular, but the recent update has made it finicky it. The Tesla App connects to the car and solar on WiFi, but keeps getting a network timeout on 5G or LTE (AT&T). Interestingly, uninstalling and reinstalling the app allows one to connect and sign in, but only once. After switching apps (without force closing) there are connection problems again.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6618083806","version":"3.10.9","date":"2020-11-07T08:40:12.000Z","authorName":"1ppp","rating":2,"title":"Latest car upgrade bad","body":"It slows down start up so bad. The control panel behind steering wheel is black for about 20 seconds. Not good not safe.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6615589387","version":"3.10.9","date":"2020-11-06T15:43:40.000Z","authorName":"RandomUserOfYourApp","rating":1,"title":"No performance wheels","body":"Someday the app will show red performance wheels on the car. Hopefully before we inhabit Mars. First planet problems.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6613334092","version":"3.10.9","date":"2020-11-06T00:41:32.000Z","authorName":"Review- Anonymus","rating":1,"title":"Model S","body":"Takes a while to connect. Failed to connect a lot of times . Not reliable.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6612680392","version":"3.10.9","date":"2020-11-05T19:52:18.000Z","authorName":"J@3Y","rating":3,"title":"App doesn’t Working in Iphone 12 5G","body":"I replace my phone and I can’t sea an update from de power wall if i use celular data. Only Work when is connected to a wifi network","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6608714583","version":"3.10.9","date":"2020-11-04T16:35:24.000Z","authorName":"Alextheoc","rating":3,"title":"iPhone 12 Connectivity Issues Via Cellular","body":"Overall great app and it worked well until I upgraded to the iPhone 12 Pro. It won’t connect to the car when phone is on cellular. It still works on WiFi. What happened? Carrier is AT&T","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6605928296","version":"3.10.9","date":"2020-11-03T20:49:55.000Z","authorName":"GG.boca","rating":1,"title":"Old & Stale...","body":"Shame on Tesla.  Total pile of crap here. Have to take my phone out of my pocket, wake it up and then open up App just to unlock my car...  2+ years to get this right.  #FAIL","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6604548603","version":"3.10.9","date":"2020-11-03T12:37:47.000Z","authorName":"Applepie444","rating":1,"title":"App isn’t loading","body":"App worked on my iPhone 11 Pro Max flawlessly. Upgraded to iPhone 12 and now the add never refreshes unlesss I reinstall the app. Tried logging out, force closing nothing works. After install works for a bit then doesnt","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6601987803","version":"3.10.9","date":"2020-11-02T18:14:26.000Z","authorName":"George Snelling","rating":1,"title":"Tesla doesn’t get privacy","body":"1) Everyone in the family with a linked phone can see the location of the car all the time. This needs an opt out: share location with A) primary phone B) all linked phones C) don’t share\n\n2) the app uses gps, rather than Bluetooth, to auto-lock the doors. In order for auto lock to work you have to give the app (and therefore Tesla) access to your location Always, not just when you are using your app. It should use Bluetooth signal, possibly in addition to gps so the privacy concerned out their could use the app without Elon Musk tracking our every movement whether we were driving one of his cars or not. \n\nSo I bought a key fob and disabled mobile access for the car. It is literally useless for me.","voteCount":2,"voteSum":2,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6599532906","version":"3.10.9","date":"2020-11-02T02:26:09.000Z","authorName":"rsiu7177","rating":4,"title":"Good but could be better","body":"This app mostly works well. However, sometimes it doesn’t sense my phone and I have take out my phone and open the app. \n\nAlso; when will we get a Apple Watch app version?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6598484005","version":"3.10.9","date":"2020-11-01T18:38:52.000Z","authorName":"Petegoatboy","rating":1,"title":"Absolutely pointless.","body":"This app is absolutely pointless. \nWe have Tesla solar panels, and we were told that we have to download the app to monitor and login to our account. \nYou can monitor very little regarding your system. You have no idea what amount of the power you are using or how much is being fed into the grid. \nYou can’t pay your bill or access any relevant details on your account. \nAlso,Tesla’s customer service is junk.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6595211138","version":"3.10.9","date":"2020-10-31T22:14:42.000Z","authorName":"Clyde_Rivers","rating":1,"title":"Stuck loading forever!","body":"Just says Connecting...","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6594538040","version":"3.10.9","date":"2020-10-31T17:42:02.000Z","authorName":"Budinski","rating":4,"title":"Share sheet gone?","body":"Is it just my phone or did the share sheet disappear in this latest version?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6589690726","version":"3.10.9","date":"2020-10-30T11:26:01.000Z","authorName":"Mckinley3","rating":1,"title":"Terrible app and very laggy Telsa doesn’t about the app","body":"Laggy and slow! Telsa doesn’t put time into the app all Telsa care about is money all that matters.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6588467553","version":"3.10.9","date":"2020-10-30T02:10:57.000Z","authorName":"Ro00100100100","rating":2,"title":"It never works","body":"It’s shameful that this application never works. A company like Tesla, which has done and accomplished so much in our modern times, now cannot fix the commuication issue that this application is having. Everytime I launch the application, it unsuccessfully tries to communicate with my 2018 until I get the void message “Network Time Out.” The application would only work when I launch it while on Wi-Fi. And on the other hand, a third party application, Tesla Stats, works fine and connects to the vehicle without a single glitch everytime, which leads me to believe that the issue lies in the Tesla apllication, not the AT&T service. And I’m not the only one with this problem. Multiple other Tesla owners are experiencing the same problem. One last thing: when I purchased my Model 3, the application worked perfect up until a recent application update made in the first half of 2020. What goods can you find in the convenient Summons feature, or the climate control, etc., if the application does not work? It is really about time for Tesla to solve this problem.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6588305112","version":"3.10.9","date":"2020-10-30T01:00:16.000Z","authorName":"EdSk111","rating":1,"title":"Connection to the car","body":"I have FirstNet network( on iPhone (AT and T for first responders). The app does not connect to car on LTE network. It only connects to the car when my phone is on Wi-Fi. Called Tesla support many times. Took my car to service. They have no solution. This issues being reported on many websites. Today Tesla updated their app- still did not resolve the issue. Poor software support. Seems that they are ignoring the problem! Hope Tesla reps monitoring reviews and will escalate this issue.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6588199643","version":"3.10.9","date":"2020-10-30T00:13:16.000Z","authorName":"Mujzero","rating":3,"title":"Fails to Report Outages","body":"I’m using the app as support for our solar system Powerwall.  When we experience a power outage, the switch to the Powerwall is instantaneous. Kudos to Tesla for the seamless transitions.  However this creates an issue since I most often do not notice the grid is down.  I own an iPhone X and keep it and the Tesla app updated, but the notifications have never worked.  I would shift into conservation mode when the grid is down if the system would tell me.  I’ve even considered rigging an audible alarm on one of the outlets not tied to the Powerwall backup so that I’ll know the instant I’m off grid.\n\nThe data reported is enough to see your daily solar collection, Powerwall use, and grid use.  I’ve found it particularly useful for making consumption adjustments/changes and witnessing the impact.","voteCount":2,"voteSum":2,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6588042414","version":"3.10.9","date":"2020-10-29T23:04:41.000Z","authorName":"Bee-Ten","rating":3,"title":"For Tesla Auto, why no navigation???","body":"For Tesla Auto, why no navigation??","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6586583351","version":"3.10.8","date":"2020-10-29T13:59:02.000Z","authorName":"Jenova 7","rating":4,"title":"Good, but needs more features","body":"First off, overall impression of the app is it’s good and definitely the best car app I’ve ever used. I love my Tesla and believe in the company. However, the app needs some work. I’m not sure about the interface. It simultaneously looks good and yet also outdated from a UI/UX perspective. But, most importantly, it lacks features. I want to be able to schedule charging remotely, turn on dog mode remotely, maybe even open the doors remotely. I would love to be able to remotely view camera or sentry mode recordings. Also, other apps have Siri integration. Why doesn’t this app have it built in? Tesla, we love you, but please revamp the app!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6582348162","version":"3.10.8","date":"2020-10-28T09:47:16.000Z","authorName":"AmKir","rating":1,"title":"Keeps logging out","body":"The app keeps logging out. It's a pain to not be able to drive unless you first login to your app.\n\nWhen it logs you out, it forgets the finger ID setting and you have to login a second time to set that up all over again","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6581215544","version":"3.10.8","date":"2020-10-28T01:00:37.000Z","authorName":"summernightdrive","rating":1,"title":"Does not work with AT&T 5g plans!","body":"The app will not connect to the car. This is an issue that is becoming widely known with the iPhone 12 shipping last week. The app shows a \"network timeout\" and the only way to temporarily regain connection (albeit for only a few seconds) is to toggle airplane mode after opening the app (this clears network cache).","voteCount":2,"voteSum":2,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6579658840","version":"3.10.8","date":"2020-10-27T14:50:30.000Z","authorName":"Adj22","rating":2,"title":"iPhone 12 ATT Connectivity Problem","body":"Please address the problem that iPhone 12 (5G) will not connect to car/connection times out!\n\nOnly occurs on the ATT network and not on WiFi. Really really annoying. Only way to make it connect is to force the phone into airplane mode and then try reconnecting to network.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6576959920","version":"3.10.8","date":"2020-10-26T19:27:18.000Z","authorName":"4=mato=","rating":1,"title":"Not functional and no support","body":"It worked alright before the latest update and now it won’t communicate with my equipment. I wrote an email to support and have not received a reply in 2 weeks.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6576615121","version":"3.10.8","date":"2020-10-26T17:21:31.000Z","authorName":"Spawnson","rating":1,"title":"iPhone 12 Pro 5G Issues","body":"App has serious issues connecting to car via cellular data (AT&T). It’s really hot or miss. I thought it was the whole phone at first but other apps and processes work fine which leads to the Tesla App itself. Really inconvenient bug that needs to be fixed ASAP. Be sure to carry your key card because the app as it stands right now is very unreliable and Tesla App support is non-existent.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6576543774","version":"3.10.8","date":"2020-10-26T16:55:04.000Z","authorName":"Jack2.2","rating":1,"title":"Tesla owner","body":"Please correct the issue with the app not able to connect to my vehicle. Very useless when the app does not connect. Too often.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6573705639","version":"3.10.8","date":"2020-10-25T20:15:49.000Z","authorName":"Thatguy38","rating":4,"title":"Good minor improvements needed to make it great","body":"Overall good app. A few requests though,\n\nShow powerwall charge percentage on the power flow screen like on Android. \n\nHave an input to select date/week/time frame when looking backwards (so to see a day’s data I don’t have to click it 200 times). \n\nSupport multiple peak and off peak time periods for ToU users.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6570019629","version":"3.10.8","date":"2020-10-24T19:17:23.000Z","authorName":"Shane-C","rating":1,"title":"Unable to wake car on iPhone 12","body":"When using iPhone 12 Pro on cellular 5G the car will not wake from sleep. If the car is already awake it connects fine. If the car is asleep it results in a network timeout. On WiFi it works perfectly. I have confirmed the cellular data setting is on for the Tesla app. There is no Tesla app support available it seems to report this.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6569302882","version":"3.10.8","date":"2020-10-24T15:18:37.000Z","authorName":"Nukef16","rating":3,"title":"Expected more","body":"I really expected this app to have more functionality and to offer more options for customization.  Also... Nothing for the Apple Watch???  Lastly, they need to make it work with Siri.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6566430022","version":"3.10.8","date":"2020-10-23T19:08:58.000Z","authorName":"Mermaidenme","rating":1,"title":"Terrible communication! I wouldn’t give this company any stars.","body":"This is the worst solar company I know. They’re terrible at communicating in a proper time fashion.  They know when you’re system doesn’t work, may or may not let the client know. I’m waiting for a technician to call me or come over. If you’re town has a power out your system could shut down. It’s suppose to automatically go back on, but Tesla’s system is malfunctions, and they don’t respond until you’ve paid high electric bills to Eversource. Solar City was great until Tesla took over their company. If I had known this would happen I’d never have gotten solar panels. I feel like love been made a fool of.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6550162018","version":"3.10.8","date":"2020-10-19T03:13:57.000Z","authorName":"POLARISpro489","rating":1,"title":"Homelink stinks??","body":"This is stupid. Who invented this \n\nSometimes i need to close my garage from afar. Why would you say “move closer to your vehicle”? What’s the purpose of the feature then?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6548521352","version":"3.10.8","date":"2020-10-18T15:29:34.000Z","authorName":"MG Bach","rating":1,"title":"Not connecting when you needed","body":"Traveling using supercharger the app should connect so you receive notifications even in the city here in Anahaim no connection.\nMy phone connected the car connected but poor App not connecting to the car.\nNot reliable when you needed the most.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6546863407","version":"3.10.8","date":"2020-10-18T04:14:36.000Z","authorName":"NewFanBack","rating":1,"title":"Buggy app, same as the car!","body":"I had so much problem with the Model X during 3 years. Doors don’t open for month. Windows don’t close. Key not detected.\n\nTesla has the worst customer service ever. Now, you can’t even call them!\n\nThey don’t deserve where they are. Maybe it was nice at the beginning, but they now took us for fools.\n\nYou have a lot to do Elon before going to Mars!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6537597037","version":"3.10.8","date":"2020-10-15T12:57:04.000Z","authorName":"Tombearfan","rating":1,"title":"Can’t connect","body":"Ever since the last software update to my Model Y I can’t connect to the car through the app. I even tried uninstalling and reinstalling the app but nothing has worked.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6530552343","version":"3.10.8","date":"2020-10-13T12:09:11.000Z","authorName":"da bum","rating":4,"title":"Won’t connect when VPN is on","body":"In this day and age of data breeches, there should be no reason that end users like us, paying for an expensive product, should be blocked if we choose to use a VPN.\n\n10/2020 update. App now connects with VPN. Decent features when it comes to solar monitoring. Would like some more controls for power consumption but this is a minor issue.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6527616257","version":"3.10.8","date":"2020-10-12T14:53:49.000Z","authorName":"danlemire","rating":4,"title":"Solar Time of Use Schedule Still not good enough","body":"I use the Tesla App to control my solar and powerwalls. I’m quite happy with the app except for two things: 1) storm watch doesn’t seem to work and 2) time of use price schedule adjust. \n\nStorm watch doesn’t seem to trigger when in a sever storm watch anymore. This wasn’t a problem until recently. \n\nMy electric provider has a setup that is not accommodated by the existing price schedule when using time based control. We’re in the fall billing schedule and that means that prices are high from 6-8am and then are lower until 3pm to 8pm. The price schedule doesn’t currently support separated windows and I can only represent this higher price schedule in the morning by using a price shoulder (which is not accurate and leads to unnecessary battery use on during the day on rainy days. I would like to ask for a more flexible price schedule ability so that I can properly inform the equipment on best times based on price. We only have two priced to accommodate; peak and off-peak. It’s only the time setup that I would need changed.","voteCount":9,"voteSum":7,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6524204282","version":"3.10.8","date":"2020-10-11T14:30:43.000Z","authorName":"jaanhenna","rating":1,"title":"Software update","body":"My car is completely locked after software update...I mean never heard and expect this from tesla. Can’t do anything called them they don’t have even substitute car loner I mean. I have to be work on time I had urgent meeting. Such a bad day for me thanx to tesla","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6516877827","version":"3.10.8","date":"2020-10-09T13:10:38.000Z","authorName":"GemGW","rating":5,"title":"Where did Homelink button go?","body":"Update:\n\nIt’s back, great app, great car and service.\n\n5 star will be back when someone explain to me what happened to my homlink button in the app.\n\nThank you.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6514229608","version":"3.10.8","date":"2020-10-08T17:30:34.000Z","authorName":"Second Rate Citizen","rating":1,"title":"Home Solar production","body":"Unable to review using title of UNHAPPY, VERY UNHAPPY, ANNOYED, DISPLEASED, or anything remotely similar. It’s a shame that Tesla bought up solar companies and customers can no longer monitor their systems via laptop, desktop or pad. The ONLY way to monitor your system is to use this phone app.\nThe app and their website are geared to operating Tesla vehicles and home solar is obviously an annoying afterthought.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6505360851","version":"3.10.8","date":"2020-10-06T04:29:28.000Z","authorName":"Onomang","rating":1,"title":"SolarCity app wasn’t exactly great","body":"But it was a hell of a lot better than this garbage. After retiring the old SolarCity app this app still lacks tons of its features. I don’t own a Tesla car and if this app indicates Tesla’s attitudes towards fulfilling customer needs I will never own nor want one.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6500636076","version":"3.10.8","date":"2020-10-04T19:09:48.000Z","authorName":"mattgladys09","rating":3,"title":"App needs an update ASAP","body":"Great app - However I’ve been having login errors for 2 weeks now","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6495528017","version":"3.10.8","date":"2020-10-03T11:27:50.000Z","authorName":"Jamie_f_s","rating":1,"title":"Useless","body":"Will not log in","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6490485771","version":"3.10.8","date":"2020-10-02T02:06:15.000Z","authorName":"L. Brown IV","rating":5,"title":"iOS14 Widget Support?","body":"Hey Tesla... widget support for iOS14 coming anytime soon?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6486443414","version":"3.10.8","date":"2020-09-30T23:55:37.000Z","authorName":"tomcrown","rating":1,"title":"Tesla can’t do Apps so what make Tesla think it can do self driving,","body":"Ever since the update the Tesla App crashes!!  If their App crashes can you trust Tesla self driving won’t crash also. It’s a bad Tesla","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6479019207","version":"3.10.8","date":"2020-09-28T22:45:00.000Z","authorName":"dniq","rating":2,"title":"Doesn't work correctly with Powerwall","body":"The app has an \"Advanced\" mode for solar and Powerwall, where you can specify peak vs. off-peak hours, so that you can use Powerwall power during peak hours and charge it during off-peak hours.\n\nThis functionality DOES NOT WORK. It still charges and discharges Powerwall at pretty much unpredictable times, and uses grid power during peak hours, when the battery is fully charged and solar does NOT produce sufficient power to meet the demand.\n\nIn other words, you have no control over when to use Powerwall power and when to use grid power, and when not to, pretty much nullifying all possible benefits you may have hoped to gain by getting Powerwalls installed.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6478655146","version":"3.10.8","date":"2020-09-28T20:06:06.000Z","authorName":"Miccilito","rating":4,"title":"A/c and Suspension in app","body":"I love the app, but please let the suspension be controlled in the app, and atleast MAKE ANOTHER SELECTION ON THE SUSPENSION  THAT CAN BE LOWERED MORE BUT ONLY ON PARKING! Like after VERY LOW, theres going to be EXTREME LOW, but for parking only just for show and cannot be used for driving, that would be a game changer.\nNow on the a/c in the app, can the developer atleast INCLUDE THE FAN CONTROL SO ITS NOT FULL BLAST EVERYTIME I TURN ON CLIMATE, just like the climate screen in the car itself! Thank you in advance","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6472977594","version":"3.10.8","date":"2020-09-27T05:24:57.000Z","authorName":"scrz","rating":1,"title":"Tesla falling apart after a month!","body":"The app worked for a month then all i get is loading loading loading !","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6471417949","version":"3.10.8","date":"2020-09-26T17:49:20.000Z","authorName":"Valardin","rating":2,"title":"Good app, but desperately needs watch app","body":"Like the app.  Good functionality.  But utterly missing an Apple watch app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6471163262","version":"3.10.8","date":"2020-09-26T16:24:54.000Z","authorName":"dhelmy","rating":2,"title":"No support for Apple Watch","body":"Tesla users with Apple Watch should be able to drive the car without iPhone!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6469375550","version":"3.10.8","date":"2020-09-26T04:54:30.000Z","authorName":"SandWalker76","rating":1,"title":"Brick","body":"New iPhone 11 Pro Max. New carrier (T-Mobile). \n\nTesla App: ability to setup phone as key — disabled. Read many forum posts on teslamotorsclub, no simple fix. \n\n(Note: a bunch of folks there think AT&T is the problem. But most of them seem to have this phone or other newer phones.)\n\nCompletely unable to use phone as a key. \n\nContrast with old phone: Galaxy S7, & old carrier: VZW. Never had a problem. Not once. \n\nConclusion: Tesla needs to test this and other phones in the forum and fix their software bugs. \n\nUntil then this app is a brick — useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6467065342","version":"3.10.8","date":"2020-09-25T13:53:05.000Z","authorName":"dbgegdyxs","rating":4,"title":"Feels good","body":"I bought it even though I’m eleven and I wanted to feel like i owned one","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6467014263","version":"3.10.8","date":"2020-09-25T13:36:56.000Z","authorName":"AlexTheDukie","rating":1,"title":"Terrible app with security bugs","body":"Just purchased model x one month ago and since then I’ve had several major issues with the vehicle and app including sentry mode issue when car was being broken into abd the window was shown to be open when not.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6460658383","version":"3.10.8","date":"2020-09-23T17:36:11.000Z","authorName":"mwisbxgegrbdbehsbbdhdje","rating":1,"title":"doesn’t unlock car","body":"doesn’t unlock my car when i walk up to it with phone in my pocket","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6460245077","version":"3.10.8","date":"2020-09-23T15:21:28.000Z","authorName":"BonitaMena","rating":1,"title":"Always updating","body":"Tesla app is always updating therefore unable to use","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6457096279","version":"3.10.8","date":"2020-09-22T18:08:53.000Z","authorName":"Lil’ vegan","rating":3,"title":"Download pictures for service call","body":"Need to bring in my Model 3 for service and need to add photos. I am able to pick the photos but they are not downloading to the app. The circle just keeps spinning. I deleted the app and downloaded it again but still not working. Also very sad that no way to actually speak to someone at my local dealership, even with a pandemic going on it would be nice to have sone decent customer service.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6454080578","version":"3.10.8","date":"2020-09-21T21:42:09.000Z","authorName":"Tttteerrrrraaaabbbllluyyy","rating":3,"title":"Summon hit and miss","body":"Obviously feature is fantastic but the come to me mode rarely pops up, but even when manually use summon, the map freezes and the back button or “tap to summon” completely don’t work at all, force close app a few times you can eventually get it to work, \nAlso it can’t tell if it’s been pulled in forward or backwards so you really have to watch it because it will lunged the wrong way if you don’t watch.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6448053185","version":"3.10.8","date":"2020-09-20T06:17:14.000Z","authorName":"ItsBluebird","rating":1,"title":"Clipboard","body":"Stop putting Powerwall serial number on clip-board. Tesla app when launched is putting Serial number on clipboard for other apps to see(paste).\nSeen on iOS 14:\nThis is a security concern, please address this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6446196544","version":"3.10.8","date":"2020-09-19T17:32:23.000Z","authorName":"TT-97","rating":2,"title":"Disappointing","body":"It’s a shame after all this time there are so many functions missing from the app that Tesla could easily include.  First and foremost would be Apple Watch companion and ability to use the watch without needing to have your phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6443665504","version":"3.10.8","date":"2020-09-19T01:20:35.000Z","authorName":"Sikboy303","rating":1,"title":"Awful... so man bugs...","body":"I hope my car does not have as many bugs as this garbage can of an app does.... Elon this is almost a bigger joke than you being a good person...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6441425602","version":"3.10.8","date":"2020-09-18T11:32:18.000Z","authorName":"r3v13w5","rating":1,"title":"Developers too lazy?!","body":"This app is so behind in features for a car so futuristic. No shortcuts, no widgets, all car functions not supported.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6435997975","version":"3.10.8","date":"2020-09-16T19:37:13.000Z","authorName":"lovesophie888","rating":2,"title":"Keeps losing the key","body":"Once in a while(once in a month at least), I have to setup my key again. Please fix it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6435969036","version":"3.10.8","date":"2020-09-16T19:25:08.000Z","authorName":"sillyfiremans","rating":1,"title":"Horrible connectivity","body":"Will only connect when the phone is connected to WiFi. On cellular it will time out every time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6435894651","version":"3.10.8","date":"2020-09-16T18:56:22.000Z","authorName":"Aeroblaster3","rating":5,"title":"Best car company ever","body":"I’m going to buy another 10 Tesla’s!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6435419457","version":"3.10.8","date":"2020-09-16T16:10:27.000Z","authorName":"FlyingEar","rating":4,"title":"Mostly works","body":"As a key and an interface with the car, this is a very good app. Occasionally, it logs out without warning which, from the standpoint of a key, makes things awkward since it adds steps before opening the car.\n\nThe ability to make and manage service appointments from the app is great but, unfortunately, it’s not possible to provide basic feedback about the car or the app. Sometimes, the issue is not worthy of a service appointment but Tesla doesn’t give owners a simple way of communicating feedback such as:\n\nApp issues random notifications about key function being unavailable whenever Bluetooth is left turned off. (update) This has become increasingly annoying which is the primary reason I’m writing and checking on the status of this review. Sure wish I could tell Tesla about this directly.\n\n(Why is Apple not accepting this review?)","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6433829440","version":"3.10.8","date":"2020-09-16T05:02:19.000Z","authorName":"Paulie509","rating":5,"title":"5 Stars All the Way!","body":"I don’t own a Tesla yet, but it is that car that I will own sometime this decade. I’m just giving it 5 stars in advance because I know the model X will exceed my expectations when I am finally able to afford one!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6433485101","version":"3.10.8","date":"2020-09-16T02:18:33.000Z","authorName":"Nickelandime","rating":5,"title":"I downloaded the app the guys. Autist wsb.","body":"STONK","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6433379381","version":"3.10.8","date":"2020-09-16T01:31:22.000Z","authorName":"Hair boys","rating":5,"title":"Tesla 420","body":"9/18","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6432259211","version":"3.10.8","date":"2020-09-15T17:18:29.000Z","authorName":"Shallenberg","rating":2,"title":"Cannot connect","body":"Had a Tesla for 4 years. First time the app won’t connect. Deleted and reinstalled it. No change","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6432048268","version":"3.10.8","date":"2020-09-15T16:07:02.000Z","authorName":"UserVito","rating":5,"title":"The future of driving","body":"It’s an amazing app, and it gets better over time. I’ve been using it since 2014 and now use it with two Tesla vehicles. No other automaker has anything close. From controlling vehicle functions remotely to vehicle entry and starting to monitoring charging status, this app does it all well. I show it to friends to encourage them to buy a Tesla.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6431963360","version":"3.10.8","date":"2020-09-15T15:37:48.000Z","authorName":"Locombia94","rating":5,"title":"Tesla is the future","body":"This app is innovative, Very sleek nice user interface tells me everything I need to know and understand about my car, Thank you Elongated Muskrat","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6431459786","version":"3.10.8","date":"2020-09-15T12:52:27.000Z","authorName":"neo2093","rating":1,"title":"App is too buggy and keep disconnecting","body":"Wonky app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6429656080","version":"3.10.8","date":"2020-09-14T22:47:41.000Z","authorName":"Tobu5cu5","rating":3,"title":"Can you find info about the latest software version update in the app?","body":"Can’t find the software update info for each latest software update is this visible anywhere on the app?  Looked under settings, controls, upgrades, service, don’t see it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6428424345","version":"3.10.8","date":"2020-09-14T14:26:04.000Z","authorName":"FWB Bob","rating":1,"title":"Can not see the app screen","body":"Downloaded the app and only get support screen. I hope to pickup my car in a few weeks.  Do I have to see the car first?  No intuitive way to solve.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6421727137","version":"3.10.8","date":"2020-09-12T14:42:59.000Z","authorName":"Holmanja","rating":4,"title":"Functional","body":"I really like the app. Use it all the time. I like the summon and lock/unlock features. I think the charging recommendations need better location services. Usually closer superchargers aren’t listed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6420546921","version":"3.10.8","date":"2020-09-12T07:11:45.000Z","authorName":"TravisMcGee","rating":4,"title":"Timing out.....AT&T","body":"Update II:\nApp is now responsive when on cellular data. Thank you for fixing. My only gripe is that app has to be open to Unlock car sometimes with the phone. Which is annoying when my hands are full. \n\nUpdate:I\n😐I now understand it’s bc of AT&T. And it’s a known issue!!! \nI have not been able to get into my tesla app for over a week. First it said that I had the wrong password (that was incorrect). I finally deleted the app and reloaded it and magically my password was correct. \nWhen I try to turn on the climate or summon the car, I get the loading symbol and then it just times out. Sometimes the message on the bottom says “updated yesterday”.  \nAnd the charging information and mileage information","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6420259714","version":"3.10.8","date":"2020-09-12T04:54:40.000Z","authorName":"808avenger","rating":4,"title":"Good app but could be better","body":"Hopefully Tesla will look at this.  I have a model 3.  There should be better options to control your car with the app.  Maybe make settings to have your car adjust internal temperature at certain times or have it learn your schedule and adjust.  Integration with Alexa and Google and/or smart home devices.  Independent control of windows like they have independent control of seats would be nice but that’s more of a luxury thing than anything. Also, maybe settings to change from AWD to just RWD but then again I’m not sure how it be beneficial but it gives options to the owner. A little more control of the vehicle would be ideal.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6416080012","version":"3.10.8","date":"2020-09-10T22:48:21.000Z","authorName":"Goaskalice5467","rating":1,"title":"Terrible for solar generation tracking.","body":"Apparently I haven’t generated any solar power for years yet am continued to be billed for energy generation. Ever since they took over the app I can’t see my energy generation. It’s a garbage app and the website is worse. Seriously thinking of changing my solar company. This is just garbage and very poorly thought out.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6405497999","version":"3.10.8","date":"2020-09-07T19:21:42.000Z","authorName":"talking dog vids","rating":5,"title":"Keeps my car warm and cold thanks tesla","body":"Model 4","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6395921167","version":"3.10.8","date":"2020-09-05T00:19:06.000Z","authorName":"Gm5280","rating":1,"title":"Blank White Screen","body":"App gives me a blank white screen.  Reinstalled, rebooted, still the same problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6395684184","version":"3.10.8","date":"2020-09-04T22:30:24.000Z","authorName":"unhappywithyourgreedyass","rating":1,"title":"White screen","body":"All I get is a white screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6395492818","version":"3.10.8","date":"2020-09-04T21:03:16.000Z","authorName":"HeidiSW","rating":1,"title":"Batteries Great, App Stinks!","body":"We downloaded this app two weeks ago when our powerwall was installed. Today is the second time the app has stopped working. This is it just on my phone but my husband’s too. I am logged in. A small segment is actually giving data, just not the main part. And try getting customer service for help. 50-minute wait! I wish there was another monitoring system available. So frustrating.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6381254911","version":"3.10.8","date":"2020-08-31T17:00:52.000Z","authorName":"micky97","rating":5,"title":"I love it","body":"I live it and i love it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6370141045","version":"3.10.8","date":"2020-08-28T12:51:32.000Z","authorName":"NJmomie","rating":1,"title":"Why is this not connecting???","body":"Been using for the past 5 years and all of a sudden app no longer connects!  I have deleted and reinstalled. What’s up Tesla?  Please correct issue ASAP.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6367666345","version":"3.10.8","date":"2020-08-27T19:40:53.000Z","authorName":"JWBinHJ","rating":4,"title":"App works great but","body":"App works great but...\n- Often I have to wake up the running app to automatically unlock doors.\n- when iPhone is in dark mode, the Tesla widget (left margin on iPadOS or swipe right on iPhone) shows up with black characters on very dark grey background (nearly unreadable)\n- if app is running or wakes while in my pocket, it sometimes wakes on update screen or asking for payment mode (I never asked for (very expensive) car upgrades, which I’ve heard are not cancellable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6367238922","version":"3.10.8","date":"2020-08-27T16:51:16.000Z","authorName":"Kasbar9","rating":3,"title":"Mapping and Widget Dark Mode Support Needed","body":"The Tesla widget needs to be updated to support dark mode. It’s currently very hard to see with black text on a dark background. All other widgets that have been updated to support dark mode use white text. The Tesla widget is the only one of all my widgets that has not yet been updated with dark mode support. Also, the Tesla app needs mapping capabilities. The ability to use an in-app map to find superchargers, destination chargers, search trip routes, etc.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6357958300","version":"3.10.8","date":"2020-08-25T04:28:12.000Z","authorName":"Dad to J&K","rating":1,"title":"Service is HORRIBLE!","body":"Tesla service is absolutely horrible.  The App us a joke - all it does is let them hide behind technology - they just don’t care about their customers at all - all they want is to sell the car and then ignore you.   \n\nWhat a joke!","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6357880477","version":"3.10.8","date":"2020-08-25T03:54:44.000Z","authorName":"olha.kh","rating":2,"title":"No connection","body":"For most of the time I have no connection with app. So I can’t change climate remotely. Please,  fix it!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6356619256","version":"3.10.8","date":"2020-08-24T18:50:37.000Z","authorName":"WatchVersionSucks","rating":1,"title":"New version does not connect","body":"Bump. One more user who can’t connect. Fix this please!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6352994152","version":"3.10.8","date":"2020-08-23T18:08:45.000Z","authorName":"Mars Musks","rating":5,"title":"Tesla app","body":"I love this app. So much nicer than holding around a key. I always lose my keys. Haha","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6352961088","version":"3.10.8","date":"2020-08-23T17:56:02.000Z","authorName":"ha Sneer","rating":1,"title":"Horrible connectivity issues","body":"The car failed to connect 40% of attempts , the worst part is that the app is actually connected , it’s able to open a window or unlock but other features is not. That means it’s a Connectivity issue. I tried both WiFi and 4g. No big difference.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6349244861","version":"3.10.8","date":"2020-08-22T16:37:54.000Z","authorName":"davberk","rating":5,"title":"Great car app","body":"Updating after 5 months: I would give this app 6 stars if I could. It’s so rock solid reliable! One thing I didn’t realize at first is that I can send addresses to the car from Google Maps, Apple Maps, Yelp etc. It works every time, and when I get in the car it’s already navigating me.\n\nComing from BMW I was used to a slow, badly implemented, constantly unreliable app that really only carried out a few simple functions. Reviews of MBz Toyota apps etc looked the same. I’ve had my car a week and am blown away by the difference here. Super reliable, quick, well designed and thought out. \n\nI really enjoy controlling and checking on my car with this app! I can tell that they have a great team of iOS developers who take real pride in making this app nice.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6349224141","version":"3.10.8","date":"2020-08-22T16:30:29.000Z","authorName":"loganwatson","rating":3,"title":"Can’t connect","body":"The app use to be great. Now it won’t connect over cellular. Works fine over WiFi. Also works after switching phone in airplane mode then back off because it seems to kinda reset the app. Otherwise it’ll eventually display a network time out error. Tesla service looked at car and determined nothing was wrong and claimed it’s an app issue. Well that’s a major portion of this car so it needs to be fixed. Seems to affect AT&T users primarily from the people I’ve asked. Other carriers don’t seem to present the issue (the ones I’ve asked). Please fix ASAP.\n\nUpdated: App on AT&T seems to be fixed. Though the customer support was terrible and blamed me and/or the car for all the issues.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6347140732","version":"3.10.8","date":"2020-08-22T03:22:53.000Z","authorName":"pat yourself on your back","rating":5,"title":"You have got to drive a Tesla!","body":"Just go online and book some time to drive the Tesla.\n\nYou will never feel safer or as good a fit in any car.\n\nTry it you might like taking a step to heal this Planet 🌎","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6345633305","version":"3.10.7","date":"2020-08-21T16:52:20.000Z","authorName":"peterp416","rating":1,"title":"Transfer dash cam footage via app; Release notes in app","body":"App is good but I’ve got two suggestions:\n\n1) I appreciate the effort you guys have put into the car-based Dashcam feature. Unfortunately it’s quite cumbersome to transfer footage from the car. It would be very helpful if you could somehow transfer it to the app then be able to share it. An additional solution option would be to have Dropbox or Google Drive connectivity which would have a synchronization take place when the car is connected to Wi-Fi. \n\n2) Please add the ability to read the release notes for the car software updates in the app. Why would I want to read these when I’m getting ready to go somewhere? Especially given the great, yet often quite involved, updates that I will want to Google to read more about.\n\nThanks!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6325021280","version":"3.10.7","date":"2020-08-16T06:49:16.000Z","authorName":"KY260","rating":5,"title":"Super dependable","body":"I have been using it for 2 years now and the app does not crash in general. Love over the air updates, ability to summon the car and pre-heat. The best part is to drive with the app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6320226722","version":"3.10.7","date":"2020-08-15T00:05:05.000Z","authorName":"chase175832","rating":1,"title":"Connection","body":"Can’t even connect! You guys need to fix this!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6319752676","version":"3.10.7","date":"2020-08-14T20:47:30.000Z","authorName":"Andy1234@","rating":1,"title":"No connection with car unless on WiFi","body":"Starting with one of the recent 3.10 versions of the app it no longer connects to the car unless my phone is on WiFi (as many previous reviews mention). With full cellular reception I can be standing 5 feet from the car and the app would take more than 20 minutes to connect, however if phone is on WiFi connection is almost instant. Please update the app ASAP or fix the glitch with Tesla server connection - all basic features of the app are currently totally unusable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6316188869","version":"3.10.7","date":"2020-08-13T23:14:02.000Z","authorName":"Grifter001","rating":2,"title":"App Layout for iPad","body":"I suggest that for the iPad you should have it in Landscape mode and not portrait mode.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6314184787","version":"3.10.7","date":"2020-08-13T12:16:21.000Z","authorName":"futbol558201","rating":1,"title":"Disappointing!","body":"The app does not connect to my car most of the time.  It spins and spins and says it’s updating.. I am unable to change the temperature of my car at all when I am away from it.  Completely defeats the purpose if I can’t cool the car down ahead of time.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6311010277","version":"3.10.7","date":"2020-08-12T15:55:24.000Z","authorName":"2coronado","rating":1,"title":"Cannot reach Tesla for service.","body":"I left several messages and they do not return calls..  no help to try and make appointment online.  Cannot reach any live person to talk to.","voteCount":2,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6309571667","version":"3.10.7","date":"2020-08-12T08:38:23.000Z","authorName":"anexponent","rating":5,"title":"Best car in the world?","body":"Tesla’s feel like the best in metrics of safety, efficiency, performance (especially 202X Roadster) and of course their amazing Autopilot.\n\nAfter 50k miles with FSD Autopilot, I continuously think about how crazy it actually is that 99% of cars are *human*-driven...yikes (approx 30-40 thousand deaths in US/year, 2 million worldwide).\n\nThe app is cool. Smart summon is unreal. They’re constantly adding features and one I’d like is an alert if any windows were left down in the car...🤞🏼","voteCount":1,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6308892422","version":"3.10.7","date":"2020-08-12T03:57:12.000Z","authorName":"Mikey 7mc","rating":2,"title":"Doesn’t Connect with Vehicle over LTE","body":"I don’t know if it is an AT&T thing or Tesla app thing, but I cannot connect with my vehicle unless I am on WiFi.  Preset pointless if I am home and can connect to the car when it is in my driveway.  What is going on? This is a recent problem and like all things with Tesla, very difficult to talk to someone live to get anything fixed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6308170781","version":"3.10.7","date":"2020-08-11T23:22:28.000Z","authorName":"Bardet Biedl","rating":1,"title":"App almost cost me $5000","body":"I contacted my bank today about another issue and saw a $5000 charge (plus tax), from Tesla. I looked on the app and the web site and saw that at 8:30 AM, I purchased the full self-driving option for that amount. I did not want to purchase that. At 8:30 AM. I locked my car with the app. The only explanation was that I accidentally selected the purchase at that time.  Any app that allows someone to make a very expensive purchase should require confirmation before completion. I never saw a confirmation request. Tesla agreed to refund the charge, but their policy states refunds for upgrades are not issued after 2 days. I hope Tesla sees this and corrects this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6304513202","version":"3.10.7","date":"2020-08-11T02:20:36.000Z","authorName":"ShorthillsArp","rating":1,"title":"Horrible first impression.","body":"The opening screen says, “Welcome to the Tesla family. Let’s get started with an overview of your vehicle’s features.” And then nothing. A non-click to nowhere. There’s a GET SUPPORT button and an X for logging out. Welcome schmelcome. Now, I just ordered my vehicle. I suppose there must be a lag. If that’s the case, then the app should communicate that.\n\nI hope this doesn’t portend what is to come at delivery and post-purchase.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6304148516","version":"3.10.7","date":"2020-08-10T23:55:53.000Z","authorName":"Leahlenore","rating":1,"title":"Developers, please make this app work.","body":"Changing my review to one single star. I can’t even get this app to work anymore, even after uninstalling and reinstalling multiple times.\n\nI would love to say that this is a five star app, but it is far from it. This garbage app I have had to continually uninstall and reinstall because it just doesn’t work. Would be nice to not have to carry my keys around and be able to rely on the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6304109912","version":"3.10.7","date":"2020-08-10T23:39:27.000Z","authorName":"Illok","rating":3,"title":"Please enable scheduling","body":"Great app but I feel many advanced options are missing like scheduling. Please push the update for scheduling things like when the car needs to be auto heated or battery warm up and etc","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6304014635","version":"3.10.7","date":"2020-08-10T22:58:01.000Z","authorName":"Eugene Ko","rating":1,"title":"Keeps Trying to Wake Up Car","body":"Every time I open the app, it endlessly tries to wake up the car to no avail.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6303643653","version":"3.10.7","date":"2020-08-10T20:20:45.000Z","authorName":"Kahin Dur","rating":1,"title":"App never connects","body":"The app never connects to the vehicle. In the beginning, it was consistently connecting and I wondered why others had issues. But now, for the past month, I am unable to connect to the vehicle at all.\n\nTerrible!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6303630062","version":"3.10.7","date":"2020-08-10T20:15:19.000Z","authorName":"danabrian","rating":1,"title":"Doesn’t work with AT&T mobile","body":"The app used to work quite well, though within the past couple of months it no longer seems to work for AT&T Mobile customers. Network connection constantly times out, making it impossible for the app to communicate with Tesla vehicles or tesla solar. Very disappointing!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6300010219","version":"3.10.7","date":"2020-08-09T21:18:30.000Z","authorName":"Vessco","rating":5,"title":"Recently start not to respond after start. Very slow to start. Some times it take more than 2 min.","body":"Recently start not to respond after start. Very slow to start. Some times it take more than 2 min.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6299593861","version":"3.10.7","date":"2020-08-09T18:29:57.000Z","authorName":"Loau1981","rating":2,"title":"Needs more work","body":"I used to have the Solar City app. This app is neither better nor worse. Something they omitted from this app is the ability to check one’s monthly bill. Why? The app is more tailored for those with a Tesla vehicle, yet doesn’t take into consideration those who have solar panels.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6299493092","version":"3.10.7","date":"2020-08-09T17:51:13.000Z","authorName":"southfishbill","rating":1,"title":"Doesn’t fully load","body":"Have to delete and reinstall whenever I want to see all categories.\nThen, they all appear.  Next time....same thing!  Very frustrating!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6295771009","version":"3.10.7","date":"2020-08-08T18:18:14.000Z","authorName":"lilboost99","rating":1,"title":"App wont even load","body":"Terrible app i cant even open it, it takes too long to load.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6295343042","version":"3.10.7","date":"2020-08-08T15:42:28.000Z","authorName":"jadenstarraw","rating":3,"title":"App stuck on updating from last time, never actually loading the current status","body":"App was working fine for a while until recently. Now it seems very random and not reliably loading the current status of my car. On app start up, it used to take 5-10 seconds max to load the current status but now it hangs indefinitely until it asks you to retry and still won’t work. I’m only able to get it working at random times on start up. My internet is fine btw. This also mainly happens on my phone internet even though I have unlimited, unthrottled internet with no sign of low connection. Please look into it. Thanks!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6294783794","version":"3.10.7","date":"2020-08-08T12:54:25.000Z","authorName":"Luv2lrn123","rating":2,"title":"Terrible AI","body":"This app used to just rely on user custom settings to manage Powerwall use for cost savings, saving battery for peak energy costs in order to keep our energy bill lower. Not anymore. They updated their app to include AI technology that fails. And since peak time begins at 4AM, by 7AM the batteries are out of juice and we are paying the highest fees to Duke Energy. Tesla, your AI stinks!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6292664824","version":"3.10.7","date":"2020-08-07T23:39:45.000Z","authorName":"rotrupod","rating":1,"title":"Needs a lot of improvement!","body":"Everytime I want to check the battery status I have to log out and then to log in again to update the screen. This is so annoying","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6291724815","version":"3.10.7","date":"2020-08-07T17:27:24.000Z","authorName":"AppleSince86","rating":3,"title":"A major annoyance","body":"Every few weeks, this app demands that you re-enter the Tesla password ... again ... and not just to use it, but also to regain use of Touch-ID with it as well; so you have to enter the password not just once, but twice. Realize that this can happen at any time, like when you are coming out of the grocery store in the winter with bags and seek to turn on the heater remotely...and you can’t. Hugely annoying. Makes you wonder if Tesla software developers use this exasperating app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6285335125","version":"3.10.7","date":"2020-08-06T03:53:26.000Z","authorName":"L.L.D.2.","rating":1,"title":"Please fix","body":"With current version I can’t connect to my car over LTE, only when on wifi. Network keeps timing out, I have tried deleting and downloading app again...same problem. I have tried rebooting car...same problem. A lot of other owners on Group have same complaints. Tesla please address the problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6284683111","version":"3.10.7","date":"2020-08-05T23:48:18.000Z","authorName":"Drvgames","rating":1,"title":"Connection issues","body":"Having lot of connection issues lately.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6280277682","version":"3.10.7","date":"2020-08-04T20:54:44.000Z","authorName":"Guitargod89","rating":1,"title":"Useless","body":"Will not connect to my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6276445810","version":"3.10.7","date":"2020-08-03T21:55:15.000Z","authorName":"Slovannaga","rating":2,"title":"Password issues","body":"I have had multiple issues trying to use the app and it not taking my password. Then when I try to reset password it won’t allow me to reset. I can’t get assistance either. So frustrating.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6272818558","version":"3.10.7","date":"2020-08-02T23:35:44.000Z","authorName":"socalrey","rating":1,"title":"Doesn’t connect on cellular","body":"Cmon guys, this has been a problem for weeks.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6271524166","version":"3.10.7","date":"2020-08-02T15:05:53.000Z","authorName":"Hawwties","rating":1,"title":"Garbage","body":"Fails to connect 90% of the time. Useless piece of trash.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6271082803","version":"3.10.7","date":"2020-08-02T12:49:45.000Z","authorName":"TrentMC","rating":1,"title":"Used to be great","body":"Not sure what happened but neither my wife nor I can connect to our vehicles through the app unless we logout, close in background, then open and login again. What is up? How has this been going on for weeks without a fix? Also, how dumb is it that instead of linking the App Support button here to actually share feedback, it just takes you to Tesla’s home page. So users have to leave negative reviews here and pray the developers actually care and check these??","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6269545464","version":"3.10.7","date":"2020-08-02T03:20:21.000Z","authorName":"JohnMcCo","rating":3,"title":"Good  but needs navigation","body":"Why don’t you add navigation to the Tesla app?  It would be great to have functionality like A Better Route Planner built into the Tesla app so you could do trip planning (including charging) then send it to your car.\n\nMy car has stopped talking to the app?!  Car is fine... app just keeps saying last update was yesterday.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6269018677","version":"3.10.7","date":"2020-08-01T23:54:55.000Z","authorName":"el Priest","rating":1,"title":"AT&T Connectivity Issues","body":"For the past few weeks I have been experiencing connectivity issues. When I open the app it does not connect. This is a huge issue. Need it fixed immediately!!!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6265860713","version":"3.10.7","date":"2020-08-01T04:49:07.000Z","authorName":"tlugowski","rating":1,"title":"AT&T won’t connect","body":"Can’t connect to car when on AT&T cellular connection. Once I use Xfinity WiFi it connects instantly. There’s a thread on Tesla Motors Club with a bunch of people having this issue on AT&T. Please investigate! App 3.10.7 car 2020 M3 2020.24.6.9. Issue persistent for past two weeks-ish.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6261483516","version":"3.10.7","date":"2020-07-31T02:06:24.000Z","authorName":"Mac B from Tennessee","rating":3,"title":"Add Siri shortcut support","body":"This app would be so much more useful if I didn’t have to open the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6259136706","version":"3.10.7","date":"2020-07-30T12:02:18.000Z","authorName":"Jonathan_Wick","rating":2,"title":"AT&T","body":"As previously reported, AT&T phones no longer connect when using cellular. Please fix!   Thank you.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6257708014","version":"3.10.7","date":"2020-07-30T03:00:54.000Z","authorName":"emaaren","rating":1,"title":"Summon","body":"Summon rarely works and disconnects / stops for no reason. Hope this can be fixed as it stands out from the entire Tesla experience which is awesome...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6257321762","version":"3.10.7","date":"2020-07-30T00:36:47.000Z","authorName":"ssmpr","rating":1,"title":"Fix AT&T connection issue","body":"Read the forums, noone with at&t can connect to the app after the update","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6255898316","version":"3.10.7","date":"2020-07-29T15:23:21.000Z","authorName":"Fly_guy","rating":4,"title":"Great app, could be better!","body":"I’d like to see more functionality: 1) charging: More charging stats. total amount of charge that has added in miles/energy. Allow a place to input home kWh price to see charging cost. Charging schedule adjustments. 2) outside temperature. 3) On demand camera images.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6255600935","version":"3.10.7","date":"2020-07-29T13:55:09.000Z","authorName":"flybone89","rating":2,"title":"Waking up... Vehicle Connection Error","body":"This is an ok app when it is actually able to connect to the vehicle in that it does provide some nice features such as the ability to set the cabin temperature before a trip or check/set charging. It does generally improve the vehicle experience although the app’s UI is only ok - there a lot of settings buried in a long and ugly top menu. And one key missing feature is the ability to control charging with the same granularity as the car such as changing the charge schedule.\n\nBut this app is very unreliable connecting to my vehicle, whether it is on WiFi or cellular. I frequently get “Waking up” messages where I have to wait minutes watching a spinning arrow for it to connect or in about 1/3 of the time results in a “Vehicle Connection Error.” I have to reboot, recycle, and most of the time it finally connects. But several times I had to go out to the vehicle and get in before the app finally connected - kind of stupid don’t you think for an app that is supposed to allow for remote access?\n\nI do like having the app a lot and when it connects it really is a good experience overall. But I can’t in good faith give it more than a few stars because it is just so frustrating to get it to connect.","voteCount":6,"voteSum":5,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6252912504","version":"3.10.7","date":"2020-07-28T21:15:02.000Z","authorName":"Contrari","rating":1,"title":"Won’t update. Won’t connect.","body":"Without this app there are so many features lost. I can not locate my car, turn climate on, check the charge state remotely, or CONTACT TESLA. It quit working a couple of weeks ago. Deleting and redone loading, signing out and in have no effect. Maybe a hardware issue with my Tesla, but since the app is the only way to get a service appointment, I’m between a rock and a hard place. This is a flaw in the system, a bug, not a feature.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6249415258","version":"3.10.7","date":"2020-07-27T23:51:14.000Z","authorName":"Exorth","rating":1,"title":"Connection issues","body":"Cmon guys... connection issues. Only way to connect to my car is via the widget. Att wireless cellular connection never connects via the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6248473502","version":"3.10.7","date":"2020-07-27T17:29:09.000Z","authorName":"ApocJones","rating":2,"title":"Connection Problems","body":"The app has recently started having problems connecting to the car.  I’ve signed in & out several times, deleted & reinstalled the app, and it’s still not working correctly.  Doesn’t matter if I’m on cellular or WiFi.\n\nI did discover a quick hack though.  If I swipe down on my iPhone 11 Pro (512gb AT&T) screen to show the widgets: going to the Tesla app widget connects in mere seconds, then clicking on the widget to open the app (instead of from the home screen), reestablishes the connection on the main app.  However, I have to use the method everytime to get the app to connect.\n\nAlso, this doesn’t seem to happen on the Tesla app on my iPad (which also uses AT&T cellular).","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6237262316","version":"3.10.7","date":"2020-07-24T18:35:22.000Z","authorName":"SabrToothSqrl","rating":1,"title":"Does not work on ATT","body":"App will never work or connect on ATT wireless. \n\nUsed to work fine. \n\nFix it. \n\nAll my other apps work fine.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6236594094","version":"3.10.7","date":"2020-07-24T14:48:43.000Z","authorName":"YGlen","rating":5,"title":"Use caution if using this app to monitor a solar panel system!","body":".... because it is highly addictive. Well done Tesla!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6229640011","version":"3.10.7","date":"2020-07-22T21:38:06.000Z","authorName":"DrumDoc5","rating":1,"title":"App not connecting to car over cellular data","body":"Since around 7/18 app stopped connecting to car when phone is connected to cellular data but connect fine over Wi-Fi. However widget connects either way. I have latest iPhone with AT&T plan using e-sim.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6225397012","version":"3.10.7","date":"2020-07-21T21:00:43.000Z","authorName":"vector723","rating":1,"title":"App not working when NOT on wifi","body":"Please check the latest build. The app does not work when not on WiFi.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6221782332","version":"3.10.7","date":"2020-07-20T23:25:36.000Z","authorName":"Flyat37k","rating":3,"title":"App needs Improvement","body":"Love the car, but recently the app has been a bit of a headache. I will open the app to unlock the car remotely or try and start the climate to cool the car down and all I get is an error and spinning wheel of death. It all started with the latest update and I am hoping the bugs get resolved so I can go back to loving the app. The car is amazing, the app has a lot of room for improvement.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6217434064","version":"3.10.7","date":"2020-07-19T18:52:08.000Z","authorName":"trythisathomehotmail","rating":2,"title":"Not so useful. It should notify about simple service maintenance","body":"Tesla could spend some energy on app. Not too useful app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6214907533","version":"3.10.7","date":"2020-07-19T03:22:08.000Z","authorName":"HappyAlyGirl","rating":4,"title":"Good but...","body":"Overall it is a good app and has MOST of the functions needed but an Apple Watch app would be great as well as the ability to remotely control the fart feature through the app (a must have).","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6205345382","version":"3.10.7","date":"2020-07-16T15:40:25.000Z","authorName":"reggiej81","rating":2,"title":"Freezes for days","body":"When it works, it’s great. However, there are days when the app just says “updated yesterday” and the update icon just does the circle of infinite loops, and nothing happens. Even if I quit the app, restart my phone, nothing changes. You open the Tesla app again and the same circle just goes around and around without any app functionality possible. Fix this please.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6204976407","version":"3.10.7","date":"2020-07-16T13:55:31.000Z","authorName":"BiAmethyst","rating":4,"title":"Needs Apple Watch version","body":"Love this app on my phone but would like it even more if there was an Apple Watch version","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6200738939","version":"3.10.7","date":"2020-07-15T12:53:15.000Z","authorName":"Tribuchet","rating":1,"title":"Roadside Assistance Not Working!","body":"2 days after receiving roadside assistance the app still says service is in progress and won’t update status as completed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6191864649","version":"3.10.7","date":"2020-07-13T06:33:43.000Z","authorName":"JojoCharlie","rating":1,"title":"No Apple Watch version","body":"Why does the official app still not support the Apple Watch which many third parties do?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6180800203","version":"3.10.7","date":"2020-07-10T11:52:33.000Z","authorName":"sdmkius","rating":2,"title":"Worthless","body":"App server down again this happens constantly. Constantly have to reinstall app . Not worth it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6173532117","version":"3.10.7","date":"2020-07-08T19:57:06.000Z","authorName":"robhawleyastro","rating":5,"title":"Battery time ranges don’t go to midnight","body":"My utility changes my rate at midnight. Unfortunately the sliders only go to 2330.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6173343526","version":"3.10.7","date":"2020-07-08T18:51:57.000Z","authorName":"Renneeaayyyeee 😌","rating":1,"title":"My product is not linked to my account","body":"I purchased a home with solar city panels. I’ve had such a terrible time figuring out the transfer process and now I can’t log into my account. It says I have no products. The website is not solar friendly. It’s been tough to find guidance. I don’t even know if my panels are working. My electric bill says no. It’s been a terrible experience!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6173164186","version":"3.10.7","date":"2020-07-08T17:53:06.000Z","authorName":"Mgdurand","rating":1,"title":"Poor service experience","body":"Scheduling service through an app is the stupidest idea in Tesla-dom. \n\nA 20-second phone conversation with a human being at service would have informed me that they could not turn my car around in 24 hours, but instead I have only a robo-app and a 1.5 hour round trip to Service to find that out. What a waste of time. \n\nTesla service is the worst, and requiring an app for this things like this is just insulting.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6172590412","version":"3.10.7","date":"2020-07-08T15:01:21.000Z","authorName":"willy_wally","rating":3,"title":"Needs iPad Version","body":"Use the app to track Tesla solar panel’s performance. The app would benefit if it were optimized for the iPad’s larger screen size. That the app is used for both Tesla automobiles and solar panels is a bit confusing. Otherwise the app seems to function as advertised though the overall user experience is not well thought through as elegantly as the products they are associated with. Please go back to the drawing board.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6170228288","version":"3.10.7","date":"2020-07-08T01:10:51.000Z","authorName":"ASH::::::","rating":1,"title":"The A/C & Heat control is always delayed","body":"Option 1: make it Bluetooth like the locks.  \n\nOption 2: allow the button to work before the wireless connects. Once it connects the app sends the command. \n\nTesla Solution? Make you wait until the wireless connects and watch the hourglass before you can start the temp.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6170061631","version":"3.10.7","date":"2020-07-08T00:11:53.000Z","authorName":"hotturkey","rating":1,"title":"Eats battery","body":"Even with Background App Refresh turned off, the Tesla app shows 100% background activity on the Battery Usage screen. On numerous occasions I’ve seen my charge level go from 100% to almost zero within a few hours. The functionality is great, but this is a truly horrible flaw.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6165527848","version":"3.10.7","date":"2020-07-06T21:03:47.000Z","authorName":"gyg g Lu f G","rating":1,"title":"Broke","body":"Does not work. All day. Escalation???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6161364462","version":"3.10.7","date":"2020-07-05T19:21:43.000Z","authorName":"DeacMG","rating":2,"title":"Spotty at best","body":"Constantly fails at updating. Requiring re-pairing phone in a lengthy process just to turn on the air remotely.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6158818714","version":"3.10.7","date":"2020-07-05T04:00:19.000Z","authorName":"Padre Gary","rating":1,"title":"Tesla app & Gateway not working.","body":"Tesla app is not reading Powerwall activity nor Solar input or usage.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6155393792","version":"3.10.7","date":"2020-07-04T06:54:17.000Z","authorName":"JSThacker","rating":2,"title":"App is TERRIBLE downgrade for Solar City customers","body":"I don’t own a Tesla vehicle, but I do have Solar City power at my home. This Tesla app is virtually useless compared to the capabilities of the old Solar City app. It’s next to impossible to assess my home’s solar power creation and usage with this app. I miss the old Solar City app features and and deeply disappointed Tesla chose to “streamline” everything into this app that clearly focuses on their automobiles with little care for their solar home customers.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6148937029","version":"3.10.7","date":"2020-07-02T15:56:03.000Z","authorName":"CheapIrish","rating":1,"title":"Does some things fine; Summon hardly at all","body":"I don’t know if this is a function of the app or the car or a combination, but the app seems unable to connect to the summon feature. Since this is a key feature of the car that sets it apart from most others it makes the app pretty useless. \n\nSure, I can honk the horn, open the frunk vent the windows remotely with the app, but the gee-wizz summon feature...not so much.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6146342350","version":"3.10.7","date":"2020-07-02T01:17:27.000Z","authorName":"BILLERNAR","rating":4,"title":"Redesign / Optimize","body":"It is ok, I would like a redesign / optimization to make it cleaner and faster.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6144928826","version":"3.10.7","date":"2020-07-01T16:37:21.000Z","authorName":"aimran11","rating":2,"title":"Service appointment not working","body":"This latest update is not allowing me to schedule a service appointment form my home address. I have deleted and reinstalled the app and still no luck. Please fix this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6141500094","version":"3.10.7","date":"2020-06-30T21:34:16.000Z","authorName":"AP2725","rating":4,"title":"Not bad","body":"Pretty decent app for an otherwise underwhelming car. Wish it had stats though","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6138333321","version":"3.10.7","date":"2020-06-30T03:55:32.000Z","authorName":"Jjjjjj12234567889","rating":5,"title":"Greatest APP and car","body":"When we use this APP, we may thinking about, why other car maker never did this, all those APP remote function and push address / YouTube into car were available Technology. Other car maker just want sale you a very complex and useless key, or a strange touch screen input","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6132216402","version":"3.10.6","date":"2020-06-28T14:33:39.000Z","authorName":"HForan","rating":1,"title":"I want my solarcity app back!!","body":"We have been converted to this app for a little over a year now and it is absolutely awful.   This app is not designed to handle the solar panel customer.  I want to see my grid.  I want to know that all of them are reporting correctly.  I should be able to access my account through my app and through the website.  The solarcity app allowed me to manage my account.  This app is a waste of my time Fix my app!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6131641104","version":"3.10.6","date":"2020-06-28T11:33:27.000Z","authorName":"Tucson Rick","rating":5,"title":"Needs an Apple Watch App!","body":"Only thing the Tesla app needs is an official. Apple Watch app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6128521637","version":"3.10.6","date":"2020-06-27T15:37:02.000Z","authorName":"01 Rc-51","rating":1,"title":"Never depend on the app","body":"Design an electric vehicle to drive across country, Check. Design an app to strand owners in the middle of nowhere, Check. Tesla can develop their own chipset/video card for self driving, but they can’t add Bluetooth connectivity to use your phone as a key???\n\nIf you ever may travel through an area without cell coverage, don’t trust your app for access or starting. I expected this issue so I disabled auto lock, not to worry the Tesla decided to change profile and auto lock again. \n\nAt least sentry mode will have video of me cussing at my super car as I realized what happened.\n\nDon’t let my first world problems become yours. Be blessed, love your neighbor, and rock on!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6120871060","version":"3.10.6","date":"2020-06-25T16:45:19.000Z","authorName":"Rev. Paul","rating":4,"title":"Apple Watch and updates?","body":"Great app, but still looking for Apple Watch support for things like Battery status, Climate, Charge Port, and maybe unlock. \n\nAlso, I would like to review car software update information in the Tesla app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6119976060","version":"3.10.6","date":"2020-06-25T12:06:21.000Z","authorName":"Rick G","rating":5,"title":"Works really well","body":"Very Well integrated with car. \n\nOnly area that is poor is providing details of costs incurred at Tesla charging stations. Please can you add the historical details of how much each charging session cost and how many kWh were transferred? Thanks","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6118768351","version":"3.10.6","date":"2020-06-25T04:38:01.000Z","authorName":"Drea82581","rating":1,"title":"Unable to see Solar usage in app.","body":"I’ve had PTO from PG&E for over a month. I’m unable to see my usage through the gateway. I can see it on the PGE.com website with no problem the generation. I’ve tried to contact Tesla and they say my system is working. But it’s not the system it’s the gateway and this app. It gives me an error. It says sign-in failed. There’s no product linked to your Tesla account. This is so frustrating. I’ve done the trouble shooting steps. Delete, reinstall app. Shut down phone, reboot and all over again. My system was paid in cash with my mortgage. I’m not sure if this is the error. I can seem to get anyone to help me!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6115771303","version":"3.10.6","date":"2020-06-24T10:41:31.000Z","authorName":"WLTee","rating":1,"title":"BS","body":"This app is nothing more than a link to a website. No sign in, no password, nothing but tired solar panels pix.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6103339086","version":"3.10.6","date":"2020-06-21T07:02:04.000Z","authorName":"m00nd0","rating":3,"title":"Need to view Sentry Mode from App","body":"The app is solid and the car responds swiftly to app commands as is.\n\nThe one thing that I would like added to the app is the ability to view Sentry Mode video in the app as well as have control of the recordings.\n\nI would like to see the Sentry Mode videos on my phone while not in my vehicle to either assess a threat or just to delete benign videos.\n\nConsider the Ring app’s functionality. That would be a perfect addition to the Tesla app.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6100691759","version":"3.10.6","date":"2020-06-20T14:39:25.000Z","authorName":"3257 kgj","rating":1,"title":"If only","body":"I would love to write a fabulous review of this app but I can’t. My account is established however, the app will not accept my login and password. The only way to login is to change my password. Each time I try to log in I MUST change my password. Otherwise, I just can’t log in to use the features of this app. I really need this app when traveling!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6092442604","version":"3.10.6","date":"2020-06-18T16:47:06.000Z","authorName":"Shlomie516","rating":3,"title":"Lacking functionality","body":"Seems like there are several basic features which should be available in the app but aren’t. For example, I can adjust the A/C and heat temperature remotely through the app, but not the blower strength. It defaults to whatever I was on before. So if I had it on lowest power and later want to pre-cool my car on a very hot day, it will run on setting 1 and won’t be able to cool the car sufficiently. Why not let me adjust temp and power?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6089413046","version":"3.10.6","date":"2020-06-18T00:49:32.000Z","authorName":"Gollnick","rating":1,"title":"Great... when it works","body":"Update:  it’s been at least a year since I first  complained about this app forgetting your password.  Despite many updates, that has not been fixed!\n\n———- Original Review ——-\n\nThis thing just seemingly randomly forgets your password from time to time.  It’s very annoying.  Sometimes, it connects to the vehicle quickly; sometimes not so much. \n\nI wish it was more reliable.  I wish it had more features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6083717082","version":"3.10.6","date":"2020-06-16T16:45:57.000Z","authorName":"Rwharch","rating":4,"title":"App Home Screen","body":"How do you change the default settings on the home screen from (fan, open Fronk, unlock) ?\nI would like to change fronk choice to trunk.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6083241705","version":"3.10.6","date":"2020-06-16T14:28:18.000Z","authorName":"ugotanygrap3s","rating":5,"title":"#1 Forever","body":"The worlds most valuable car company after only 16 years is doing things no other company will ever achieve. This app is included in the long list of amazing features Tesla has perfected. Fake news is so strong with Tesla because they are wiping out all the legacy industries ran by 70+ year old! Welcome to the future without the greed and corruption! Cheers to Tesla, the #1 Auto manufacturer in the WORLD!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6067658621","version":"3.10.6","date":"2020-06-12T17:25:55.000Z","authorName":"Veryveryannoying","rating":2,"title":"Erratic","body":"When the app works, it provides the information I need. Unfortunately, it connects only about 70% of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6063250671","version":"3.10.6","date":"2020-06-11T14:25:27.000Z","authorName":"Sucka34567","rating":1,"title":"Covid Cust Service","body":"I’m ok with the functionality of the app but you can’t actually get help from them. They have taken a week to reply to my inquiry and only requested I verify my identity even though I used their app and my linked email. Week later and still no reply to that email. They just abandon you after they have your $50,000 I guess.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6056139770","version":"3.10.6","date":"2020-06-09T20:29:34.000Z","authorName":"Graecus13","rating":4,"title":"Great app","body":"Great app. Only thing missing is Apple Watch support. And key support for Apple Watch. \nThanks for a good app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6056135069","version":"3.10.6","date":"2020-06-09T20:27:40.000Z","authorName":"traveller009","rating":3,"title":"slow, privacy concerns","body":"Unimportant items such as ‚phone key‘, and ‚updates‘ take up way too much screen real estate and distract from the frequently used ones. I wish there would be more customizable fast commands on the entry screen.\nSecond issue is a privacy concern as anybody with a phone key set up can constantly look up the location of the car. There should be guest accounts with no location access.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6055413530","version":"3.10.5","date":"2020-06-09T16:16:36.000Z","authorName":"Pensive Listener","rating":5,"title":"Light years ahead of other cars","body":"This app is far more advanced than any other car. With it I can ask my car to pull out of the garage, turn on the A/C, unlock the car (you don’t need a key), monitor it’s location, and schedule service appointments.\n\nYes sometimes it has an issue or two (like needing a minute to connect with your car) but it’s far beyond any other.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6049149205","version":"3.10.5","date":"2020-06-08T03:21:25.000Z","authorName":"Skiwhino","rating":4,"title":"Great basic features needs a few more","body":"The app is great at the basics which is fantastic.   A few things it needs for future updates\n\n—Tesla sentry mode and dash cam viewer from the app.   Should be able to pull up everything on the phone.  \n—more data on trips, efficiency and charging.  Should have access to this.  Many owners rely on 3rd party apps for this currently.  \n—more trip planning and super charger info, amenities, etc available","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6044256388","version":"3.10.5","date":"2020-06-06T22:14:29.000Z","authorName":"czarcone","rating":2,"title":"No notifications","body":"I was told the app supports notifications, but I’m not receiving any, and I don’t see any options in the Settings menu.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6041805074","version":"3.10.5","date":"2020-06-06T08:33:10.000Z","authorName":"srknc","rating":3,"title":"Lot’s of missing features","body":"- Siri support\n- Apple watch support\n- Lock confirmation vibration \netc","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6019281196","version":"3.10.5","date":"2020-05-31T21:55:42.000Z","authorName":"alex_kuts","rating":2,"title":"Sentry mode","body":"1. cannot view events in sentry more!\n2. many paid features!\n3. weak signal when the car is far away!\n4. when you go a certain distance the car does not close automatically .... you always have to use the phone in manual mode!\nThese are the minimum comments ... so far the application is 2 with a plus. Waiting for updates","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"6015007548","version":"3.10.5","date":"2020-05-30T20:57:59.000Z","authorName":"TheGamingArt","rating":3,"title":"Broken features","body":"It’s disappointing that Tesla has broken features such as remote start and unlock for pre 2014 model s owners. Most functionality you could want is here, but the apps lack the ability to share amongst family members with permissions roles. Considering this app is for solar and cars, that’s sort of a big deal...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5993637435","version":"3.10.5","date":"2020-05-25T22:01:40.000Z","authorName":"Jason Kimosabe","rating":1,"title":"Miserable experience","body":"This app is overall disappointing, it hardly works half of the time. I’m trying to schedule a service appointment and the option to do so\nWas Just absent from the home screen. I made sure the app was updated, and it was, and still nothing. Checked back a few hours later, about 6 and the feature was there again. Considering this is the only way to schedule service for this vehicle, I think it’s safe to say this app needs some attention.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5988942855","version":"3.10.5","date":"2020-05-24T18:55:00.000Z","authorName":"dn1010","rating":1,"title":"App not working properly","body":"Not update energy flow. Needs to be updated.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5984012022","version":"3.10.5","date":"2020-05-23T15:05:02.000Z","authorName":"DKpod","rating":1,"title":"Doesn’t work","body":"This app is BS. It doesn’t work. Many calls to support asking why I have no products linked to my account and I am told to delete the app and try again?  Downloading the app again does nothing if you don’t link my services to the app. What is taking so long? Three weeks later still nothing.  Delete the app and try again? Nonsense.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5981211826","version":"3.10.5","date":"2020-05-23T00:05:19.000Z","authorName":"bakers finest","rating":1,"title":"App never works","body":"Had to call and see if my solar system was producing since the app doesn’t.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5979438068","version":"3.10.5","date":"2020-05-22T14:36:11.000Z","authorName":"Jewjsheoxh","rating":1,"title":"Where are my solar panels?","body":"I tried to log into my solar city account and it said I had to download this and it doesn’t work. Can’t wait for my lease to be up.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5969661974","version":"3.10.5","date":"2020-05-20T10:31:23.000Z","authorName":"Reidhoudy","rating":4,"title":"Why?","body":"When Apple and  Android watch, widgets to make easy","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5969129940","version":"3.10.5","date":"2020-05-20T07:32:02.000Z","authorName":"Anonymous 9/10/2013","rating":5,"title":"Tesla Wall Great App","body":"Extremely useful to monitor my home energy consumption. Please add option to enter my personal billing cycle as time range.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5962856108","version":"3.10.5","date":"2020-05-18T21:45:38.000Z","authorName":"joshua.hutchens","rating":3,"title":"doesn’t work while your car is in service","body":"seems like a neat app for most of the time but my car has been at the service center for the past month and the app won’t show me anything except a screen saying that my car is waiting for service. had to download third party apps to use with my loaner tesla. app works as a key which is awesome but doesn’t always work so your left fumbling with your phone restarting apps just trying to get in the door","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5959093650","version":"3.10.5","date":"2020-05-18T00:12:49.000Z","authorName":"Eaglidahoan","rating":1,"title":"Butt dial $7000 charge !! Shameful","body":"Don’t get me wrong I love my Tesla and mostly enjoy using the Tesla app. But yesterday after turning on the climate to cool my car remotely, I got in the car to see I had been charged $7000 for the self driving upgrade. What???\nSince then I have read of others experiencing the same issue. Appears to be a butt dial issue which allows inadvertent high value purchases. Though my case appears to be resolved, (still waiting to see on the credit card or hear from a live person), my near heart attack and the hours spent so far attempting to resolve this was completely unwarranted and shameful. Tesla, we expect better from you. \n\nThe fact that this is possible as a butt-dial is at best sloppy, at worst devious. Please remove the expensive upgrade option from the app, otherwise We will be afraid to use it. \nAt the very least require 2-factor verification or another secure method to prevent this from happening again to your loyal Tesla owners. You can do this, we know you can.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5958614492","version":"3.10.5","date":"2020-05-17T21:00:58.000Z","authorName":"Wuwu-2","rating":1,"title":"Cool when it works","body":"Both the car and home energy monitors stall out often. The home energy monitor appears to be in a world of its own. Sometimes it vaguely seems to be reflecting what is actually happening. Haven’t found anything to fix these issues after looking at the FAQs, forums or with their tech support.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5957296377","version":"3.10.5","date":"2020-05-17T13:38:21.000Z","authorName":"Goyo1973","rating":4,"title":"Missing key features","body":"It’s a great app but misses key features:\n\n1. Ability to change charging schedule\n2. Stats or charts showing distribution of energy per component in the car, what’s draining more battery, etc.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5946606855","version":"3.10.5","date":"2020-05-15T02:24:07.000Z","authorName":"Paydirt76","rating":5,"title":"Works GREAT!","body":"Lots of cool things you can do with your car from the app. *) have the car come to you *) use your phone as the car key 1) pre-heat/cool cabin 2) warm the battery 3) crack the windows, 4) honk the horn, 5) trigger a software update 6) open the trunk or frunk 7) flash the lights 8) know the car’s location.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5937124490","version":"3.10.5","date":"2020-05-12T20:24:09.000Z","authorName":"cooliolilio","rating":1,"title":"Tesla fails again","body":"Every time I try to log in to the app it says I have no product linked.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5926602323","version":"3.10.5","date":"2020-05-10T07:01:45.000Z","authorName":"melapetal","rating":4,"title":"Missing Fit & Finish","body":"This app works, it does the things that make owning a Tesla so much fun. But the application itself is missing that fit and finish! The animations have frame drops, the slow connection time to the car, the delays when toggling buttons or seeing field values update with new data, etc. It’s all rather clunky and the communication in the design leaves a lot to be desired. \n\nI wish Tesla would overhaul this app and really tighten up the design, give this app a proper fit and finish! If they can design beautiful interfaces for the car, they can do it for the companion app as well. 4 Stars.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5924703827","version":"3.10.5","date":"2020-05-09T19:40:29.000Z","authorName":"GEORGE!!!!!!!!!!","rating":4,"title":"Good app","body":"Hi it is cool that you can do stuff with the Tesla from your phone so I like the app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5924044167","version":"3.10.5","date":"2020-05-09T15:58:29.000Z","authorName":"OmarAhsan","rating":4,"title":"Clean & Stable","body":"Updated: May 9, 2020\n\nStill missing fundamental analytics. Needs companion watch app. Otherwise still pretty darn good. \n\nHas all the basics wrapped in a very nice UI. Ability to switch between cars is slick. \n\nWould be nice to add some of the analytics that some of the third party apps are offering.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5919797680","version":"3.10.5","date":"2020-05-08T16:09:45.000Z","authorName":"royrg79","rating":5,"title":"Great for Tesla Solar","body":"Great monitoring tool for power consumption using Tesla Solar","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5912282913","version":"3.10.5","date":"2020-05-06T23:44:21.000Z","authorName":"rachel porsche","rating":1,"title":"Never loads","body":"Lately the app just spins on updating forever and never loads for me to be able to use car controls like unlock. Worthless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5912147571","version":"3.10.5","date":"2020-05-06T23:12:29.000Z","authorName":"Chabis77","rating":2,"title":"Decent but needs improvement","body":"App works okay. Needs some improvement and fine tuning. Would be nice to be able to remove the aero covers on the 18” wheels for the car displayed in the app (and on the infotainment system in the car). Need percentages when setting charge level/limit, take the guesswork out!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5903587120","version":"3.10.5","date":"2020-05-04T23:27:23.000Z","authorName":"Modern8Guy","rating":3,"title":"Error when trying to check existing service schedule","body":"I get errors when I try to review my service schedule! It’s been like this for few days now. When I tried calling tesla seems like there is no support for the app! A dedicated phone line for mobile app issues would be great. I’ll update my review once I get my issue fixed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5899441863","version":"3.10.5","date":"2020-05-03T23:58:14.000Z","authorName":"SilverXrider","rating":3,"title":"Not Powerwall friendly","body":"I use this app to monitor our powerwall backup system. Most of the options and functions work OK but none of the status graphs will update on page pull down, you have to load either yesterday’s stats then switch back or in the case of grid status switch to the weekly status page then back to daily to get it to update. How hard is it to get the status to refresh to current levels when I open the page.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5890144381","version":"3.10.5","date":"2020-05-01T20:46:25.000Z","authorName":"SirBobbycharlton","rating":5,"title":"Amazing app!!!","body":"Love Elon Musk and I love this app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5872119292","version":"3.10.5","date":"2020-04-27T20:08:17.000Z","authorName":"Haapy dude","rating":1,"title":"Horrible compared to SolarCity App","body":"Tesla’s app hardly has any data.  I can’t see how each inverter is producing energy.  The MySolarCity app would display what each of my 3 inverters were producing.  Lifetime use is gone.  This app fails it’s customers.   Tesla needs to import all the functionality from the MySolarCity app ASAP.  I HATE being in the dark as to how my system is running an not seeing all the information I use to be able to analyze.  I can’t see if the system is not reporting like I use to, to spot a problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5864177047","version":"3.10.5","date":"2020-04-26T00:36:15.000Z","authorName":"Slogans","rating":1,"title":"Refuses to accept pw","body":"I signed up on the website,  I problem. I have full access. But the refuses to accept the same login and pw.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5848140346","version":"3.10.5","date":"2020-04-22T13:13:51.000Z","authorName":"DJ Paul M","rating":4,"title":"Pretty good!","body":"Great app, mostly, but as others have said, having a charge percentage would be a great idea. Currently I’m using a third party app which allows that (TezLab). \nI noticed the widget sometimes doesn’t refresh correctly, which then makes it a bit pointless when the app needs to be opened anyway. Today my widget told me I had a Model S with a dead battery, although I have a model Y with a fully charged battery.\n\nApple Watch support would make this incredible.\n\nAlso noticed that in a few cases (this is a small bug) the X appears twice, overlapping itself (at least on the iPhone 11 Pro). This happens in the schedule service screen, upgrade screen, and a few others. \n\nOverall, great job so far!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5846923826","version":"3.10.5","date":"2020-04-22T06:48:03.000Z","authorName":"Johnny_5_5","rating":5,"title":"Awesome","body":"👍🏎🤩","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5839077585","version":"3.10.4","date":"2020-04-20T14:29:42.000Z","authorName":"EB20162020","rating":1,"title":"Doesn’t work","body":"This app is helpful when it decides to work. Mine hasn’t been able to connect in over a week. This is not an unusual occurrence for my family and me with this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5834316605","version":"3.10.4","date":"2020-04-19T13:20:40.000Z","authorName":"Scotty5268","rating":1,"title":"Tesla Solar","body":"Ever since my solar changed from Solar City to Tesla, my customer service has dropped. The app does me no good.  Why can’t I pay my bill on the app?  Tesla is more concerned about referrals than supporting current customers.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5827717632","version":"3.10.4","date":"2020-04-18T03:32:56.000Z","authorName":"CruzzzzN","rating":1,"title":"Solar; Stuck like Chuck!","body":"Oh my, this is the worst app ever.  So these people wanted to get into the solar business so they bought out solar city.  The problem is the app was primarily developed for its autos.  The bigger problem is the app works when it wants to on my end, and Tesla doesn’t care because it’s getting all the data it can from me because it works on their end, so I get this worthless app because it’s required?  What a ripoff piece of junk!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5827150245","version":"3.10.4","date":"2020-04-18T00:44:40.000Z","authorName":"KeLLie(^_^)","rating":1,"title":"Error","body":"I just have this app for two day for my solar system.  It was working fine the first two days but on the third day the app is not showing any power flow from the solar panel.  I quickly contact the company and telling them that my solar is not working so they send people over to check and they took me it was working fine.  The only thing I see is I receiving the power from the grid directly. I think they really need to fix the app this gives customer a lot of problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5812391482","version":"3.10.4","date":"2020-04-14T23:43:10.000Z","authorName":"Weather Hound","rating":3,"title":"Wrong Car in App","body":"Just updated my Dec ‘17 MS from 2020.12 to 2020.12.5 and now the app shows a picture of the old style grill on my car. That’s not my car or how it used to be.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5796453578","version":"3.10.4","date":"2020-04-11T14:53:49.000Z","authorName":"ddubb5000","rating":1,"title":"No product linked to your account","body":"The app has worked fine previously.  However, when I logged in today, it says there are no products linked to my account.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5792593778","version":"3.10.4","date":"2020-04-10T20:08:43.000Z","authorName":"earthwoven","rating":4,"title":"Great app, just a couple of things...","body":"I would like to see the trunk button on the main screen rather than the frunk as I use the trunk way more often. I d also like to get my charging info/payment in the app too. And when I’m charging I’d like to be able to see how many miles I need rather than a percentage. That makes me do math in my head and I’d rather not. Thanks!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5788892136","version":"3.10.4","date":"2020-04-10T03:05:12.000Z","authorName":"Allpro69","rating":4,"title":"Great app but has stopped connecting to vehicle","body":"Oddly has stopped connecting to vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5779282942","version":"3.10.4","date":"2020-04-08T05:35:34.000Z","authorName":"Michael99909","rating":4,"title":"Siri Shortcuts Would be a Massive Benefit","body":"The app is fine, but could be a little simpler and add abilities to open doors aside from just trunks. \n\nMainly though: PLEASE ADD SIRI SHORTCUTS. Much easier to tell my phone to unlock the car, open the trunk then to get it out for everything.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5776270416","version":"3.10.4","date":"2020-04-07T14:56:03.000Z","authorName":"baroen","rating":1,"title":"Wildly inaccurate","body":"I have two Tesla batteries and a large solar array. At nine pm when it’s dark outside the house is lit up the app shows I’m feeding solar power to the grid. The app shows zero power is going to the house or to/from the batteries or from the grid. Useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5774544778","version":"3.10.4","date":"2020-04-07T06:36:47.000Z","authorName":"Bethspt","rating":1,"title":"Useless","body":"I hate this app! I miss my solar city app. Customer service is horrible! My system was down 2 months and we were never notified! When I finally figured out how to contact customer service they said they can’t get someone out to check our system for over a month 😡","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5745565384","version":"3.10.4","date":"2020-04-01T11:40:57.000Z","authorName":"MRgCOX","rating":1,"title":"Solar customer.","body":"This ap is almost useless as you cannot contact customer service anywhere on the app. My panels haven’t been productive for a month and the solar city app has been disabled.  The SC app was very functional and informative.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5742912950","version":"3.10.4","date":"2020-03-31T22:39:21.000Z","authorName":"121341","rating":1,"title":"Solar only","body":"Don’t mess with solar. You barely make a car worth while\nGive me back my solar city app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5727178676","version":"3.10.4","date":"2020-03-28T18:16:23.000Z","authorName":"enzoshadow","rating":1,"title":"Unstable as hell","body":"Got locked out of my so many times over the year because this app sometimes can’t open","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5704422887","version":"3.10.4","date":"2020-03-24T04:45:37.000Z","authorName":"D.Adams","rating":2,"title":"Now all I have read with issues has come true","body":"Love my car but in the past few weeks have had tons of issues with the app connecting. Have gone as far as deleting and re installing the app. Just won’t wake my car back up. Please fix this 🙏🏼🙏🏼🙏🏼🙏🏼","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5699283057","version":"3.10.4","date":"2020-03-23T02:36:02.000Z","authorName":"Ap1s2k","rating":1,"title":"Dumb app can’t even find my account","body":"I purchased solar from solar city.  That app was discontinued so I was told to download the Tesla app to keep track of my solar production.  I did that, tried to sign in and it says it can’t find products related to my account.  I go to Tesla.com and used the same credentials and logged in fine and saw my solar on the account.  I emailed support and was told to call support.  I did that, and they still can’t solve the problem of this dumb app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5694524695","version":"3.10.4","date":"2020-03-22T02:33:33.000Z","authorName":"JPROFET","rating":2,"title":"App needs improvement","body":"This is great for newer models but for those of us that have purchase a Tesla’s when they where just coming out (2014-2015) this app is limited of what it can do. \n\nExample:\n-Won’t open the car doors but it will closed them. OK\n-Won’t open the trunk or the fronk.\n-Will remotely star the car but if you can’t get in the car whats the point????\n-it will defrost the front window but not the rear window.\n-it tracks where you park the car but it does not have a emergency panic bottom like every other car in America.\n\nSo I gave it 2 stars because it seams that Tesla is only thinking on the new customers and forgetting the old customers that where there from the beginning. \n\nJust my opinion.\nJose","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5667073812","version":"3.10.4","date":"2020-03-16T06:25:08.000Z","authorName":"mtbdog","rating":2,"title":"Techs car, funky app","body":"Very little functionality for such a high tech car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5652365555","version":"3.10.4","date":"2020-03-13T00:35:02.000Z","authorName":"Pdizzy23","rating":4,"title":"iWatch App!","body":"Give us an iWatch app, so we can use our watches as keys.\n\nAlso app load times (connecting to the car) should be improved.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5651602696","version":"3.10.4","date":"2020-03-12T20:02:27.000Z","authorName":"Diveboss","rating":4,"title":"Needs more control","body":"I would like the app to be able to control the falcon wing doors and also support closing windows that are vented. Using the Tesla app along with several other third party apps allow more control and information than this app alone. It would be nice to have it all in one app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5640704887","version":"3.10.4","date":"2020-03-10T09:58:49.000Z","authorName":"solarpower","rating":3,"title":"Need Apple Watch support","body":"Good app but it really needs a support for Apple Watch. It would be so much convenient to open trunk/frunk from watch then the need to pull up my phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5639195119","version":"3.10.4","date":"2020-03-10T01:23:06.000Z","authorName":"Jezip","rating":4,"title":"Needs watch support","body":"Great app, very functional.  Would like to be able to roll up/ down windows through app.  Would also like to lock/unlock with my Apple Watch.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5638770618","version":"3.10.4","date":"2020-03-09T22:45:05.000Z","authorName":"AcethebaseagIn","rating":1,"title":"Tesla website and app","body":"Totally useless. There is no “billing portal” to access my solar panel account that Tesla took over from solarcity.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5628250302","version":"3.10.4","date":"2020-03-07T12:15:22.000Z","authorName":"Gfssthjbc","rating":4,"title":"Apple Watch complication","body":"I cannot believe Tesla does not have an Apple Watch app. Even my 2017 Chevy Volt had a watch app to unlock, preheat, etc. Please up your game Tesla, you’re an industry leader!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5624047162","version":"3.10.4","date":"2020-03-06T13:21:47.000Z","authorName":"Brianjed","rating":1,"title":"Latest update is glitchy","body":"App has trouble connecting to the car.  I need to kill the app and/or get within 3ft of the car to get it to work. \nI have deleted the app and reinstalled, no change. \nI have reboot the car also, no change. \nValidated same issue on my iPad too.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5620799653","version":"3.10.4","date":"2020-03-05T19:04:04.000Z","authorName":"TheSolarGuy","rating":5,"title":"Great for the Car!","body":"As you might have seen from other comments that the app might not be great for solar (I don’t know), but it works great for the primary function that is the car!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5618305908","version":"3.10.4","date":"2020-03-05T06:12:11.000Z","authorName":"Flexx187","rating":1,"title":"Cars charge on their own and cannot stop","body":"I have reached out to Tesla that the cars will start charging at home without being told to and cannot stop it via the app nor the car itself. They told me to delete the app and reboot the car. This happens on two separate phone and tablets as well as two platforms(Apple/Android). It also happens on four separate cars, one of which isn’t even linked to my account. When I told them this, they just stopped responding. It’s not safe and not ok that they won’t respond and not fix it. This has happened through several car AND phone updates. Hopefully this review brings more light to this unsafe situation.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5618003195","version":"3.10.4","date":"2020-03-05T04:29:48.000Z","authorName":"kornelyus","rating":1,"title":"Is this really an app?","body":"All it has is one button that takes you to the support page on the web. It does nothing else. What am I missing?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5609962167","version":"3.10.3","date":"2020-03-03T09:08:42.000Z","authorName":"TryThisNicknameOnForSizeThisTime","rating":2,"title":"Basics but not much more","body":"CONS\n——-\nLatest release doesn’t 100% lock car at wall away. \nLock at wall away can be 3 feet or 30. No consistency. \nNo sentry warning notifications on app. Why no message on phone if I was hit in parking lot. \nNo sentry clips mobile viewing. \nNo iPad native support. \nLock and HVAC icons confirm active or inactive. Frunk shows open always.\nNeeds better find my car support\nCheck for software updates with app like in car. Not just wait and see if it shows. \nAbility to force an update. Mine is currently 6 releases behind. \nAbility to delete in box messages. \nAbility for full charging options like in car. \nAbility to check Supercharger history not just remaining free credits before sending directions to car. \nBetter integration with Tesla Solar and where and how flow of power is used. Charge car for free instead of selling back to power company for half what you would pay otherwise. \nMedia and Software Upgrade items missing from latest release. \nMore software upgrade for purchase from app. \nAbility to make Tesla store purchases form app directly. \n  \n\nPROS\n———\nDoes the basics for your Tesla. \nCan control things most things non electric cars can’t, let alone many EV can’t. \nAdjusting heat and climate control is amazing on bad days.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5601048726","version":"3.10.3","date":"2020-03-01T09:51:29.000Z","authorName":"Arose8284","rating":4,"title":"Great App but has some room for improvements","body":"Support for the Apple Watch would be great and have complications to access features more easily. It was also be very useful to have remote access to sentry mode via hotspot or WiFi and get notifications when sentry mode is triggered.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5586016170","version":"3.10.3","date":"2020-02-27T05:35:29.000Z","authorName":"eskimo_dev","rating":4,"title":"Please support dark mode on the Today Widget","body":"iOS 13 has been out for a long time now, you should really be supporting dark mode on your today widget. The Tesla widget is such an eyesore being the only one that doesn't support dark mode. \n\nOtherwise the app is great. Does what it's supposed to do.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5558102456","version":"3.10.3","date":"2020-02-20T20:52:16.000Z","authorName":"lucy lo 1009","rating":1,"title":"Server error 3/4 times I TRY to use the app","body":"I cannot tell you how many error messages I get on this app.\n\nWhen I try to warm up my car, when I try to unlock my car when my key is in the house, you name it, it flashes the “server error” message.\n\nUnacceptable for the amount of money I’ve spent on this car!  Please FIX!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5550315948","version":"3.10.3","date":"2020-02-19T02:07:20.000Z","authorName":"I can't hurry","rating":5,"title":"I want a Tesla","body":"Yo Elon got some spare Teslas that I can have","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5544590464","version":"3.10.3","date":"2020-02-17T16:59:47.000Z","authorName":"Rutrow","rating":4,"title":"Configurable?!?","body":"I wish Tesla would allow users to arrange buttons to our individual preferences.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5541230567","version":"3.10.3","date":"2020-02-17T00:22:23.000Z","authorName":"Simps995","rating":4,"title":"Where’s the iPad version?","body":"???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5535876350","version":"3.10.3","date":"2020-02-15T18:37:08.000Z","authorName":"DaleLSF","rating":5,"title":"Tesla Model 3 Dual Motor","body":"Tesla’s app for iPhone goes way beyond what you will experience from any other car manufacturer as of February 15, 2020. Ford does offer some of the same features when you own the Focus Electric or their CMax or Fusion PHEV’s and I know that other manufacturers are quickly catching up to Tesla, but every month Teslas get better and better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5523256373","version":"3.10.3","date":"2020-02-12T23:05:33.000Z","authorName":"PJ Camacho","rating":4,"title":"Missing Apple Watch support","body":"The app would be so much better if Tesla offered Apple Watch support. Just think of those times when we leave the phone in the car, it dies, or the screen breaks. It’s not a deal-breaker, but it is about improving the ownership experience.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5514714858","version":"3.10.3","date":"2020-02-11T00:22:47.000Z","authorName":"Adjie203","rating":5,"title":"App works well","body":"I like the app, very responsive and capable. Like the constant updates that keeps up with the features that the Tesla gets.\n\nOnly complaint is sometimes it takes a bit for the car to detect my proximity. Also might be a good idea to have an option for sentry mode to disable when I’m nearby.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5503651833","version":"3.10.3","date":"2020-02-08T11:43:06.000Z","authorName":"dz1drw","rating":5,"title":"Great app, needs one more thing.....","body":"The app is very well constructed, payed out and, once connected to your car, controls virtually everything you need, except the ability to remotely set the departure time...  the departure setting works great but it’s only accessible directly from your car, being able to set that remotely would be great for people with changing schedules.  Keep up the great work Tesla!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5503301108","version":"3.10.3","date":"2020-02-08T10:05:42.000Z","authorName":"Subvertio","rating":1,"title":"Appointment is stuck and can’t be removed","body":"I click the change or cancel appointment and there is no place to change or cancel an old appointment that was scheduled. I deleted app then reinstalled it and same issue. It’s impossible calling service center as they never pickup and rely on the randomly working app for owners to Schedule appointments. Not really sure why everyone gets to to beta test app. Totally inconvenient. Tesla needs a legit beta testing team and process. Now I have to go to service center and screw up their day coming at an inconvenient time. It will require me to go back again just to schedule a service double wasting my time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5502100509","version":"3.10.3","date":"2020-02-08T03:59:37.000Z","authorName":"MuscleTeddy","rating":3,"title":"4 starts for not having Apple Watch support","body":"Love my car, please add Apple Watch support for the basic functionality: battery level, lock/unlock, a/c controls.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"},{"id":"5496530448","version":"3.10.3","date":"2020-02-06T19:27:41.000Z","authorName":"notnami","rating":4,"title":"Good, but","body":"A great app for the best electric car. \n\nOne major request: please add the ability to set options for scheduled charging or scheduled departure from the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"582007913","appName":"Tesla"}]