[{"id":"7640972368","version":"1.1.14","date":"2021-08-01T01:56:36.000Z","authorName":"OO7LLL","rating":1,"title":"Worst app","body":"I keep having to delete and reinstall","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7640795702","version":"1.1.14","date":"2021-08-01T00:42:42.000Z","authorName":"seevladimir","rating":1,"title":"Lexus quality has gone down significantly","body":"Everyone is talking about it. I mean cmon I just renewed my subscription and paid $170 and the car finder has not been working for weeks l. This is the only feature I really need. Should’t take weeks to fix, its 2021!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7640257997","version":"1.1.14","date":"2021-07-31T20:31:23.000Z","authorName":"Rummy-O Queen","rating":3,"title":"Location not showing","body":"I can no longer see the location of my car. This was the main reason I got the app. Hope it is just a bug with the latest update and will be fixed soon!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7640109063","version":"1.1.14","date":"2021-07-31T19:27:36.000Z","authorName":"Novice Language Learner","rating":1,"title":"Disappointed","body":"Dealership downloaded app when purchased Lexus. Worked ok for 3-4 days and then wouldn’t let me sign in-do anything. Deleted and downloaded app again-worked ok and then same problem. I’ve deleted and downloaded app 4 times and still having problems. Called customer service -was on hold long time-they took all my info and transferred me 3x’s to different departments but no one could help. Said would call back but never did. Called a second time few days later-waited on hold-while being transferred was disconnected and even though had my # never called back. Useless customer service and app not much better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7639467658","version":"1.1.14","date":"2021-07-31T15:05:18.000Z","authorName":"BiankhaFrancesca","rating":1,"title":"HEY WHAT HAVE YOU DONE TO THE GPS VEHICLE LOCATOR IN THE APP???","body":"STUPID LEXUS HAS ERASED THE VEHICLE GPS LOCATION OF THE VEHICLE! THIS IS ONE TOP REASON WHY WE BOUGHT A LEXUS FOR PEACE OF MIND SEEING WHERE THE VEHICLE IS CURRENTLY LOCATED BY THE GPS ON THE APP!!!   LEXUS! PUT IT BACK!!!!!!!!!!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7638376483","version":"1.1.14","date":"2021-07-31T08:50:40.000Z","authorName":"Time for a new brand","rating":1,"title":"App not updating","body":"The app is not updating in the App Store. I spent quite some time on the phone with Lexus technical support after the app would not work. Come to find out, the current version of the app is not showing up in the App Store. Spending $80+ for a subscription to a non-functioning app is quite aggravating. I bet Mercedes, BMW, or Audi doesn’t have this problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7638056143","version":"1.1.14","date":"2021-07-31T06:43:46.000Z","authorName":"Beth1144","rating":1,"title":"Worse app ever","body":"An amazing car, an amazing dealership, and the crappiest app I’ve ever seen.  Still doesn’t work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7637168751","version":"1.1.14","date":"2021-07-31T00:39:41.000Z","authorName":"SpartyOn123","rating":1,"title":"Can’t Log In","body":"Tells me my e-mail doesn’t have an account when I try to log in and then when I go to register it says that same e-mail is already in use…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7636097369","version":"1.1.14","date":"2021-07-30T17:04:40.000Z","authorName":"Riv14","rating":1,"title":"Last location of vehicle","body":"I was using this app because of the last vehicle location feature due to the fact that my son uses my vehicle and all of a sudden it’s no longer there. Called customer service and of course no one knows anything being put on hold to get the answers I was told something happened to it in the last download and no ETA at the moment. Like seriously why do I even buy this. GET YOUR TECH TEAM TO PUT IT BACK….","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7633767080","version":"1.1.14","date":"2021-07-30T03:16:09.000Z","authorName":"fjfufhfufjj","rating":3,"title":"Last Parked Location function","body":"What happened to this function? Why is it gone?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7631909278","version":"1.1.14","date":"2021-07-29T16:00:32.000Z","authorName":"TMK1956","rating":1,"title":"No vehicle finder on IOS","body":"Just upgraded to an Apple from Android.  The version does not have the vehicle finder functionality.  Went to dealer and they can’t help either.  I’ll be calling to get a full refund of my remote service subscription.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7629841333","version":"1.1.14","date":"2021-07-29T03:50:48.000Z","authorName":"Unsatisfied :-(","rating":3,"title":"Car finder ??","body":"Did you guys removed the car finder feature?? That was the reason I purchased the app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7629806017","version":"1.1.14","date":"2021-07-29T03:36:59.000Z","authorName":"Jekarr","rating":1,"title":"Garbage","body":"After latest update I don’t have car locator in my app … which imbecile app developer removed it ? What do I pay money for every year? App failing to start/open/clause my car half of the time. Useless app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7629762367","version":"1.1.14","date":"2021-07-29T03:19:53.000Z","authorName":"Mizero24","rating":3,"title":"Love Lexus but please listen to customers","body":"This is a great app to start my car remotely and get notifications about my car but it needs more! This app has been around for a while and it still lacks the ability to control the climate settings in the car. Other competitors already have that functionality so Lexus needs to catch up! I’ve read reviews of other customers wanting more from this app. Lexus please make it happen!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7627410386","version":"1.1.14","date":"2021-07-28T12:39:05.000Z","authorName":"tyobro","rating":2,"title":"Terrible!","body":"App consistently has to be removed and reinstalled for some reason.  Each day, I can access the app just fine.  The next day, it takes me to the login or register screen and won’t let me do either!  So, I have to delete the app and reinstall it.  The Enform app doesn’t seem to be able to link to this app either.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7623859572","version":"1.1.14","date":"2021-07-27T13:39:11.000Z","authorName":"trucj judyc","rating":1,"title":"Apple Watch crashes app- useless!","body":"Apps has a huge flaw. If you try to start the car with your Apple Watch an unknown error occurs. Then going to the phone the app gets stuck at the login screen and shows no errors. You need to kill the app to use it at all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7621266488","version":"1.1.14","date":"2021-07-26T20:15:45.000Z","authorName":"Lillybloomer14","rating":2,"title":"So frustrating!","body":"I have a 21 NX and was encouraged by my salesperson to download this app. I have had to delete and download it at least 10 times because it doesn’t respond to signing in. Absolutely nothing happens. So, I delete it and reload it again and it works until the next day. Then it doesn’t respond again and I have to do the same thing all over again. Totally useless and undependable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7621060725","version":"1.1.14","date":"2021-07-26T18:54:48.000Z","authorName":"qh dave","rating":4,"title":"Vehicle location no longer available","body":"The vehicle location feature was great… where did it go?\nOther than that I find the app very useful.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7620850288","version":"1.1.14","date":"2021-07-26T17:34:36.000Z","authorName":"Lcorbitt","rating":1,"title":"What happened??","body":"The only feature I use on the app is gone. Where did the Last Parked Location go?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7620308480","version":"1.1.14","date":"2021-07-26T14:32:27.000Z","authorName":"mwarren427","rating":1,"title":"Lexus App","body":"For a company that gets it right with their cars, this app is piss poor. I need to delete and reload it daily or else you can’t get in. Signals to car are too slow on the occasion that they work at all. Disappointing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7617803019","version":"1.1.14","date":"2021-07-25T22:07:07.000Z","authorName":"I slogan fake a","rating":1,"title":"Doesn’t work","body":"Paid for this 3 weeks ago. Still no access granted or response. Absolute waste of money","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7616774901","version":"1.1.14","date":"2021-07-25T15:16:32.000Z","authorName":"mitchdog1","rating":2,"title":"Extremely disappointing!","body":"Constantly signing me out of the app!! WHY!!!!! Afterwards the app won’t let me sign back in. I’ll hit the sign in tab and the screen flashes and goes right back to the sign in screen. It is BEYOND FRUSTRATING! The only way I can sign back in is to completely delete the app and then sign in. I really enjoy my Lexus vehicles but your apps are HORRIBLE! Please take the time and actually consider what your customers are saying about your apps and actually address the issues. You may want to consider another developer for them. Definitely will not be renewing my subscription as long as your apps are so mediocre at best.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7614696899","version":"1.1.14","date":"2021-07-25T02:15:05.000Z","authorName":"Lswaggard","rating":4,"title":"Helpful","body":"In most instances this app is helpful to me as I’m new to the push button start and often forget to lock my doors. The app has been a helpful reminder. I can’t help but notice that the feature of seeing where my car was last parked is now missing after the update? Updates kind of scare me if we are taking away features and not enhancing others. I know that people work hard on the app and for that I’m appreciative. I just want to know what happened to that map feature where I can locate my car?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7613532952","version":"1.1.14","date":"2021-07-24T17:37:40.000Z","authorName":"rx 450hl","rating":4,"title":"How do I initiate the vehicle finder?","body":"I don’t see  last parked location after I update the Lexus app????","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7613225569","version":"1.1.14","date":"2021-07-24T15:48:13.000Z","authorName":"My NX","rating":2,"title":"Terrible","body":"The app always freeze , at this point I keep pressing sign in and it doesn’t even go anywhere . Face ID ? Doesn’t open","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7608533709","version":"1.1.14","date":"2021-07-23T10:50:25.000Z","authorName":"Hassan Charania","rating":1,"title":"Remote location is gone","body":"Dude cmon , now the main feature is gone . A compensation is necessary at this point!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7607505853","version":"1.1.14","date":"2021-07-23T03:49:50.000Z","authorName":"acfrewtgyfdsefh","rating":1,"title":"Unusable App","body":"This app is horrible!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7607011395","version":"1.1.14","date":"2021-07-23T00:30:39.000Z","authorName":"rainingbluess","rating":1,"title":"Car location","body":"The location was working fine last update. However ever since I updated the app the car location is gone. Please fix this issue. I paid for the whole year mostly for the location. Otherwise please issue me the refund as I did NOT get the service I paid for","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7606115253","version":"1.1.14","date":"2021-07-22T17:59:04.000Z","authorName":"Olderthandirtgeek","rating":1,"title":"Broken","body":"Latest update has broken the app. Can’t even sign in. Expected better from Lexus. Disgusted right now.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7603680391","version":"1.1.14","date":"2021-07-22T03:01:53.000Z","authorName":"Amatek74","rating":2,"title":"Isn’t as good as I thought","body":"First of all in order to get remote start You have to get other package (safety service additional $8/month) So Enform remote start $8/month and $8/month for Safety Service total $16/month. Functionality seems to be pretty slow to lock or unlock the doors. Sometimes it’s really tough to log-in","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7601718249","version":"1.1.14","date":"2021-07-21T13:58:13.000Z","authorName":"Super Snarfer","rating":3,"title":"A Question","body":"Here’s a question for the app developers: Why do I get a notification in the app that states, “ 2021 RX has multiple vehicle alerts, please check app for more details” when I’m already in the app? Where exactly in the app should I be checking for more details??? Basically, you’re telling me to check in a place I’m already at but I’ll only find the answer if I do a thorough search of the entire app, if such an answer really exists. I’m not a real big fan of circular reasoning like this, Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7598922431","version":"1.1.14","date":"2021-07-20T19:18:08.000Z","authorName":"HerroKitty","rating":2,"title":"Thank god I love my Lexus","body":"This app is NOT up to par of Lexus standards. I paid 80.00 to keep deleting the app just to reinstall to work…unacceptable LEXUS GET YOUR BUT IN GEAR","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7598230366","version":"1.1.14","date":"2021-07-20T15:04:29.000Z","authorName":"Freedom First Baby","rating":2,"title":"Where is car location?","body":"Very buggy app for $160/year. Noticed today the car location map is gone. Could the developers please explain what is going on?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7597691895","version":"1.1.14","date":"2021-07-20T12:14:36.000Z","authorName":"Bombin1","rating":1,"title":"Issue","body":"The last park card is missing and is not hidden, also the keep me sign in is always check, how to disable it?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7595135399","version":"1.1.14","date":"2021-07-19T18:23:39.000Z","authorName":"USN10","rating":1,"title":"Horrible","body":"Update actually removed features that I paid for! Fix this!! Horrible app. Does not work half the time and features that are included in the subscription just get removed without notice no explanation and get told…. There is currently no timeframe for a fix!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7595102116","version":"1.1.14","date":"2021-07-19T18:10:25.000Z","authorName":"Rene' iTouch","rating":3,"title":"Vehicle locator","body":"Just notice the other the day that the map showing the cars location (although not pinpointed) is no longer there!!!  Why???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7593325055","version":"1.1.14","date":"2021-07-19T07:41:04.000Z","authorName":"feloran","rating":1,"title":"Tired of this","body":"Everyday a new problem!\nToday I can’t see my cars location! Still can’t after reinstalling the app too !\nPlease figure it out or just don’t offer the app !!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7592548292","version":"1.1.14","date":"2021-07-19T02:19:35.000Z","authorName":"JayFab23","rating":1,"title":"Latest update removes location assist. Why?","body":"App was fine and used it often. Then while on vacation I needed to find where the valet put my car so I could fetch something. Wouldn’t you know it, the app updated itself over Wi-Fi. Says for app improvements and bug fixes?  No. They removed the location assistance map. They realize with 3G going away and their not updating the chips in the 2012-2018 cars, that sneakily removing the function from the app may stop some people asking questions once the service is shut down. Just like when they force updated the car OS and removed the ability to zoom into the weather map. Who did that really hurt to keep that function in? Attempts to contact Lexus runs you through loops of circular contacts that get you nowhere. Maybe if enough people make a big enough noise, they will then listen. If you are unaware, when 3G goes away, the cars that use 3G will lose most of their safety functions which we paid for. Like SOS, location assist, anything this app does like check if your car was broken into or your trunk was opened. The ability to remote start the car on a hot day. All gone. The chip is in a small computer deep in the dash that they don’t want to replace. It could be but they just figured they would leave you to the big surprise one day. Audi and BMW took care of their customers by upgrading their chips to 4G. Are we not good enough? And yes, many 4 year old 2018 cars will get the shaft as well. Expect your resale value to drop once people get wind that the ability to call or be called by SOS if in an accident doesn’t work. Way to save those pennies Lexus!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7591540496","version":"1.1.14","date":"2021-07-18T18:53:28.000Z","authorName":"dpatel917","rating":2,"title":"Last parked location missing??","body":"Where did the “last parked location” go? This needs to be added back ASAP. I rely on this heavily.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7591402040","version":"1.1.14","date":"2021-07-18T17:59:04.000Z","authorName":"LS But","rating":4,"title":"Vehicle Finder","body":"Why can’t I locate my Lexus on this app? Everything else seems to work fine on the app except the vehicle’s location. Was it removed because I recall using it to locate my vehicle a month ago. Thanks! Overall decent app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7585064971","version":"1.1.14","date":"2021-07-17T01:45:04.000Z","authorName":"Birdwatcher44","rating":2,"title":"Overpriced, underwhelming","body":"For $85 a year after taxes this app should do it more then regular key fobs. I know what you’re saying, regular key fobs can’t schedule appointments for service etc. but I don’t need my $85 app to schedule my appointments when I have the app on my $1100 phone that also can schedule service appointments. This app on more than one occasion has told me that it was unable to process my request while trying to start my vehicle only to go outside and find my car was running at other times it didn’t process my request I never started the car. For $85 I should be able to use the app to roll down and up my windows as well as open and close my sunroof some key fobs do that already for free. So if we’re going to charge a premium price because it’s a luxury brand then give your customers something to smile about. I would like to be able to say yeah cost me $85 a year but I can do all this with my app. hopefully someone will read this and say you know this customer has a point instead of reading it and saying yeah right good luck with that. Well I know this looks long but it’s a quick read and I hope someone reads it.  I’m two years in and it’s a waste of money.  thank you","voteCount":3,"voteSum":3,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7584569150","version":"1.1.14","date":"2021-07-16T22:20:43.000Z","authorName":"Geezer 6","rating":1,"title":"Last parked location missing","body":"Current update killed it. Very disappointing. Have in a trouble ticket but haven’t heard back 7/16/21.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7584226672","version":"1.1.14","date":"2021-07-16T19:57:04.000Z","authorName":"tommmhowww","rating":1,"title":"iOS 12.5.4","body":"My iPhone has iOS 12.5.4.  App says iOS 12 or above is required but when I go to install the app it says iOS 13 or above is required.  I have no working app now for my Lexus.  Not good.  Needs to fixed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7580215379","version":"1.1.14","date":"2021-07-15T18:09:25.000Z","authorName":"Jemhiram","rating":1,"title":"Version 1.1.14","body":"New update works fine on an iPad, but not on an iPhoneX. Someone needs to do better testing I think","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7578449117","version":"1.1.14","date":"2021-07-15T07:52:27.000Z","authorName":"Bruce Wayne 317","rating":1,"title":"Below expectations!","body":"This app is one of the worst apps I have ever downloaded, not what I expected from a luxury car brand like Lexus! Smh","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7577275580","version":"1.1.14","date":"2021-07-15T00:06:50.000Z","authorName":"goncken","rating":1,"title":"App now worthless!","body":"Since app recent update July 2021, the app will not work. \nCannot sign in and cannot reregister!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7573474438","version":"1.1.14","date":"2021-07-14T00:16:46.000Z","authorName":"red33k","rating":1,"title":"What happened to last parked location","body":"The last parked location is missing from the last update","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7572341739","version":"1.1.14","date":"2021-07-13T16:34:54.000Z","authorName":"Adiwbdoebe","rating":1,"title":"Quality of app doesn’t match quality of the car","body":"Both my husband and I have spent all day trying to save our car to our account and neither of us are able to save the VIN. \nThe app developers need to make performance updates to this app it shouldn’t be this difficult to sign up with the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7570191405","version":"1.1.13","date":"2021-07-13T03:13:56.000Z","authorName":"LexusRX350F","rating":1,"title":"Buy a BMW instead","body":"What you get for free with BMW’s app Lexus wants to charge you $80 PER FUNCTION. I can start, stop, lock, unlock, locate, update, and sound the horn with the MyBMW app for free. You want to remote start your new Lexus? That’s be $80/year. You want to lock/unlock your new Lexus? Another $80/year. You want to update your enfotainment remotely? Oh, you can’t. Not even for $80/year. Come on, Lexus. Get with the real world and how people expect and interact with their cars and technology.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7568990633","version":"1.1.13","date":"2021-07-12T18:52:23.000Z","authorName":"MUGGLI1","rating":1,"title":"UNUSABLE-DOES BASICALLY NOTHING","body":"I keep trying to login, after it let me in few times-I bought a IS 300 EXACTLY 2YO and this service seems useless and it’s incredibly confusing. Now it’s not letting me log on. Not that one can do much, since it looks like it will not connect with iPhone 11 PROMAX-Most cars automatically connect with iPhones, allowing one to use Map functionality of iPhone-$80 per year to connect your iPhone seems petty, if it’s even possible.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7568617436","version":"1.1.13","date":"2021-07-12T16:34:38.000Z","authorName":"SMC 82","rating":1,"title":"Forced app update - app no longer works","body":"There is an app update requiring Apple OS 13 or newer. The latest software for the iPhone 6 is 12.5.4.  Opening the app, you are asked to update, and when the app realizing you need an older version, it offers it, but sends you into a circle where it keeps trying to give you the new app. I will need to cancel my subscription if it won’t work on my phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7566505535","version":"1.1.13","date":"2021-07-12T03:15:55.000Z","authorName":"Nancydvang","rating":1,"title":"App","body":"I download the app and I can’t even get pass the registration page. It keeps bringing me back","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7562562752","version":"1.1.13","date":"2021-07-11T01:34:23.000Z","authorName":"kkadish","rating":1,"title":"Does not work with iOS 12.5.4","body":"Does not work with iOS 12.5.4. Thanks Lexus...so disconnected with real customers...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7554931405","version":"1.1.13","date":"2021-07-08T23:58:24.000Z","authorName":"Jajanenoh","rating":1,"title":"You have to purchase subscription to work","body":"Just like what other reviewers, this is basically a useless app unless you’re subscribed to the premium ($80/yr). I was so into subscribing but you can’t do that with the app. You need to call. It’s troublesome to do.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7551265402","version":"1.1.13","date":"2021-07-08T00:50:28.000Z","authorName":"Yarek_USA","rating":1,"title":"Slow slow slow","body":"I have a 2021 Lexus RX350L and this app is slow when I say slow it's slow I am using DroneMobile and Viper apps on my other vehicle and it's 1-2 sec and any command done here is 20-30 seconds. Also sometimes you have to log out and log back in-app stop working. Hey Lexus your cars not cheap do something in 2021 people need some speed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7543660652","version":"1.1.13","date":"2021-07-06T00:51:02.000Z","authorName":"jane7284588584","rating":1,"title":"Worst app ever","body":"This is the most asinine app I’ve ever seen. It literally won’t even let you set up an account it keeps saying enter a valid first name. My fist name is valid you moron!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7536269550","version":"1.1.13","date":"2021-07-04T00:17:34.000Z","authorName":"Not a Fan 53","rating":1,"title":"New phone required","body":"This update locked me out of my current app. Whenever I try to log in it tells me an update is needed and when I try to download the app it says my phone is out dated leaving me to guess which Lexus update is right for me. The App Store is not user friendly and now I can’t use my app. Thanks for the update.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7532295216","version":"1.1.13","date":"2021-07-02T22:05:58.000Z","authorName":"wutdufuq","rating":1,"title":"Cant register","body":"Cant seem to register my new Lexus 300h. Keep getting “invalid header” error.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7531784083","version":"1.1.13","date":"2021-07-02T18:28:19.000Z","authorName":"Kkim310","rating":1,"title":"Useless","body":"Just like their financial app, I cannot sign in?!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7529087232","version":"1.1.13","date":"2021-07-02T02:17:21.000Z","authorName":"gohdtjvfn","rating":1,"title":"DONT PAY, SCAM!!!!!","body":"The width service I ever pay for, in fact, after 48 hours of waiting my service to be activated it’s never happened but they did charge me subscription right away….. horrible app and worth part when you will trying to get your money back you will need a lot of patience on phone with agent, cuz they will keep transferring from one person to another and another\n\nUpdate: after 2 weeks waiting for my refund it’s never appear on my account, when I call agent they told me that they do not do refund. Really? You charge me money, never provide a service I put money for and after 2 weeks another person telling me that they do not do refund???? This is crap!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7520464872","version":"1.1.13","date":"2021-06-29T20:30:36.000Z","authorName":"Bellstar142","rating":1,"title":"Service fees are nonsense","body":"The cost of this vehicle is high already.  But to then force the owners to pay additional fees to use a native app is ridiculous.  Cars come with remote start right on the key yet Lexus does not and they want us to pay to use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7516766129","version":"1.1.13","date":"2021-06-28T20:40:32.000Z","authorName":"robert fl500","rating":2,"title":"Doesn’t remote lock","body":"Used to be a good app. However the lock function no longer works despite deleting and reinstalling multiple times per dealer instructions. Too bad as the features are great when they work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7513047785","version":"1.1.13","date":"2021-06-27T20:28:16.000Z","authorName":"Scutmud","rating":2,"title":"Annoying Logins","body":"I setup the app for facial recognition.  It’s not an app I routinely use, so after a few weeks when I use it, it does the facial recognition successfully but brings me to the manual login page. \n\nWhat good is have the facial recognition if I still have to use my email and password?  Facial recognition is very secure and I should not have to also use my password.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7511929529","version":"1.1.13","date":"2021-06-27T13:50:57.000Z","authorName":"RETDCOD","rating":1,"title":"GARBAGE","body":"This is my second Lexus the app didn’t work on my first car why would it work with my new car!\nLexus really needs to do something with this app!\nReally frustrating!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7505474820","version":"1.1.13","date":"2021-06-25T19:37:24.000Z","authorName":"RFowner","rating":1,"title":"Do NOT download or buy services","body":"I cancelled this service within 24 hours because I live in a townhouse. Apparently having the vehicle parked close to me causes issues with connecting.\n\nThe second I pushed “cancel subscription” I lost all functions and features.\n\nI call the 1-800 number to get clarification of my money being returned (since it is $16 a month to have remote start) and was immediately told “no sir, we do not handle refunds.”\n\nI filed fraudulent transaction with this, and hoping to get my money back. Waste of time and money!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7505270028","version":"1.1.13","date":"2021-06-25T18:17:45.000Z","authorName":"jimmy 721","rating":5,"title":"Very cool","body":"IRecently purchased a 2016 Lexus RX 350 and was wondering if it had automatic start when I use the remote control I don’t haveThat option.But when I download this app for $17 a month not only can I start the car remotely from my phone I can also lock and unlockThe doors plus many other cool features like where my car is parked how many miles are on the odometer,How much gas is in the tanks how many miles I can drive to empty.SOS help is involved in an accident.Very cool app works great I definitely recommend it it’s worth the 17 a month","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7503229324","version":"1.1.13","date":"2021-06-25T06:05:36.000Z","authorName":"Darksaft","rating":1,"title":"Awful app","body":"Absolutely goofy app.  You cannot turn on the engine from the app and the also app cannot provide any updates. You guys making a lot of money and it’s absolutely awful to make this kinda app. You have to be better like your cars. But now I can’t tell same about the app. It’s make me angry.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7498979141","version":"1.1.13","date":"2021-06-24T01:41:59.000Z","authorName":"lexus uk","rating":2,"title":"Lexus Mobile app","body":"I have a iPhone 6 when I bought my Lexus. The app worked fine but now I can never get into my Lexus app because you keep updating the apps and I don’t need to get a new iPhone every time you update the app. The app should work regardless of what version of iPhone you have , what’s the point of an app if you have to have a iPhone 12 just to have a app for your car . Ridiculous!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7487898816","version":"1.1.13","date":"2021-06-21T01:46:54.000Z","authorName":"Marik0731","rating":1,"title":"Lexus app","body":"Can not connect my vehicle bc server not able to process this request ar this time! I used to have a bluelink with Hyundai and it worked all the way perfect! But this app now really looks down 👎🏻👎🏻👎🏻","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7482301223","version":"1.1.13","date":"2021-06-19T13:41:45.000Z","authorName":"Jimbo771313","rating":1,"title":"Waste","body":"Hey Lexus, do you see how dissatisfied your consumers are with this product? How do you go to work every day knowing your app is useless to most who down load it? There’s no excuse for your complacency. Do better or discontinue the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7479464728","version":"1.1.13","date":"2021-06-18T18:50:21.000Z","authorName":"Nickle307","rating":1,"title":"Very Disappointed on lack of IPhone 6 support","body":"I have an IPhone 6 with iOS 12.5.4 and the Lexus app was working until two weeks ago. I really liked the app until it stopped working. I tried to download a current Lexus app version (at least the last current version that works with my phone) and it doesn’t download. ALL MY OTHER APPS work with my iPhone 6. To use the Lexus app requires a new iPhone. So this has become a very expensive app. There was No advance notice. Given this app is not free, the rollout should have been better and provided more communication.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7472946500","version":"1.1.13","date":"2021-06-17T00:58:33.000Z","authorName":"gikimber","rating":1,"title":"This App is Terrible!!!","body":"I have owned my car for 18 months and I have NEVER been able to start my car remotely, and now it doesn’t even update my vehicle status anymore. I have the Enform subscription, and it makes no difference. For the amount of money we pay for a Lexus and for the app services, I think it is terribly substandard compared to other car companies. I’m terrified to consider that the emergency feature if I have a wreck and I’m unconscious in a ditch may not work either and I’ll die in my over priced car! Don’t get me wrong, I live my car, but I do not recommend paying for this service.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7472709691","version":"1.1.13","date":"2021-06-16T23:08:34.000Z","authorName":"RMS 1","rating":3,"title":"New Lexus app does not work on my phone","body":"I have a 2019 Lexus RX350. I have Iphone 6plus. My Lexus app stop working last week. The new app gives the message to update. My phone uses OS 12.5. The new app says you need OS 13.0. Do I have to buy a new phone!! The old app is gone. I went to my Lexus dealer and was told I need to buy a new phone. Help !!\n\nBOUGHT A NEW IPHONE 12 MAX PRO AND APP WORKS!  Sorry to say I had to buy a new phone to work the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7466662093","version":"1.1.13","date":"2021-06-15T08:44:13.000Z","authorName":"b[(^~^)]d","rating":3,"title":"Works like it use to.","body":"At the beginning of 2021 the app wouldn't allow me to log in.  The old app would get stuck in an endless loop of log in, user not found, try password/username recovery>not found, and repeat.  After update everything worked again.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7462388883","version":"1.1.13","date":"2021-06-14T04:08:23.000Z","authorName":"David Hawii","rating":1,"title":"Extremely poor design apps","body":"For a company that produces some of the most reliable autos it is a shame they do not bring qualified app designers.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7460962996","version":"1.1.13","date":"2021-06-13T18:06:44.000Z","authorName":"Tisb3","rating":3,"title":"Can’t get WAZE to run","body":"I have WAZE and Lexus Apps installed.  \n\nThe iPhone is paired with the 2021 UX 250h.\n\nWhen I tell the Lexus App about WAZE, it says it is installed.\n\nOnce I select the Nav window, the car asks to plug in the iPhone.  Of course as soon as I do that, it launches Apple Car Play and the Bluetooth connection to the phone is lost.\n\nMy impression was that the would connect Bluetooth to the phone and work like that.  I can always use WAZE, Apple Maps or Google Maps to navigate in CarPlay, but that doesn’t do the split screen stuff.   \n\nWhat am I missing?\n\nIPhone 11 Pro - iOS 14.6","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7453765069","version":"1.1.13","date":"2021-06-11T21:38:19.000Z","authorName":"LexusBob","rating":2,"title":"Review","body":"What idiot makes a user do an update when they are hunting for the car in a strange place that may not be safe.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7453506085","version":"1.1.13","date":"2021-06-11T19:49:42.000Z","authorName":"edward cogyolk","rating":2,"title":"Lexus app","body":"This app won’t work for me anymore since Apple won’t upgrade certain phones to iOS 13, and so Lexus won’t allow older versions of the app to be used on certain phones either, so your stuck.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7448430933","version":"1.1.13","date":"2021-06-10T12:07:23.000Z","authorName":"DallasNative73","rating":1,"title":"Horrible","body":"The app randomly logs you out the new face login is a plus however I have not been able to use this app in months and still being charged. Had to enter my information in again once done still won’t recognize my VIN (yes I’m scanning it not typing it in). For the price this app should be more user friendly!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7445897609","version":"1.1.13","date":"2021-06-09T18:58:44.000Z","authorName":"Bardonia","rating":1,"title":"This App does not function on iphone 6 plus","body":"I am running 12.5.3 on my iPhone 6 Plus\n\nThe Lexus app does not work on my iPhone and I am unable to contact my 2018 ES 350 to view its status, start the engine, etc.\n\nOn trying to open the app I get a message that says \n\n“New Version Available\n\nThere is a new app version available requiring use of iOS 12 and watch OS 5.0 or later. Please update to the latest version to continue.”\n\nOn clicking ‘Update Now’ I get to the App Store where I am told that the app requires iOS 13.0 or later.\n\nClicking on the update button the following message appears ....\n\n“Download an older version of this app?\n\nThe current version requires iOS 13.0 or later, but you can download the last compatible version.”\n\nOn clicking the download button one gets a repeat of the above message and one is locked into a loop from which there is no escape.\n\nI have tried deleting the app from my iPhone and restoring it from the App Store but the same problem simply returns. \n\nI am now left with no other option but to have my subscription cancelled until you provide an app than can continue to run on an iPhone 6 Plus with its software fully up to date.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7443199454","version":"1.1.13","date":"2021-06-09T02:29:17.000Z","authorName":"jfbhiit","rating":1,"title":"Now completely broken","body":"The app says I need to download a new version but since my phone is older, iPhone 6, I can’t use the iOS 13 version. It says I can download the last compatible version but it won’t do that for me. I assume since this was working last week I have the latest version but the app won’t open. I should be able to remote start my 2020 and do other things but since this app is completely FUBAR it’s a no go. 100k in Lexus brand in my garage and I can’t even remote start either vehicle. Horrible.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7443184715","version":"1.1.13","date":"2021-06-09T02:23:18.000Z","authorName":"zzzzzzxx zxxx","rating":1,"title":"Cannot down version for iPhone 6 and iOS 12","body":"The Lexus app update requires iOS 13 which is not available on iPhone 6. It pop up an option to download an older version , but on clicking download it just keeps showing the same message again. Cancel cannot return to the current version without updated","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7441507015","version":"1.1.13","date":"2021-06-08T15:30:25.000Z","authorName":"2018 owner","rating":5,"title":"Can’t use app anymore","body":"My iPhone does not support iOS 13 do I can no longer us the Lexus app with my 2018 RX. Why can’t I continue to use an older version of the app?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7438169222","version":"1.1.13","date":"2021-06-07T18:17:42.000Z","authorName":"EsElAche","rating":1,"title":"Completely Unreliable","body":"Setup is difficult at best. Once successful, operation is slow...and then it eventually stops working. That’s when the real problems begin. Resetting requires assistance from Lexus. And customer service seems to be just as puzzled as the customer lol. Is there an alternate app from another vendor? This was a complete waste of money!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7423384198","version":"1.1.13","date":"2021-06-03T23:32:39.000Z","authorName":"Blood locust","rating":1,"title":"Cannot log in","body":"What a pain! Keep going in circles to sign in and get started. Keeps taking me back to the screen to log in, then I need to register and then tells me I’m registered. Back to log in and repeat.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7418208714","version":"1.1.13","date":"2021-06-02T15:31:33.000Z","authorName":"Flaire10","rating":1,"title":"Toyota Excellence?","body":"This app is so bad it is hard to believe the cars are still good. Doesn’t wort most of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7406480209","version":"1.1.12","date":"2021-05-30T15:10:28.000Z","authorName":"DOCMAN1303","rating":4,"title":"Siri","body":"Why Siri can’t do anything? Start my car, lock or unlock?\nAmazon’s Alexa can at least start engine… Siri can’t….\nWhat’s the point?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7402813192","version":"1.1.12","date":"2021-05-29T16:08:59.000Z","authorName":"grumblemo","rating":1,"title":"Can’t save changes","body":"I can set up the car and press save changes. After waiting a few seconds I am back to to Dave screen. Going back takes me to a previous setup screen. Earlier I had it auto fill my contact info and was told my name was invalid. Shows a lack of care and quality.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7402567614","version":"1.1.12","date":"2021-05-29T14:55:32.000Z","authorName":"Abhro M.","rating":3,"title":"Lots of improvement needed","body":"Works:\n1. The remote start/stop, lock/unlock do function\n3. Last parked location\n\nUseless/Malfunctioned/No good/ To add or improve:\n1. Vehicle health report (off by 5k miles) and other stats looked cooked up.\n2. Notifications are en example how to design bad features. It doesn’t give you any meta-data. so all notifications are similar except for timestamp. What am i supposed to do with that?\n3. Remote access, start/stop works but takes way too long to be useful. Also, the engine shuts off when the door is open. What’s the point? \n4. climate control through app missing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7399930691","version":"1.1.12","date":"2021-05-28T23:00:03.000Z","authorName":"Kwisin1","rating":5,"title":"TAKES ME BACK TO SIGN ON PAGE!!","body":"Edit on 5/28:  I finally got into the app and my vin number is correct. This was last Thursday morning. Now I can enjoy all the features of my new Lexus. Also, I got a call from Lexus following up on my app issue and wanted to be sure all was good. Thank you. \n\nPleeeease fix this problem with this app. I registered with the dealership last Saturday (4days ago) and app still does not work. I called Lexus customer service and after bounced around to a few staff (very nice people by the way) someone said the app is down and it’s a known issue. I can’t even sign-on through google or explorer browser. I actually received a Welcome to Lexus email but with in the incorrect VIN number. Not what I expected from Lexus and my first experience. Once this issue is fixed, will we receive emails?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7391760224","version":"1.1.12","date":"2021-05-26T19:51:25.000Z","authorName":"mgmcd1","rating":1,"title":"Getting worse","body":"I just sprang for the subscription so I could get remote features, and ALL of the remote features are gone from the app. The only thing it tells you is that you have a notification, but there is no way to check what that notification is. The rest of the app is advertising. There is no capability in the app. Last Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7390941184","version":"1.1.12","date":"2021-05-26T15:15:07.000Z","authorName":"Jayjay023","rating":4,"title":"Waste of time","body":"Literally will not go past the login keeps returning to the same thing. Super annoying!!!! Okay update bought my car may 25, 2021 app was not letting me do squat I tried at least 50x then I gave it a go again 5/26 now it’s working and so far I really like it. Other than the fact it took me forever and the other Enform app is doing the same thing I like it. So I’m giving a 4 star instead of a 1","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7388166493","version":"1.1.12","date":"2021-05-25T21:56:04.000Z","authorName":"lolalex4444","rating":1,"title":"Doesn’t work!","body":"Can’t sign in on my iPhone 13. It just keeps going back to the sign in screen. Have tried deleting app and downloaded again three times now.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7387456454","version":"1.1.12","date":"2021-05-25T17:39:17.000Z","authorName":"Taymichelle94","rating":1,"title":"NOT WORKING","body":"What’s the point of having a new car if you can��t utilize all your features? This app keeps prompting me to sign in over and over after I already made an account. Fix this!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7387157330","version":"1.1.12","date":"2021-05-25T16:03:53.000Z","authorName":"Kontraburna","rating":1,"title":"Doesn’t work","body":"Won’t let you sign in, app does nothing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7381233954","version":"1.1.12","date":"2021-05-24T06:42:18.000Z","authorName":"vhangry!","rating":1,"title":"Not Working","body":"Won’t allow me to complete the full set up. After creating an account, it keeps bringing me back to the sign in page even after I tried signing in multiple times. Please fix so I can set up the app to connect with my new car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7381032924","version":"1.1.12","date":"2021-05-24T05:16:13.000Z","authorName":"Mouse503","rating":1,"title":"Won’t sign in","body":"Bought a new Lexus 2 days ago.  Signed up for the app, spoke with SOS to activate, I still can’t sign in.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7380211063","version":"1.1.12","date":"2021-05-23T23:46:18.000Z","authorName":"AmamdaChloe21","rating":1,"title":"Doesn’t work","body":"Downloaded the app then registered... the app routed me to log in. I log in and the routes me to register... this cycle keeps going. Basically I can’t even log in to use the app. Horrible first experience!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7379818033","version":"1.1.12","date":"2021-05-23T21:12:46.000Z","authorName":"Johnnyhowey","rating":1,"title":"Cannot log in","body":"I’m here at the dealership trying to go home with the car but the dealership wants to to connect the car to this app first. However authentication service and the SOS enrollment is not working at all. We wasted an hour at the dealership. This is not a good first experience for Lexus. \n\nThe car itself is great thou, the app is just here to make things worse.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7378490483","version":"1.1.12","date":"2021-05-23T14:16:38.000Z","authorName":"larkinesanders","rating":1,"title":"Can’t get past login","body":"I’ve been in a loop from the login page and can’t get past it. I’ve tried basic troubleshooting like closing the app, uninstalling and reinstalling, restarting my phone (iPhone 12 pro), and trying both my registered email and phone number to login. I hope it gets fixed soon! Would really like to utilize this app’s many features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7377820677","version":"1.1.12","date":"2021-05-23T10:50:39.000Z","authorName":"SKYELEENIE","rating":1,"title":"Terrible app!!!  Doesn’t work at all.","body":"I just bought my 2021 Lexus and was told by the sales guy to download the app then he gave me a number to call to activate it.  \n\nI have done everything and the app doesn’t even let me log in.  Once I do, it just acts like it will open but goes right back to the login screen. \n\nSo frustrating!  I had the Toyota app previously and had ZERO issues. I don’t know what the problem is.   You would think that when you pay the $$$ we do for the vehicle that a simple app should work. \n\nVERY DISAPPOINTED!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7370886051","version":"1.1.12","date":"2021-05-21T17:22:55.000Z","authorName":"mikebooms","rating":1,"title":"Won’t work","body":"App won’t allow me to setup/login keeps refreshing please fix!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7370135665","version":"1.1.12","date":"2021-05-21T13:47:29.000Z","authorName":"MAlexis2021","rating":1,"title":"Can’t use","body":"I downloaded the Lexus suite app and that is working. Now I’ve tried this app and I can’t login. It tells me to use same login as suite app, but sends me back to register. I try to register and it tells me email and number already have an account.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7366329589","version":"1.1.12","date":"2021-05-20T16:15:58.000Z","authorName":"Redhot47","rating":3,"title":"Destination navi capability","body":"Please add the popular (everywhere else) remote function for punching in a destination on the OEM phone app, which then sends the destination data directly to the car. This is a nearly universal ability of other OEMs and a rather shocking omission here. Thank you.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7328041178","version":"1.1.11","date":"2021-05-12T04:00:52.000Z","authorName":"melchen2905","rating":1,"title":"Don’t buy remote service","body":"The remote service doesn’t do what it advertises.\n45 seconds to lock\n45 seconds to unlock\nNo climate control regulation, you get the temperature you left with your last trip. \nCar only idles for 10 minutes and shots off.  You need to restart it again to do another 10. And it takes 1 minute to start it.\nWhen you walk to your car idling and open the door- the engine dies.\nUnsubscribe and call Lexus USA for a refund","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7307083763","version":"1.1.11","date":"2021-05-07T03:42:24.000Z","authorName":"bourbon_drunk","rating":1,"title":"Latest update","body":"The last update on the App 1.1.1 has made it not work at all. Will not start any more. Fix this Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7302619608","version":"1.1.11","date":"2021-05-05T22:21:00.000Z","authorName":"vibe4","rating":1,"title":"It’s disappointing to have Lexus waste my time in this way","body":"I have a 2012 CT 200. For iOS reasons, somewhere around 14, maps stopped working with Hands Free. I was curious what other options I had and found this app. As of this writing, my car is almost a decade old. But I do have a multimedia system that has been updated by satellite in the past. It is Bluetooth compatible. So I figured it was worth a shot.I put in my VIN number to register. The app asks if I’m sure I’m using the right VIN number. It cannot register me. I try again.  This time I scan the VIN number using the app. Again, it asks me to check the VIN number and tells me if I keep seeing this message to reach out contact Lexus. A very general call-to-action that the app in no way facilitates. (By say, providing a phone number.) So I googled contact Lexus. I find a number and begin the button pushing trying to get something close to “Help me with the app, please.” One of the prompts mentions Enform, so I select that. I get a woman who sounds like she’s having a bad day. It happens. I explain to her what’s going on. She asked for my VIN number. I open the app and read it to her. From that, she’s able to correctly identify my car, so it’s definitely the correct VIN number. I explain to her that I’m just trying to register the app so I can see what’s available. She explains to me that I will have to “enroll” so I can be told what services are available to my car, if any.  Why isn’t this something the app can do in far less time than I’ve spent on this whole process? Like, 10 seconds? Good question.This is beginning to feel like a huge waste of time, but I’m stubborn. This woman tells me she will have to transfer me to someone else who can enroll me, so that I can find out if this app is of any use to me at all. Why this woman who had my VIN number and knew what model/year of car I have couldn’t tell me herself, I don’t know. So she “transfers” me and the line, predictably enough from her tone,  goes dead. For a Kia owner, probably an average experience. From a Lexus perspective, one star seems like too much. But that’s my experience with an app. The end.\n\nEDIT: Just wanted to update that I got an e-Mail with a version of the same, meaningless response most frustrated folks have gotten here.The responses seem like the app itself. Unhelpful and thus an unnecessary waste of everyone’s time. \n\nLexus Social Team, you know we can see all these responses, right? It’s not flattering or validating to get a version of the same cut and paste you’re giving everybody else. Just ignoring the feedback, which for all practical purposes appears to be what’s happening, would be less insulting.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7300959123","version":"1.1.11","date":"2021-05-05T13:11:03.000Z","authorName":"SSLSPS","rating":1,"title":"Worst App ever","body":"When I downloaded it to register my car there was someone else’s car, name , address under my email and mobile number. It’s almost a week and no one seems to know how to fix it. It’s not even a Lexus. No one can explain why this is happening.  Beware if you Dow load this horrible app.\n\nTo the developers- I have contacted you several times and was told we are looking into it. I also contacted Lexus and they didn’t know how to help either. I have wasted too many hours on this. No one ever  called me back or contacted me. The last time I called I was nastily told -“when we are able to fix it we will call you”. Never happened.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7292076654","version":"1.1.11","date":"2021-05-03T07:16:25.000Z","authorName":"Sheazer1","rating":2,"title":"Good Functionality, but ignores privacy preferences","body":"I like the functionality of the app, but that comes with one big HOWEVER and it is the reason I cannot give a higher rating. \n\nWhen creating a new account, I attempted to simply create one with Apple ID. I do this for both ease of use and privacy purposes as the Apple ID function allows you to hide your email in favor of a proxy address. \n\nWhen you attempt to do this in the Lexus app, it refuses to allow you to proceed unless you allow them to see your actual email instead of the Apple proxy email. For this reason, I have to give it a low rating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7283059170","version":"1.1.11","date":"2021-05-01T01:39:52.000Z","authorName":"Jsiwuebx","rating":2,"title":"Expected more from Lexus","body":"This app has a lot of features but the log in is a pain. Every time I get on I can’t make it remember my password I can’t make it use Face ID. Logging in is so difficult to remember passwords and stuff I don’t even use the app much. Also everything takes super long to work after you click it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7281090426","version":"1.1.11","date":"2021-04-30T14:11:42.000Z","authorName":"stag97","rating":1,"title":"Total garbage of an app and infotainment system.","body":"For a $64k car I expected way better. App works about as well as the vehicle \"infotainment\" system, which is not very well at all. Clearly Toyota Motor Corp/Lexus didn't read the customer reviews on the first few versions of the app otherwise they might have made some improvements. So much potential for technology integration with mobile devices and improved vehicle interface experiences yet Toyota still continues to disappoint customers. It was sad to see that from 2010 to 2020 in almost a decade nothing significantly changed in the vehicle and now the app is another representation of the lack of attention to customer feedback.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7270781192","version":"1.1.11","date":"2021-04-27T18:40:00.000Z","authorName":"Arbenj","rating":5,"title":"Love this app","body":"Works flawlessly, great design, great features, absolutely love this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7262967223","version":"1.1.11","date":"2021-04-25T16:02:27.000Z","authorName":"AttuserNJ","rating":1,"title":"Same crippled functionality for over a decade!","body":"It’s shameful that functionality remains so crippled for an expensive so called Luxury brand. It’s 2021 not the 1980’s we should be able to control and activate AC/HEAT and other functions via the app. I’m sure the vehicles have this capability but you limit the app most likely for legal reasons, you are more concerned about legal issues then you are about functionality.  The subscription is overpriced for the poor functionality that it offers which is the main reason I won’t pay for this. Even low end non luxury brands like Kia offer this functionality as do most all other manufacturers, shame on you!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7237577548","version":"1.1.10","date":"2021-04-18T20:38:48.000Z","authorName":"shikhaaguptaa","rating":1,"title":"Awful","body":"Honestly, the app is so slow its really not even worth the download. In comparison to any other car app, this is extremely slow and disappointing. I have a freaking 2020 Lexus and the technology has advanced so thoroughly that it was almost shocking that they did not have any kind of accessibility in terms of unlocking the car, starting the car, and locking the car. There are literally no other features besides those ones. It’s only purpose is the LEXUS manual bc my dumb Lexus dealership did not provide me a paper book of the manual!!!!!! I am just upset with a capital D for Disappointed 👎🏽👎🏽👎🏽👎🏽","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7236528826","version":"1.1.10","date":"2021-04-18T14:37:16.000Z","authorName":"Earthsuit","rating":2,"title":"It works...sort of.","body":"Bought a 2020 Certified ES 350. Remote Services would not work. I’ve had the car back to the dealer twice. All the other information does show on the app but the remote start/lock/unlock still will not work. When I try any of these functions I receive the message “Request could not be completed. Contact dealer your dealer for assistance.”\nI’ve called the dealer(again) & their IT specialist told me he has contacted Lexus & will let me know what they will do.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7228649173","version":"1.1.10","date":"2021-04-16T14:08:26.000Z","authorName":"Lynilbit","rating":3,"title":"Somewhat functional","body":"The app is ok for updates on mileage, alerts, remote start. However the lock and unlock buttons do not work (yes... reloaded etc.). It tells you to tap and hold but when you do- Nothing. \nSo make sure everything is set before you leave your vehicle or else you’ll get alerts you can’t remote fix as advertised 😩.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7226656686","version":"1.1.10","date":"2021-04-16T00:16:17.000Z","authorName":"MI3382","rating":1,"title":"Non responsive","body":"Non responsive- app does not work. Unable to connect my ES350.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7226447222","version":"1.1.10","date":"2021-04-15T22:44:29.000Z","authorName":"Smp25304","rating":2,"title":"Login","body":"Shouldn’t have to keep logging in.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7223506682","version":"1.1.10","date":"2021-04-15T03:32:18.000Z","authorName":"Jo-ze","rating":1,"title":"Pathetic!","body":"How are you forcing me to update while I’m in an emergency?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7219614955","version":"1.1.10","date":"2021-04-14T02:07:33.000Z","authorName":"Kiddies 35737","rating":1,"title":"Servers still down","body":"I have been trying to connect my car but after inputting the vin it says.”system server error”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7218688520","version":"1.1.10","date":"2021-04-13T19:29:25.000Z","authorName":"Pepper T","rating":1,"title":"Non-functional app","body":"I locked myself out of the house but had an appointment to get to, so I tried using the remote start function to no avail. It keeps trying to connect but nothing happens. I have full service, so I know that’s not it. Very disappointing given the brand and reliability that comes with the name.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7218116456","version":"1.1.10","date":"2021-04-13T16:02:57.000Z","authorName":"VR Author","rating":1,"title":"Updates Always Lose Login Info","body":"The app has pretty good features, but these don’t matter if after every time you download an update the app loses your login information. And it is condescending to imply that this is for my security — my banking apps have no trouble preserving and accessing my credentials after their updates are installed!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7207170079","version":"1.1.10","date":"2021-04-10T18:14:32.000Z","authorName":"Sloppyeyes","rating":1,"title":"Useless","body":"Every time I sign in it will return to a slightly different page asking if I want to register or sign in. And around in circles it goes. It’s let me past the register/ sign in pages a whopping one time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7202515415","version":"1.1.10","date":"2021-04-09T15:23:32.000Z","authorName":"loverforever🌶🌶👌","rating":2,"title":"it's not what i thought","body":"I would like to say that it is the worst but I could not because some things work.  One of the things that do not work correctly is the location, right now I would like to see where I left the car parked and it only shows the location of two days ago, I think they should update that, suggest for the developers a track of the movements made in miles and  consumption and things like other competitors like Jaguar, a suggestion !!!  In general they should work more on the app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7200712825","version":"1.1.10","date":"2021-04-09T04:14:26.000Z","authorName":"dickson620","rating":1,"title":"Terrible User Experience","body":"Terrible user experience.  Any time I want to change any setting, it takes a long time to respond.  When I tried to add my wife thru the Family driver setting, I could not change any of the parameters.  When my wife tried to add the VIN to her phone, it just kept telling server error, after days of trying.  I can’t imagine this is the best Lexus can come up with.  You guys really need to do better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7198898307","version":"1.1.10","date":"2021-04-08T16:36:38.000Z","authorName":"njerseymo","rating":1,"title":"Mscheffler","body":"Have read reviews about remote services not working with the Lexus enforcement app. I too am having this problem. I even had a new DCM replaced and still not working. Am back to the service department again. Even with recent update still did not work. Extremely frustrating to have a car with all the technology capabilities and you cannot use them. Please fix this issue!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7180723336","version":"1.1.9","date":"2021-04-04T00:24:23.000Z","authorName":"gkisler","rating":1,"title":"A Spy App!","body":"This app spies on every second of you using the car, it knows where you are, how fast you were driving and it sends it to Lexus. \nBut if you want to use remote start feature you’ll have to accept the invasion of your privacy. 👎🏻","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7164288788","version":"1.1.9","date":"2021-03-31T00:34:12.000Z","authorName":"athynz","rating":1,"title":"Simply awful","body":"Just bought a used Lexus and decided to give this app a try. Registration did not take despite email and text verification of account. If I could give this app below a single star I’d do it. Stellar vehicles, useless app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7164212679","version":"1.1.9","date":"2021-03-31T00:05:36.000Z","authorName":"Cindy for Lina","rating":1,"title":"Login, login, login, login!","body":"I am writing this on behalf of my mother. Every few days I have to log back into this app. Now it doesn’t seem like a big deal but it is when your mom has no experience with apps and computers and she wakes you up at 6AM every so often to re-login. Please fix this! We’re seriously contemplating getting a separate car starter because the app is so bad!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7138733453","version":"1.1.9","date":"2021-03-24T11:07:06.000Z","authorName":"Gr8Dayne","rating":2,"title":"Works 2 of 5 times","body":"Constantly being disconnected and needing user login info. Will prompt to call Lexus when entered vin is scanned from vehicle barcode. This app is useless, better off using the key fob to start the vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7129994183","version":"1.1.9","date":"2021-03-22T02:52:18.000Z","authorName":"BarnyArnes","rating":1,"title":"Would be a good app if login not reset all the time","body":"Not a bad app in general but whenever I need to use it my login info is gone and I have to look it up. Not even my banking apps (which are secure) do this to me","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7125957833","version":"1.1.9","date":"2021-03-21T01:45:48.000Z","authorName":"Luxy the driver","rating":1,"title":"Never works","body":"I Try to connect my car to my phone and it always says that my account has a wrong wrong Vin# or Wrong City.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7111287398","version":"1.1.9","date":"2021-03-17T01:30:49.000Z","authorName":"Ceelo187","rating":3,"title":"Needs a widget","body":"This app works pretty well. Would definitely rate it 5 stars if it had a proper home screen widget.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7110819337","version":"1.1.9","date":"2021-03-16T22:11:44.000Z","authorName":"BarryGRey","rating":2,"title":"Old notifications unable to delete","body":"App is fine except that there’s no way to delete old notifications. I have about 60\nNotifications from 2 months ago and it’s sitting there unable to delete. Very poorly created app for a luxury automobile like Lexus. Insulting.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7109227621","version":"1.1.9","date":"2021-03-16T12:38:40.000Z","authorName":"bpabab","rating":2,"title":"So slow","body":"This is the worst remote start app I’ve ever had. It takes forever to start and it only goes for ten minutes x2, then it disables. The most frustrating part is how long it takes to connect to the car to start it. It’s slightly ridiculous.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7106287587","version":"1.1.9","date":"2021-03-15T16:53:42.000Z","authorName":"Not good for me.","rating":1,"title":"Red Apple","body":"Since I can’t download the update to my older iPhone what options do I have?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7102272619","version":"1.1.9","date":"2021-03-14T14:47:34.000Z","authorName":"Red Hawke","rating":2,"title":"Developers need to do a better job","body":"The developers need to do a better job of maintaining user’s data when the app updates.  AND stop logging me out of the app.  I have to jump through a few hoops to look my passwords up before I can use the app.  And this issue always seems to occur at the least convenient moment.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7099053666","version":"1.1.9","date":"2021-03-13T16:59:17.000Z","authorName":"Daesha :)","rating":1,"title":"App doesn’t work! Wrong VIN error","body":"Constantly getting the error that my information is incorrect once I put the vin in. So frustrating!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7089642251","version":"1.1.9","date":"2021-03-11T05:36:50.000Z","authorName":"BlondeAtlantis","rating":3,"title":"Gets the job done, but only just","body":"I’ll start by saying that I love what this app lets you do! It’s great to be able to start my car so it can warm up, make sure it’s locked, etc. However, it’s just incredibly slow to catch up if you haven’t opened it in the last 10 minutes, for example to make sure the doors are locked. Also, no matter how many times I select “keep me signed in” and “use Face ID,” it doesn’t work and I constantly have to resign in, including getting the code sent to my phone. This really chips away at the intended convenience. When I’m getting ready to head out somewhere, I have to consciously set aside about 2 minutes to log into the app, which is pretty much the opposite of what I want to be doing. Still, when it’s really cold, it’s nice to look forward to getting into a warm car. Maybe one day we’ll even be able to adjust the temperature from the app too!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7086894865","version":"1.1.9","date":"2021-03-10T12:09:55.000Z","authorName":"kjljkkk","rating":3,"title":"Remote start is a joke.","body":"When I needed the remote to work in the coldest of the year, it failed miserably. I had to go out and started it and come back in the house to wait for my car to warm up. Defeating the purpose of remote starting.  \nIf I don’t use my car for two days or more, again it won’t start I had to manually start it. \nThis is an ongoing problem.  I have uninstalled and reinstalled the app time and time again to no fixed.  The login is a pain too. Although I have it set to keep me logged in it continues to logged me out.  I think I am ready to go back to regular remote started control. No sense on paying for services I can’t use.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7072012423","version":"1.1.9","date":"2021-03-06T12:42:20.000Z","authorName":"theavv","rating":1,"title":"Not a good app","body":"It keeps asking me to sign in almost every day.  That means you have to put in email and password all over again. Not recommend this app.  No use!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7064941639","version":"1.1.9","date":"2021-03-04T16:43:02.000Z","authorName":"mNY2","rating":1,"title":"very unhappy remote status - start not reliable","body":"Very unhappy - remote status, parking location, remote start not reliable. I don’t know if it’s the app or the vehicle but my 2020 UX with remote start keeps not working - remote status and functions stop and the app can’t connect with the vehicle. I’ve taken the car to the dealer no solution other than to cold boot the vehicle by manually disconnecting the vehicle’s battery. Then it works again for weeks sometimes months but stops without warning. Vehicle is beautifully designed mechanically but the remote software is disappointing! And I don’t learn the remote functioning has stopped and app does not have current parking location until I try to use it! So I can’t count on it and in the city where parking often is in a nee place means I can get truly stuck. I would expect better car has strong cell signal not a cellular communication issue for in-vehicle cellular.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7061554733","version":"1.1.9","date":"2021-03-03T18:56:32.000Z","authorName":"KenS167","rating":1,"title":"It takes 6 hours to get txt/sms messages.","body":"Can’t use the app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7061495961","version":"1.1.9","date":"2021-03-03T18:34:51.000Z","authorName":"LoScholz","rating":1,"title":"Junk","body":"This app rarely works. Constantly logs you out even with the checked box to keep you logged in. Currently trying to log in and keep getting booted back to log in screen every time login/password is entered. Complete junk.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7061170350","version":"1.1.9","date":"2021-03-03T16:39:08.000Z","authorName":"suzzy 1311","rating":1,"title":"Keeps signing me out","body":"Face ID won’t work. Keeps signing me out. Won’t send access code. Tried deleting and reinstalling. Won’t bother with it anymore.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7060759283","version":"1.1.9","date":"2021-03-03T14:25:06.000Z","authorName":"Coldnfornoreason","rating":1,"title":"Me","body":"Why does it now take 30 minutes or longer for my activation code text to arrive. By then I do not need a remote start. Again this always seem to happen on the coldest mornings, therefore useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7059654242","version":"1.1.9","date":"2021-03-03T08:26:04.000Z","authorName":"bhourx","rating":1,"title":"Horrible after recent update!","body":"App was working fine until I downloaded the most recent update two days ago. Since then I haven’t been able to get back into the app. I keep putting my phone number in and it’s supposed to text a verification code. Lexus never sends one until 4-6 hours later. Every time I go to enter the code I’ve received, 4 hours later, into the app it tells me that my session has timed out! This has been going on for two days now. I’ve tried deleting and redownloading, tried resetting my password but guess what... in order to do so you have to be sent a verification code. And of course the cycle starts all over again. I don’t get a code for 4-6 hours, once I enter the code Lexus finally sends, it tells me it’s wrong and the session has timed out. If you haven’t downloaded the update... DON’T DO IT! You won’t be able to log back in. This is just downright ridiculous.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7057384223","version":"1.1.9","date":"2021-03-02T16:36:41.000Z","authorName":"wayne.T","rating":3,"title":"Okay app","body":"app is slowly improving with each update. I wish there are some new feature down the road like ability to lower windows or tilt sunroof . It will come handy in hot weather to evacuate hot air.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7055891658","version":"1.1.9","date":"2021-03-02T08:14:56.000Z","authorName":"Big bear4996","rating":4,"title":"Seeing improvement...however","body":"My car is a 2016 IS. Haven’t had any issues for the last 6-8 Months. Even after new updates. However, I still don’t think it’s worth $16 for remote services.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7051627419","version":"1.1.9","date":"2021-03-01T05:35:32.000Z","authorName":"Lexus NX 300","rating":1,"title":"Can’t even log in","body":"I have a Lexus Drivers account that works perfectly fine on a desktop online but can’t log in through this app. Keep getting a pop up that says “The vehicle information you entered does not match our records” after inputting the VIN.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7051598887","version":"1.1.9","date":"2021-03-01T05:23:33.000Z","authorName":"dquackrr","rating":2,"title":"It’s ok","body":"Latest version doesn’t integrate well with password managers for login id.  When the app seems to be down it just asks you to add a VIN with no easy way to check what status their systems are in leaving you to clueless as to what happened and when the system may return.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7049852200","version":"1.1.8","date":"2021-02-28T17:40:11.000Z","authorName":"JohnRandall63376","rating":1,"title":"3rd class app for a 1st class car","body":"Doesn’t work with Siri. App is slow and you have to actually be in the app for longer than you should be. Locking/unlocking & starting my car should be as quick and easy and it is with my key fob. Simplicity should win and this service definitely loses. Won’t renew my subscription and can’t believe I paid almost $100 for something I don’t love as much as the rest of my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7047485413","version":"1.1.8","date":"2021-02-28T03:58:53.000Z","authorName":"Dan1250","rating":2,"title":"You really should include remote start on luxury vehicles","body":"This is a nice app, with nice services, however what I’m truly disappointed about is the fact that you pay several thousands of dollars for a vehicle that had remote start as a capability, but Lexus revoked that from you after a certain time and you need to pay to use these features again. I bought a pre owned 2017 Lexus IS 200t, and I love everything about my vehicle! I just figured out that in order to remote start my car I have to pay for a subscription, that’s just unfair to me and really a lie to make more money off of others, Lexus you’re already charging people a lot of money, as you should for a luxury vehicle, at least allow them to remote start their car from the key fob.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7009287849","version":"1.1.8","date":"2021-02-18T11:58:27.000Z","authorName":"gegi.s","rating":2,"title":"Remote services glitch","body":"There’s a fault in your app when I start my NX through this app, the app keeps spinning the start engine option, it doesn’t allow me to click the start engine feature Bc it is stuck in a spinning mode ... I have to force close the app Everytime I need to start my car ... pls fix this","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7007530892","version":"1.1.8","date":"2021-02-18T01:20:23.000Z","authorName":"par under the stars","rating":1,"title":"Disappointed","body":"The Lexus app is a great idea unfortunately they can NOT execute.Have had issues in the transition from Enform- it didn’t recognize my vehicle- after multiple calls with support it finally linked. Now that it is cold n a perfect opportunity to use the remote start but the system would not connect. After trying for a few days it still will not function-Lexus tech- worthless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7006969135","version":"1.1.8","date":"2021-02-17T21:30:33.000Z","authorName":"Really Unhappy Owner","rating":1,"title":"App is Terrible","body":"I have a 2017 GS350.  I have had countless issues with this app.  Randomly locks up and stops working.  Tells me to contact my dealer.  Completely useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7006248119","version":"1.1.8","date":"2021-02-17T16:55:34.000Z","authorName":"Akwolve1","rating":4,"title":"Miss the Old Trip list","body":"I like this app it’s intuitive. However, I really miss the old apps ability to view the trip, i.e. where did it start and where it ended. I also miss being able to access the history of those trips. The drivers score really doesn’t do anything for me other than insult me LOL. Please bring the trip feature back into this new app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"7005418061","version":"1.1.8","date":"2021-02-17T12:46:18.000Z","authorName":"QuinnTE","rating":1,"title":"Mostly non-functional app","body":"This U.S. app is supposed to only start, lock and unlock the car ... pretty simple. But 60% of the time it doesn’t work. And it does not work in Canada. Hyundai has a better remote start where one can set the temp inside and it doesn’t stop when the doors are opened. I’ve been a Lexus driver for nearly 20 years ... this app alone could make me explore other makes next time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6998971855","version":"1.1.8","date":"2021-02-15T22:51:20.000Z","authorName":"OPRP","rating":1,"title":"Non performing expensive app with unresponsive support","body":"In moving to this updated app - it has not worked to remote start my car - I primarily only use in winter but have not been able to use at all - it just won’t work.  In calling the app support I’ve had multiple run arounds - have called seven times and been on hold from 30-75 minutes.  I w call numbers provided and then am told I need to call another number which is usually the number I already called.  Further frustrating is the menu to select where your call goes to is long and confusing so ea h time you have to muddle through that.  As of two weeks later, approx 8 calls, and hours on this - nobody can tell me anything and looks like no motivation to fix the issue.  I have four Lexus cars in the family and the service with this app is appalling and not worth it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6985649879","version":"1.1.8","date":"2021-02-12T14:21:05.000Z","authorName":"RWGS1980","rating":1,"title":"Worst app ever!","body":"LEXUS apps are the worst. This one logs me out every.single.time I’ve ever tried to use it. Face ID is good enough for everyone else but Lexus, it never works.\nNot worth looking at my password,  then risking having to change or reset it, just to turn your car on. Though that would be great, now that it’s freezing here!\nIn fact, all of their technology is horrible. Brand new 2020 and the apps don’t work, the wifi has never worked (except for 1 hour at the dealership!), AppleCar play usb constantly switches off while I’m driving, turned off Lexus+Alexa migration day 1 it was so bad.  It’s a good thing the car is nice, I can’t wait for my lease to be up! So disappointed in LEXUS.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6985067560","version":"1.1.8","date":"2021-02-12T11:23:36.000Z","authorName":"ChiroNico","rating":1,"title":"Terrible","body":"The app only works about 70% of the time.  Which doesn’t sound so bad except you have to PAY for this service.  GM vehicles get this same service for FREE!! If I’m paying for a service I expect it to be top of the line.  At the time of writing this it is -13 degrees outside... yes you read that right NEGATIVE, and I keep getting an error response from this horrible app. Would not pay for this again!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6982933383","version":"1.1.8","date":"2021-02-11T21:17:38.000Z","authorName":"Superstarmark","rating":1,"title":"Enform app suite not working","body":"I can’t connect to enform app suite in my NX300","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6971843298","version":"1.1.8","date":"2021-02-09T02:35:07.000Z","authorName":"heydvdjjendkeklwiworj","rating":1,"title":"Non-functional","body":"Update 02/08/2020. \nThe app still is non-functional. Last time the app communicated with the car was September 27, 2020. Re-installed the app and still no change. \n\nThis app is non-functional. None of the features work for locking, unlocking, and remote starting of the vehicle. It continuously fails to connect to the vehicle. In addition, it does not update the status of the vehicle for extended periods of time. One might think the car is locked only to find out that the status of the vehicle is several hours to a day old. Refreshing the status will not change that either.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6969276555","version":"1.1.8","date":"2021-02-08T11:42:22.000Z","authorName":"Rcbaker2","rating":1,"title":"Lexus technology is and has been terrible","body":"If only their car quality was used in their app technology.  Bad decisions, poor design.  But, only option is to drive another brand.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6966886697","version":"1.1.8","date":"2021-02-07T20:39:42.000Z","authorName":"n@astya","rating":2,"title":"Long response time and lots of errors","body":"Very long response time. Sometimes gives an error messages that vehicle cannot be started but it is not. Shows wrong vehicle status that trunk or moon roof are not locked. \nWith last update it stopped to ask for password or Face ID, which I think is not right, because if I lost my phone, somebody can use to open my car.  Also, if you have 2 lexus cars in one account, the app won’t work on 2 apple watches. Unable to setup default car for 2 devices, only for account...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6953755246","version":"1.1.8","date":"2021-02-04T17:00:55.000Z","authorName":"nanetteg55","rating":1,"title":"Really inconsistent","body":"The app times out 4 out of 5 times when requesting the car to start. Just doesn’t work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6950305591","version":"1.1.8","date":"2021-02-03T21:19:38.000Z","authorName":"miszka1972","rating":1,"title":"Can’t sign in","body":"It doesn’t let me sign in on my phone. I pay monthly for nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6950291018","version":"1.1.8","date":"2021-02-03T21:13:49.000Z","authorName":"Rrobert151","rating":1,"title":"Slow, often crashes","body":"This app is just awful. I have had a Lexus vehicle for 5 years and several versions of this, all bad. Even today I can’t even log in because when I click “log in” the app blinks but does nothing. This type of stuff happens all the time. I don’t understand how a luxury vehicle company makes people pay for this type of functionality. If the car itself wasn’t amazing I would ditch the brand on this annoyance alone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6945906895","version":"1.1.8","date":"2021-02-02T19:22:20.000Z","authorName":"Suvorovakatie","rating":2,"title":"Get constantly logged out","body":"App logs me out all the time, sometimes I am not able to log back in. When I try to log in with my email and password, app brings me back to the Sign in screen. Even though I have Face ID enabled, app asks me to sign in using login and password - super inconvenient!!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6936455230","version":"1.1.8","date":"2021-01-31T13:05:46.000Z","authorName":"e-dogg76","rating":3,"title":"App not working","body":"App stopped connecting to my car for a few weeks. Can’t start the car using the app. Called to help fix the issue, nothing. Told me to take it to the dealership? Lucky I don’t pay for subscription, it’s free through my 3 year lease. When the app did work I loved it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6924979215","version":"1.1.8","date":"2021-01-28T17:44:17.000Z","authorName":"A recent fan","rating":1,"title":"Registration is a pain","body":"Just bought an RX 450h. Even the simple process of registering for a new account is so difficult. I can’t remember an app where I couldn’t even get registered. You need to fire the people who created this app.\n\nThe app rejected my phone number. It rejected the strong password created by my iPhone. It even rejected the code that the app sent to my email. Can there be a more terrible app than this? I haven’t seen a single positive review of this app! If this app is this bad I fear it will just harm my driving experience once it connects to my car. No thanks.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6919741281","version":"1.1.8","date":"2021-01-27T13:21:02.000Z","authorName":"Lilsis1990","rating":1,"title":"This app makes me want to buy not another Lexus ever again!","body":"This app won’t even let me enter in a password to get into it.  I have deleted it and the old apps and tried to reinstall.  I’m not going to pay a fortune to have someone fix it for me the dealer.   Why change the app when it was working well before???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6915450270","version":"1.1.8","date":"2021-01-26T11:37:11.000Z","authorName":"_Reviewer!","rating":1,"title":"HORRIBLE","body":"If I could give this feature 0 stars I would...you pay for a service and have to download an app that doesn’t work majority of the time...it’s useless! I’m at the point where I’m ready to get another vehicle where I don’t have to pay for a feature such as automatic start. WOULD NOT RECOMMEND","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6915266528","version":"1.1.8","date":"2021-01-26T10:39:16.000Z","authorName":"CG St Louis","rating":2,"title":"Worst App Ever","body":"Today, I’m cancelling my Lexus app. Woke up this morning there’s an internal error. First I’m asked to put my VIN in again. Once I get the information in, it says Internal error. Fed Up! Not to mention the days the dumb app does not work. It’s a waste of my time and money.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6905189780","version":"1.1.8","date":"2021-01-23T19:05:39.000Z","authorName":"Pharaoh2377","rating":4,"title":"I dont know why?","body":"I dont know why people are complaining about the App?\nIts working fine on GX 460 2021 from the first time.\nAll you need is to click on SOS, wait until they ask you a question then say “NO”, then say “Enroll”, they will send you an email with a number, you put in the App, and wait till the following day and it will work. The agent told me to drive it for 15 minutes first, but i didnt, and it worked by it self, her sound in the car was so clear, i felt she was sitting beside me.\nThe Tasks like starting the car or unlocking the door, or hazard, takes few seconds, its a car not a smart homekit gadget.\nThanks Lexus for making such a beautiful App/features.\nBut..... still upset that the GX460 is the ONLY car that doesnt support Apple car play! 4 Stars for that!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6901299655","version":"1.1.8","date":"2021-01-22T19:35:10.000Z","authorName":"ItsDlite","rating":2,"title":"Needs works","body":"App just needs work! You will get notifications even if your car is parked in your car (needs geofencing and white listing locations). Remote start with the fob only in you have a valid Lexus enform subscription and that goes away soon because of 3G (even for a 2017, RX350 FSport)","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6896521098","version":"1.1.8","date":"2021-01-21T14:25:05.000Z","authorName":"Stephanie_1117","rating":1,"title":"Horrible","body":"I live in the Chicagoland area and we have brutally cold days. I try to warm the car which is parked in the garage and 90% of the time I receive an error that the app is “unable to locate the vehicle”. I have this service so I don't have to go running outside to warm the car but end up doing so almost every day.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6894310754","version":"1.1.8","date":"2021-01-21T00:45:01.000Z","authorName":"NH Customer","rating":1,"title":"Lexus Just Doesn’t Get It","body":"I don’t want all of these “services” on my phone! I wish I could selectively choose some capabilities and bypass others. Toggling them on or off would make the program more meaningful. Lacking that choice I dumped the program.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6894040726","version":"1.1.8","date":"2021-01-20T22:56:14.000Z","authorName":"Josh ludovice","rating":1,"title":"Delay start","body":"It takes 30 seconds for the car to start. This is useless for paying $175. And once it start the car shuts off. This is completely stupid!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6892603877","version":"1.1.8","date":"2021-01-20T13:55:49.000Z","authorName":"Lexz11","rating":1,"title":"Lexus app is not Lexus quality","body":"I hope at some point in the future Lexus will learn how to build a software application reflective of the quality of their vehicles. \nI hope they can look forward instead of looking thru the rear view mirror. \n\nLexus IS good mechanically but when it comes to electronics the Germans have surpassed them. How could Lexus install 3G wireless radios in a 2018 vehicle knowing that the technology was moving towards 5G wireless. 5G wireless is not something that just appeared in 2020, but had been in standards working groups for a significant number of years. My 2019 LS doesn’t have USB C power connection. Please start looking forward.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6892399609","version":"1.1.8","date":"2021-01-20T12:54:14.000Z","authorName":"OhGahd!","rating":1,"title":"Non-functioning 90% of the time","body":"1. Every time I use it, the screen doesnt update automatically. It shows you your last use of the app.\n\n2. 90% of the time, it doesnt work. Keeps on “Connecting to Vehicle” until get irritated of waiting for it to say it has started.\n\n3. No controls for temperature. You need to have the presence of mind to set it before you leave the car for your next auto start.\n\nIve had multiple after market auto starters before this. All works better than Lexus’s. Fix the dem app/connection issues. Even remembering the times it didnt work gets me frustrated.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6886622510","version":"1.1.8","date":"2021-01-19T00:43:22.000Z","authorName":"Pug Palace","rating":1,"title":"Remote services stopped working","body":"App was working fine until a few weeks ago when remote services disconnected.  I called the help number in the app and no one could help me.  Why promote this app when it randomly doesn’t work. Disappointed","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6870836534","version":"1.1.8","date":"2021-01-15T00:42:09.000Z","authorName":"Goodpeev","rating":3,"title":"Not great, but getting better","body":"I have a few recommendations: \n1. Add remote start climate adjustments (allow the user to change the temp of the car from the app while a remote start is running). \n2. Add alarm sounded notification (if the alarm is sounded while the car is locked, allow the option to get an alert or even allow an option to setup an automated system to call you or text you).\n3. Add the send destination to vehicle function to remote subscribers. This should be done for all vehicles that have the ability to have destination assist and that currently have remote subscription or trial. \n\nThese features should be made to support a wide array of models, and should not be only for the newly refreshed ones.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6870016102","version":"1.1.8","date":"2021-01-14T19:10:30.000Z","authorName":"Rationalist/Pragmatist","rating":4,"title":"Make Apple Watch App A “Complication”","body":"Please make the Apple Watch app enabled as a watch “Complication” so it’s readily accessible from the watch face at all times.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6866341787","version":"1.1.8","date":"2021-01-13T21:10:41.000Z","authorName":"Hames00","rating":1,"title":"Worst customer service","body":"I called several times to cancel the subscription but they always keeping me on hold and at the end no one reply’s.\nWorst customer service","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6859801698","version":"1.1.8","date":"2021-01-12T05:13:42.000Z","authorName":"Axyzer","rating":1,"title":"Wont allow me to register","body":"After providing my vin number multiple times I’m still unable to log into and create an account. I get to the point where I can input all of the vehicle specific info but it keeps saying “unexpected error occurred”.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6851010129","version":"1.1.8","date":"2021-01-09T22:42:33.000Z","authorName":"Tom6gun","rating":1,"title":"Remote","body":"Only reason I use this app is for the remote start, and only seems to work when it feels like, mostly not.\nFor over a week straight it didn’t work at all, now Lexus says I need to take to service for “update”. Six months into this car I already need what basically amounts to a day long update and a loaner car, that’s convenient...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6850285656","version":"1.1.8","date":"2021-01-09T18:14:43.000Z","authorName":"Alkanx","rating":2,"title":"Needs Improvements.","body":"App needs to be able to unlock and lock doors individually.  Also AC or heater on/off, defogger etc. and few other functions should be added.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6842758108","version":"1.1.8","date":"2021-01-07T20:08:47.000Z","authorName":"Cece136","rating":1,"title":"Does Not Work","body":"I just bought my first Lexus and as excited to use this app. It doesn’t work. I can’t do anything. It’s extremely slow and at this point totally useless. Very disappointing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6842754554","version":"1.1.8","date":"2021-01-07T20:07:25.000Z","authorName":"chinkyho","rating":3,"title":"Stopped working","body":"It was a perfect app for me to use to start up my car and everything but all of a sudden as of today the app stopped working and I can not sign in. \nI even deleted the app restarted my phone and it doesn’t work anymore.\nPlease get this fixed ASAP","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6842466491","version":"1.1.8","date":"2021-01-07T18:16:48.000Z","authorName":"hirnix","rating":3,"title":"Stopped working","body":"Update 1/7/2021:\n\nLexus helped find a fix:\n1) Go to settings > general > storage\n2) Find Lexus app, delete it \n3) Restart phone\n4) Re-download Lexus app\n5) Open app, then close it/shut it down \n6) Go to settings > Safari > privacy\n7) Disable cookie blocker\n8) Clear search history\n9) Open Safari and open any website\n10) Restart Lexus app and log in\n\nI would have expected the app developer response to include these steps in their response. \n\nOriginal review:\n\nThe app suddenly stopped working. Perhaps after the last iOS update. Now it wants to open in a browser and the error message says “requires cookies to be enabled”, which I do have enabled. \nWithout the app working, my (paid) Lexus Enform services can’t be used.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6827391636","version":"1.1.8","date":"2021-01-03T20:07:38.000Z","authorName":"@StillerCj","rating":1,"title":"Should be more features","body":"I have a 2020 Lexus NX and my app does not have features that a 2020 car app should have. I should be able to turn my car on and customize the heat/AC, seat warmers, Steering wheel heat etc... it’s useful to lock or unlock the car and check on the status of the car being locked or not but there should be more features...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6826427010","version":"1.1.8","date":"2021-01-03T14:41:43.000Z","authorName":"hailey0823","rating":1,"title":"Lexus App","body":"You would think having a luxury car this app would allow you to control the inside of your car temperature... keep car running and lock it while you run in somewhere... it does not do any of that. Lexus should definitely update I mean even Toyota’s and Chrysler's have this feature.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6823085040","version":"1.1.8","date":"2021-01-02T17:49:57.000Z","authorName":"Eve Random","rating":1,"title":"Expected much more from Lexus","body":"I previously owned a Subaru that had much better app capability. When I “upgraded” to the Lexus, I expected to at least be able to do things I could do with the Subaru- not so. Simple quick things like seeing the tire pressure (the actual number) are either not present or not easy to navigate to in the app. \n\nI also can’t do things like set the radio or pop the trunk. It seems like the app should be able to communicate and let me do some of those things without sitting in the car and fiddling or fumbling with the fob.\n\nI have a hybrid and would love some geek out info on my battery vs gas engine usage. How much gas have I saved overall? Which trips were my most efficient? Least? Any tips? \n\nThe Apple Watch app is useless - don’t get me started on that.\n\nTruly disappointed that they don’t seem to care at all about improving the app to raise it to the standard I expect from Lexus. Hybrid owners in particular I’d think would like more from the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6821496302","version":"1.1.8","date":"2021-01-02T09:39:18.000Z","authorName":"dkhsws","rating":1,"title":"Useless App","body":"This app doesn’t even work. It keeps saying my VIN is wrong even though I’ve manually entered and copied and pasted it so many times. Yet, when I go on the mobile web version through safari it lets me log in magically.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6809307273","version":"1.1.8","date":"2020-12-30T04:05:26.000Z","authorName":"never rates","rating":2,"title":"Disappointed","body":"For this to be considered a luxury car I would expect a luxury app. For starters, I keep getting a notification and email that my subscription is ending and or registration didn’t  go through and will be cancelled soon. When I press the button in the car ( as instructed) they have no clue as to what I am referring too. \n\nTo start my car, it will continue to circle until I get out of the not (not close ) and then MAYBE actually start the car , or not. Then god forbid you want to start it twice because ( it gets cold in upstate NY) you will have to actually close the app to try and start it again because , the start engine button is still spinning from the fist start . \n\nSame goes for locking and unlocking .\n\nWhen it actually works and does what it’s supposed to do, I will change my score","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6807928613","version":"1.1.8","date":"2020-12-29T19:07:13.000Z","authorName":"Microwave Spy","rating":1,"title":"Could be a good app-its not","body":"Like the app but I am so tired entering and re-entering all my information. I quit using this app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6805122200","version":"1.1.8","date":"2020-12-29T01:15:10.000Z","authorName":"Gondokolokococoa","rating":1,"title":"Invasive of Privacy","body":"I have a brand new 2021 gx 460, $62,000 and cannot use appleplay on my screen. Fumbling around with my phone. This app charges you money to use your own personal data and track you everywhere so they can make money on you. Its extremely invasive and they really offer nothing of interest to me. Its a complete disregard of consumer privacy with user entitlements.  This app is a wasted effort, dont give them more of your money","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6804128801","version":"1.1.8","date":"2020-12-28T18:41:43.000Z","authorName":"wilmy1","rating":1,"title":"Garbage","body":"This app is complete trash. It works properly 10% of the time. I get that cutting edge technology is not a selling point for Lexus, but this is a joke. I’m\npretty sure you can do better. Zero stars.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6790439849","version":"1.1.7","date":"2020-12-25T02:21:45.000Z","authorName":"MommyHayes1","rating":1,"title":"Bring the old app back","body":"This app is straight trash. With the old app I could start my car from inside the hospital where I work. It was dependable. This app is just an embarrassment! I can be standing right beside my car and get the error message when trying to start it! I want the old app back. This is a mess and I hate it! Just a waste of space on my phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6789053392","version":"1.1.7","date":"2020-12-24T16:21:23.000Z","authorName":"Shookie Girl","rating":1,"title":"Die Hard Lexus Driver","body":"This app is ridiculous. Every time you want to update any personal information on your account it tells you the session has timed out. Sends you a code to put in every time!! Then wants a new password established every time!! I believe we pay a fee every month for the service and this is eggs we are left with. I love Lexus but this is not what I expect to receive.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6786567273","version":"1.1.7","date":"2020-12-24T00:04:34.000Z","authorName":"AC Lexus 570","rating":1,"title":"Login almost every time I use the app","body":"I am very annoyed of login every time I use the app. You need to add remember login and password so I do not have to type my email and password every time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6784581745","version":"1.1.7","date":"2020-12-23T11:35:36.000Z","authorName":"greenhaven","rating":1,"title":"Total Fail....HOWEVER","body":"I’ve been trying for the past week to get my Lexus App  to accept my Lexus. Faxed in proof of ownership as instructed, but still no luck. After reading the excessively high number of complaints about the apparent ineffectiveness of the Lexus App, I’ve concluded that Lexus doesn’t want my $80 a yr subscription fee. \nAs for the people writing vicious and nasty comments about Lexus. Yeah okay, you’re driving a high dollar car and you’re angry that your Lexus App is ineffective. To be brutally honest, you sound like a bunch of spoiled brats, whining and moaning about a stupid Lexus App that isn’t coddling you. Take a break from your childish anger and read a book about the Great Depression of 1929 or watch any number of YouTube videos on the same topic. People back then had truly suffered with very difficult living conditions with no money, little food, and no jobs.\nThey survived!  YOU don’t have it bad at all when you can complain about a stupid app which only serves to make us lazier. STOP WHINING. \nThank you Lexus for building an awesome car, but a terrible app which I’ll never experience.\nUPDATE: 12/23/20—A couple of days after this review, I tried adding my Lexus to this app again. Praise God! It worked.  I decided to test the waters and subscribed for a 30 day period. So far, the Lexus App has performed flawlessly. If you continue running as well as my beautiful and beloved Lexus, I may just keep you. Thank you Lexus App Developers for responding!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6783151313","version":"1.1.7","date":"2020-12-23T01:05:53.000Z","authorName":"drdave97","rating":1,"title":"Embarrassing bad app","body":"Very poor developing on this app, they should just have kept the old one which always worked fine, it’s just embarrassing that GM and Fords are remote starting even without app just from the remote. It probably is all we want, be able to start it from about 100 feet away, but we can’t even have that out of a “high tech” brand. Sorry for the shame.\n\nThe technical support is very scarce if any, I have called 3 times and waisted 3 hours of my time trying to make it work with technical support that doesn’t know much and the ones that know “aren’t available” I can see how this brand might get in serious trouble, if they can’t even remote start a car, I don’t see how they will have a full electric car working. \n\nShame on Lexus charging $160 a year for something that doesn’t even work!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6782190628","version":"1.1.7","date":"2020-12-22T18:10:48.000Z","authorName":"Mark838shoppaholic","rating":1,"title":"Thanks to this app I am out $200","body":"Horrific app, it guided me through to buy dynamic map update and after receiving usb stick, typing in activation code it gives me error. Unable to generate license key! I talk to dealer and they said it’s an app issue nothing they can do. Please do not buy anything from this app, you get zero support","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6774927958","version":"1.1.7","date":"2020-12-20T16:40:40.000Z","authorName":"11/25/2020","rating":4,"title":"Changed my review","body":"After my last review I received a few emails on the problems I had. Which I appreciated very much. Nothing is perfect and to see a company with this type of customer service is pretty awesome. Hats off to the lexus app team. The app isn’t perfect but I know they’ll fix these problems down the road. 10/10 on customer service.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6772733204","version":"1.1.7","date":"2020-12-20T02:53:35.000Z","authorName":"Ryno7006","rating":1,"title":"Worthless","body":"Brand new Lexus.  App has worked once in the month I’ve own it.  Lexus dealership has no idea how to resolve the issue.  Absolutely not a reason to buy this car.  ZERO value added.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6768037479","version":"1.1.7","date":"2020-12-18T21:06:57.000Z","authorName":"NashanicGolfer","rating":1,"title":"No longer remotely unlocks or starts","body":"As of Nov 27th this no longer connects to my vehicle.    Ive the alexa/lexus app works on the multimedia but I am looking for the remote start and unlock lock features on the Lexus app.   It continues to give a message to be sure its in a cellular covered area which it is and Ive triend many locations. Ive called Lexus and they gave me a few tips and checked the account  nothing seems to work and Im paying for this service. Update- I brought the car to Lexus Mon morning they ordered a new communication Module. Today Is Friday and no parts so I picked the Lexus up because I will be going away for awhile to get away from a covid hotspot. 5 days they had my car and did nothing.       I cant recommend Lexus to anyone, very disappointing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6764720315","version":"1.1.7","date":"2020-12-17T23:22:39.000Z","authorName":"Fadi_philip","rating":1,"title":"always i get Busy service","body":"This program needs to be completely and comprehensively modified..\nNot working properly..\nThe car I own is priced at $ 60,000, and this program does not have features such as turning on the air conditioners or heating the seats..\nNeeds an upgrade.. to feel  luxury.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6764606813","version":"1.1.7","date":"2020-12-17T22:39:30.000Z","authorName":"Ceb Rider TRE","rating":1,"title":"Choppy at best","body":"Hardly works. Won’t even let me log in. Mostly unresponsive. Just flashes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6764368345","version":"1.1.7","date":"2020-12-17T20:57:19.000Z","authorName":"AZ4fun","rating":1,"title":"Bring back the old app","body":"Constantly logs me out. Have to re-enter login and password even with Face ID on.   Very frustrating, especially when my hands are full at the store and I am trying to start my car quickly.  Expect better from Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6762711497","version":"1.1.7","date":"2020-12-17T11:01:05.000Z","authorName":"Emmy718","rating":1,"title":"Acct maintenance the day after a snow storm?","body":"The east coast got hit with a snow storm and I wanted to use the app to start my car the next morning— but it was under maintenance. Huge disappointment.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6757806346","version":"1.1.7","date":"2020-12-16T01:09:45.000Z","authorName":"kkevinn.law","rating":1,"title":"Cannot log in the account on mobile app","body":"I have registered an account on my laptop successfully. But when I try to log in on this app on my iPhone, it askes me to enter the VIN. I always check it carefully and make sure every number and character is correct but it keeps showing the notification “Please confirm the VIN entered is correct...” and of course not let me complete setting up. Can some one please contact and help me?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6754032819","version":"1.1.7","date":"2020-12-14T23:27:14.000Z","authorName":"ViciousVixen84","rating":2,"title":"Paying for remote start???","body":"I don’t really understand why Lexus owners are paying for a remote start that really should come with car. Ford, Chevrolet and Dodge have remote features that you don’t have to pay additionally for. As much as people pay for a luxury vehicle, why don't we have the luxury of free remote start?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6753773304","version":"1.1.7","date":"2020-12-14T21:29:07.000Z","authorName":"JennnnnnnRrrrrr","rating":2,"title":"Terrible ap","body":"For some reason, this ap just stopped working. It has not updated since November 8th. I still have the car and I have not received notification that I couldn’t use this. I can no longer start my car, know if my doors are locked, how much gas I have, etc... come on Lexus. You can do better!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6747201139","version":"1.1.7","date":"2020-12-13T01:39:19.000Z","authorName":"15 Year FOP","rating":1,"title":"I’d give it a zero if I could...","body":"This app is so frustrating...couldn’t make it past the adding a vehicle screen. It would pull up my vehicle by VIN but when it came to saving the vehicle, it said it was an invalid VIN...multiple times at different locations different times of day. Deleting the app and would advise anyone thinking this is a benefit to owning a Lexus, reconsider. You’d think that a car at this level of quality would have supplements, such as the owners app, that is equal in quality.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6745882095","version":"1.1.7","date":"2020-12-12T16:49:00.000Z","authorName":"LarryWazereview","rating":1,"title":"Lexus Enform App Suite 2.0","body":"What happened to Lexus Enform App Suite 2.0.  It is no longer listed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6742062905","version":"1.1.7","date":"2020-12-11T17:03:55.000Z","authorName":"LeiramLee","rating":3,"title":"Remote start app flaw & clunky login","body":"Love my 2019 Lexus GX460, and the app is impressive, but the remote start app has a major flaw. It starts my car remotely but - it’s a pain for me when I load my family in, the car turns off as soon as I unlock the car. I’d expect the car to stay on once I, with my key, unlock the car. It might seem like a minor issue, but expected behavior of remote start cars is that the engine stays ON when the driver unlocks the car. Can this be fixed or changed so it’s easier?\n\nLogin is clunky on iOS. Every time I login I have to get a mobile access code. What’s going on?\n\nAgain, the app is impressive! Developers have done a great job.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6739215321","version":"1.1.7","date":"2020-12-10T22:12:49.000Z","authorName":"💛💘💓❤💚💗💜💙","rating":1,"title":"Can’t Add Vehicle","body":"I’ve been trying to add a vehicle for forever now. Still doesnt work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6738590365","version":"1.1.7","date":"2020-12-10T17:55:33.000Z","authorName":"Rv 5","rating":1,"title":"Piece of Crap.","body":"Cannot believe they actually have this bad of an app. Agree with every one star rating. Horrible app. Every update you need to re-enter login credentials for Face ID to work. Totally useless. Wonder if I can get $1000 back from my 65K RX. Totally blank screen no apps no nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6735659238","version":"1.1.7","date":"2020-12-09T22:33:58.000Z","authorName":"Hsgsjsgzhjsjdjd","rating":1,"title":"Rx350 2016","body":"Most the time is not work!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6735476813","version":"1.1.7","date":"2020-12-09T21:14:30.000Z","authorName":"THCBass","rating":4,"title":"I work for Lexus.","body":"So I work for a dealership as the technology specialist so this is sort of my wheelhouse so when I say it doesn’t work well, it doesn’t work well. The app works decently and is very helpful but the Apple Watch app just doesn’t work at all usually it encounters an error and when it doesn’t it request that I sign in to the iPhone app before it can process the request at which point there’s no point in using the watch app because you’ve already gone and opened the iPhone app and can just start the car from there.Decent out and is much more useful than the old inform app but the Apple Watch app is still completely useless. Big improvement could be made by letting the watch app be more independent. What’s the point of having it if you still have to use the phone app to make it work every single time?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6730392325","version":"1.1.7","date":"2020-12-08T11:17:09.000Z","authorName":"NTarini","rating":2,"title":"Awful","body":"Poor quality app that doesn’t respond at least 50% of the time. I pay $9 monthly to be able to remotely start my car (which is ridiculous that it’s not included) but I pay it anyway and now I’m wondering why I do that, when the app never works and I end up walking out into the cold to start the car myself. OH and it allowed someone else to access my account and add their car to my account without my permission... Doesn’t seem very secure.  Get it together Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6729087478","version":"1.1.7","date":"2020-12-08T01:38:05.000Z","authorName":"fgrsfhjgf","rating":1,"title":"0 stars","body":"Got a new lexus a few months ago. Another nice car. A few things they messed up like losing the little compartment on the console that was nice to put change in, but I digress.\nWhat I find truly remarkable is how they took one of the worst apps I’ve ever seen and made it even lousier. Now you have the option to check to keep you signed in. If you check that it keeps you signed in for a week. Last version took about a month to kick yo out. When you do spend all that time signing back in it usually takes about 3 tries to remote start the car. Ditch the useless app and put a remote start button on the fob","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6728929902","version":"1.1.7","date":"2020-12-08T00:32:09.000Z","authorName":"xFordguy","rating":1,"title":"Worst app on my phone","body":"Left Ford because of transmission problems. Love the ride and performance of my new RX350.\nThe Lexus app is a joke. Can’t remote start. Lock/unlock feature take way too long. This app should be free anyway, belongs on some kids toy.\nBeyond disappointed!\n\nMany, many terrible reviews and fluff answers by the developers. Glad I got this free for the first year, do not pay a dime for this lousy app. \nLexus needs to fire the developer and find some 13 year old kid that can produce the kind of app these cars deserve. Shame on Lexus for allowing this to remain a problem!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6728614992","version":"1.1.7","date":"2020-12-07T22:15:31.000Z","authorName":"Salsa50","rating":2,"title":"Garbage update 2 days ago","body":"I received an update to the app two days ago and now when I log in, none of my vehicles are there. It’s asking me to add them back by scanning or enter the VIN. It’s cold out and I wanted to remote start my car. Terrible user experience Lexus. You dropped the ball on this one.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6728595653","version":"1.1.7","date":"2020-12-07T22:06:27.000Z","authorName":"GreenLightinc","rating":1,"title":"Terrible App","body":"The app is a terrible representation of the Lexis technology. It never works properly. I have been waiting a week for the app to activate so I can auto start my vehicle. The fact that I have to pay for a service to auto start my vehicle is ridiculous to begin with, at least make it have the proper technology to support the car features. Two thumbs down.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6727238075","version":"1.1.7","date":"2020-12-07T13:18:51.000Z","authorName":"TheReportEriter2017","rating":2,"title":"Don’t waste your time","body":"The app is ok, other brands offer a much better functionality and looks. The previous app was much better and cleaner. Add to it the fact that soon card won’t have their SIM connected as they retire the 3G network, and also that Lexus won’t let you remote start from that moment since the app won’t work, and you are in a lower place than other Japanese and even Korean brands. Great car but the manufacturer is a bit sleepy when it gets to technology.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6724450767","version":"1.1.7","date":"2020-12-06T17:19:17.000Z","authorName":"njrifon","rating":1,"title":"Doesn’t work","body":"This app completely stopped functioning on my phone. When I tried to sign in I got a blank white screen. Considering the price of my vehicle and the added price for Enform, this is ridiculous. There are no troubleshooting links to address any of this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6722100757","version":"1.1.7","date":"2020-12-06T01:57:52.000Z","authorName":"Seamus17","rating":1,"title":"Terrible","body":"God awful app.  I tried installing and setting up with consistency error message even though everything was entered correctly","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6720641382","version":"1.1.7","date":"2020-12-05T15:57:44.000Z","authorName":"Debhong","rating":1,"title":"Pretty much useless","body":"Remote services function has been showing error since the first time I connected the app to my car (“unable to activate remote, try connecting again”) and it still does after 10 months. I’ve tried uninstalling & reinstalling the app several times & also sent feedback and asked for a solution via the app, but there’s been no follow up. Without the remote services function the app just shows my odometer & fuel level, and the rest of the app is just like a clunky website.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6717482579","version":"1.1.7","date":"2020-12-04T19:14:15.000Z","authorName":"Lowenart","rating":1,"title":"Impossible to set up","body":"I purchased a used RX, and can not get the app to connect to my car at all. I called the number the app suggested, followed their direction of faxing over a bill is sale to prove I purchased the car, and it still will not work. This app and their customer service is a complete joke. I hugely regret not getting a BMW instead.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6714323687","version":"1.1.6","date":"2020-12-03T21:38:12.000Z","authorName":"SamnangBun","rating":5,"title":"Good stuff","body":"Love it best remote ever .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6714207033","version":"1.1.6","date":"2020-12-03T20:45:34.000Z","authorName":"Murph95","rating":2,"title":"Used to work; now not so much","body":"This app was useful until the latest update. Now I can’t even sign in and the screen is black. So much for monitoring my car from my phone!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6707811084","version":"1.1.6","date":"2020-12-02T00:48:52.000Z","authorName":"mattyr930","rating":1,"title":"Doesn’t work","body":"I just downloaded the app and there is no function that shows start car remotely what can I do?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6699464051","version":"1.1.6","date":"2020-11-29T15:39:03.000Z","authorName":"Stevernie","rating":1,"title":"Keep Getting Kicked Out, then Can’t Sign Back In","body":"This app is absolutely horrible. I can get signed in sometimes, then it boots me out and I can’t sign back in because it says cookies aren’t allowed (which I have allowed them). Then when I try to sign in via another browser the page has me reset my password then continually says loading. The app is unreliable and worthless - I pay an annual fee for remote services for an app I can’t even use! Do yourself a favor and don’t download or pay for remote services - you won’t be able to use them 70% of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6698133052","version":"1.1.6","date":"2020-11-29T07:50:26.000Z","authorName":"NKY driver","rating":2,"title":"Enform App  Sign In","body":"I have a 2019 ES 350 and received Enform free for the first year. It worked perfectly and I enjoyed it. So when the car was a year old I paid the $80 fee to continue the service. At that time I was notified that I must install the NEW Enform app in order to use the service. I did so and have an aggravating issue ever since. \nI registered and checked “leave me signed in” but each time I open the app it requires me to sign in again!!! This is not convenient nor useful. I have called the customer service number twice and they tell me they must transfer me to a different dept. and each time my call has been dropped after waiting ion line for 5-10 minutes!!!\nWhat is the problem with this app? Why cannot you correct it? And why does customer service not return calls they drop. You have all my contact information and require me to restate it when  my call is answered. I am very disappointed  with Lexus Enform service.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6692557032","version":"1.1.6","date":"2020-11-27T19:10:43.000Z","authorName":"dahank","rating":1,"title":"Which app do I use?  I’m confused.","body":"Ok I have a total of 4, yes, 4 Lexus apps. Lexus, Lexus (same name but different color and design), My Lexus and Lexus Drivers.  All installed on my iPad.   Why so many apps?  And how do they all differ?  For a high end auto manufacturer Lexus really needs to update their technology!  And why so slow adopting Apple’s platform?  How about combining all these apps into one really useful app?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6686377667","version":"1.1.6","date":"2020-11-26T02:47:15.000Z","authorName":"Helen@921","rating":2,"title":"It’s always not working","body":"Try to connect to my car for a remote start on a cold day, only 60%of the time works. So disappointed!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6685902177","version":"1.1.6","date":"2020-11-25T23:15:38.000Z","authorName":"Alex613","rating":1,"title":"Does not work most of the time","body":"Hi, so even when it works it’s very slow. But most of the time it is timing out on request to start the engine. I cannot believe that anyone would pay for this junk, it did come for free with my car for three years but I will not pay for it when the promo ends. \nI like the remote start feature but I would have to install the aftermarket remote one.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6685157755","version":"1.1.6","date":"2020-11-25T17:56:49.000Z","authorName":"thisizAsh","rating":1,"title":"Never works!","body":"It never lets me lock or unlock from the app. I have so many issues even loading the home screen. It only works SOMETIMES when my vehicle is on and driving. What’s the point of the lock and unlock features if I can’t even use it? Why am I even paying for these features? Even the Lexus Enform Remote doesn’t work. Just throw both apps away. Can I get a refund for this? I’ve paid for a subscription that I can’t even use.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6685086961","version":"1.1.6","date":"2020-11-25T17:29:55.000Z","authorName":"THE REAL V-MAN","rating":1,"title":"Garbage","body":"Constantly have to sign back into the account. The app has failed to connect to the vehicle....repeatedly. \n\nI’ll be taking this pathetic performance into consideration when making my next vehicle purchase....it’s that bad and that frustrating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6685066916","version":"1.1.6","date":"2020-11-25T17:22:18.000Z","authorName":"AZRainbow","rating":1,"title":"App","body":"The app is not working.... again.  The iWatch app finally was fixed within the last week or two. Yet again the app is not working today 11/25/2020.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6684962316","version":"1.1.6","date":"2020-11-25T16:44:33.000Z","authorName":"Devaros22","rating":1,"title":"The app is not working","body":"Unable to log in","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6684954877","version":"1.1.6","date":"2020-11-25T16:42:06.000Z","authorName":"meu3434","rating":1,"title":"The only thing worse than their cars is the app","body":"Absolute junk. You pay $16 per month to have remote start and the app hardly ever works!\n\nPiece of junk car and an even worse app. My advice is to buy any other car than a Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6684875202","version":"1.1.6","date":"2020-11-25T16:14:34.000Z","authorName":"Sgian Dubhs","rating":1,"title":"Cannot login","body":"Can no longer log in. Just spins on a black screen, then receive message stating that it cannot process my request. 😡","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6684632778","version":"1.1.6","date":"2020-11-25T14:53:21.000Z","authorName":"LexusUserTe","rating":1,"title":"Unresponsive app","body":"Probably one of the slowest app I’ve come across. Keeps logging me off, have to enter details often including VIN number when it automatically decides to log off, shows incorrect status that the car is on, have to refresh each time we open the app which again takes about 30 seconds before it shows the correct status. One needs to have a lot of patience to use this app. Top of it you have to pay for the app! My husband faces the exact same issues. This should not be the kind of service a luxury car company should provide.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6684495427","version":"1.1.6","date":"2020-11-25T14:08:43.000Z","authorName":"UX_250","rating":1,"title":"Very temperamental","body":"This app makes me want the remote starter that I can actually put on my key chain even more. It rarely works when I need it to. There’s always an issue or it can’t process my request.  So frustrating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6684411353","version":"1.1.6","date":"2020-11-25T13:41:34.000Z","authorName":"Whitepod","rating":1,"title":"Junk","body":"Im paying monthly for my autostart. Why in hell this is this giving me “we are not able process your request pls try again”? FIX IT!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6682443356","version":"1.1.6","date":"2020-11-25T00:01:38.000Z","authorName":"lexusguy215","rating":2,"title":"Longtime Lexus 215","body":"App is terrible. I rarely write reviews, but today I was totally frustrated with this app. Ever so often it prompts you to enter you password thru the website. The app suppose to be convenient, it’s not. I have to take the time out to go thru all this just to start my car in the morning. We have to get into our phones, then get into the app, sometimes have to update password & go thru all this nonsense to start to car then you have to start the car again once you inside. Why go thru all that?? Definitely needed some updating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6682145008","version":"1.1.6","date":"2020-11-24T21:49:41.000Z","authorName":"Ron Cherian","rating":1,"title":"Useless - is there a way to return the car","body":"I purchased the car and it's been more than a month. The remote services doesn't work and it shows me unable to activate Remote. My subscription started from the day of purchase and I haven't been able to use it until today especially with the winter.\n\nAlso, I only see lot of ad kind of features suggesting me to buy tyre which is irrelevant to me as its a new car. I would suggest you do personalized ads as well.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6679240980","version":"1.1.6","date":"2020-11-24T02:16:10.000Z","authorName":"zx vnn","rating":1,"title":"Server connect","body":"Server does not connect.  Why doesn’t this work?  Service at dealer, couldn’t get it to work either. Why?  Thanks","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6677832202","version":"1.1.6","date":"2020-11-23T16:29:48.000Z","authorName":"Ol' Jeff","rating":1,"title":"Useless","body":"Spent hours trying to get this to work with people from 2 Lexus help lines, the dealership, and SOS. Ended where I began: submit all approved info and get the same error: your info doesn’t match our records (other than the fact that it’s the right email, VIN#, etc.). Seems my $### payment each month matches well enough. Go figure.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6671244628","version":"1.1.6","date":"2020-11-21T20:28:56.000Z","authorName":"ericscottsapp","rating":1,"title":"CarPlay?","body":"How the heck do you get the CarPlay app to download to the console?? This is extremely annoying.  Apple CarPlay should come already downloaded on the car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6666926950","version":"1.1.6","date":"2020-11-20T16:43:53.000Z","authorName":"shitheadlexus","rating":1,"title":"Disappointed","body":"This app is a scam be careful! I purchased a 30 days subscription trail for $16+tax it took me 48 hours and 3 calls to costumer service in order it to activate. I only get to used it 3 times until my app showed up “subscription had expired” I called costumer service at 1-800-255-3987 it took me over 25 min wait until they told me someone had cancel my subscription and I have to purchase again. Why didn’t they verify information first before cancel? They didn’t  offer me a refund either. I didn’t even get to used it a full week and they took my money very bad service it’s a scam so be careful! Too bad I would off stay with them longer if service wasn’t this bad. Very disappointed I’ll get my service somewhere else.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6665903524","version":"1.1.6","date":"2020-11-20T11:02:54.000Z","authorName":"Dculbrdo","rating":1,"title":"Worthless","body":"How can such a luxurious car and company deal with such crap app developers. This is a true embarrassment to the Lexus name. This is a deal breaker for my next purchase and I looooovvvve a new car. This app is worthless. If there is a new update with my iPhone doesn’t work. Meaning it will not connect. I’m so over having continuous issues with this app. When are you going to get it right? Can’t cool off, can’t warm up. Just can’t with this app!!!😡🤬🤬🤬","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6664277753","version":"1.1.6","date":"2020-11-19T23:03:38.000Z","authorName":"ElvaDenise 333","rating":1,"title":"Alarm notification","body":"It is terrible you spend all this money for a 570LX and the Lexus app doesn’t alert you if your vehicle has been broken into.  I think they need to give buyers a discount so you can get this device on the vehicle and connect it to a app at their cost  This is 2020  not 1920","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6662977043","version":"1.1.6","date":"2020-11-19T14:25:28.000Z","authorName":"Overlook7","rating":1,"title":"Lexus...get a new app developer","body":"If I could give this app a zero I would. It’s unusable because it won’t let me register. It won’t allow me to enter my VIN number either by typing it in or by barcode. Seems like Lexus apps have always been poorly designed, glitchy, and when you call Lexus they advise me to just go to the website. What’s the point of having an app?","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6659043064","version":"1.1.6","date":"2020-11-18T12:21:50.000Z","authorName":"Jazzwah","rating":1,"title":"Get it together LexuS","body":"This version and the previous version are completely useless to me. My vehicle doesn’t show a status at all. I can’t use remote services (in a cold weather state). What is the use of paying for a premium automobile and subscription service that offers sub-par service? This is atrocious and makes the subscription for replete services a complete rip-off.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6656216361","version":"1.1.6","date":"2020-11-17T16:52:45.000Z","authorName":"dhui702","rating":1,"title":"App needs to improve","body":"When sign in with existing ID, it ask to add vehicle to the account which should already been there.  Tried adding vehicle with VIN# but always get an error saying the information does not match dealers information.  It just won’t allow you to add the vehicle either typing in the VIN or scanning the vehicle’s Barcode.  It’s really a junk software that doesn’t work at all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6653460613","version":"1.1.6","date":"2020-11-16T22:53:07.000Z","authorName":"Ladaydrian","rating":1,"title":"Making an account","body":"This has to be the worst app to create an account on by far. It took 10 minutes to make one.First time making it i used my google account used it then it asked for my phone number gave them my phone number and say enter the right information.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6653428455","version":"1.1.6","date":"2020-11-16T22:39:07.000Z","authorName":"LvJohns19","rating":1,"title":"Unable to log in -","body":"This app does not work. When I click on sign in, a black screen pops up and after about 10-15 seconds, reverts back tot sign in page.\n\nPlease update immediately.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6650644774","version":"1.1.6","date":"2020-11-16T04:35:15.000Z","authorName":"Jayabharath","rating":2,"title":"Keeps logging me out periodically","body":"This is quite a large annoyance- apps keeps logging me out.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6648399346","version":"1.1.6","date":"2020-11-15T13:58:58.000Z","authorName":"Dame dame","rating":1,"title":"Come on Lexus you can do better","body":"This app is nuts. It keeps saying there’s an update makes me login then I do that and it says there’s an update. Over and over again. Y’all gonna make some crash tryna look at this app and drive","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6645931316","version":"1.1.6","date":"2020-11-14T22:56:00.000Z","authorName":"MikeGee3457","rating":1,"title":"Awful app","body":"What am I paying for again? I have had my car for a year and I have called Lexus about this app not working at least 5 times in one year. No one has been able to solve the problem so I had to call back again and again. I’m about to cancel the subscription if the dealer can’t fix it or if they try to charge me for an issue that I’m not responsible for. For a luxury car, this app is a huge waste of money.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6643627161","version":"1.1.6","date":"2020-11-14T09:18:41.000Z","authorName":"Another Chuck","rating":1,"title":"Lexus App & Related","body":"Although I generally like this app, which is mostly an improvement over the prior Enform app from Lexus, there’s an important missing feature that I consider a huge flaw.  That missing feature is driving my one star rating.   The prior Enform app could be used as a complication on the face of my Apple Watch.  That allowed me to quickly and easily start the car from my watch without ever bothering to reach for my phone.  This app can’t be used as a watch complication, and I consider that a huge inconvenience and oversight.  Hopefully that’s a problem that will be corrected very soon.  (This is a Lexus driven issue.  I checked with Apple.  Lexus has to give the app that functionality.)\n\nTo add insult to injury,  I’ve recently received a notice from Lexus advising that all of this app’s functionality (along with some other premium features) for my car are tied to 3G data networks.  Since those networks are being phased out, the functionality won’t even be available for my car in the not too distant future.  Seems like this was an oversight that could have and should have been avoided, or maybe it’s a case of intentional planned obsolescence to force people to buy new cars.  Hard to say with any certainty, either way, I’m not impressed.\n\nWhen I combine these deficiencies with the poor controls to the Lexus infotainment system, which have been receiving universally bad reviews and ratings for years, I have to wonder what is going on at Lexus.  I usually don’t write reviews, good or bad,  but these latest and “greatest” updates have gotten me motivated enough to do so.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6642007282","version":"1.1.6","date":"2020-11-13T22:19:21.000Z","authorName":"Patch It!","rating":3,"title":"Extremely disappointed.","body":"Love Everything about Lexus except the app. I have had my newest Lexus for over a year and I keep expecting an update that \nmakes the app better. You put a world class car together and yet you can’t seem to hire people or another company that can build a reliable user friendly app. I have been paying for 2 years and I will not be renewing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6640480220","version":"1.1.6","date":"2020-11-13T13:00:14.000Z","authorName":"Applecenter935","rating":1,"title":"Big problem","body":"Please support the persian people in iran:(","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6638538288","version":"1.1.6","date":"2020-11-12T23:21:10.000Z","authorName":"rp683","rating":5,"title":"Fixed!  Thanks","body":"Thanks for fixing, it even works on Apple Watch!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6631225114","version":"1.1.5","date":"2020-11-10T23:08:28.000Z","authorName":"BABAKDARA","rating":1,"title":"Not working app","body":"This app almost never works","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6630289549","version":"1.1.5","date":"2020-11-10T17:06:31.000Z","authorName":"mn5$8","rating":2,"title":"LEXUS APP USED TO BE GOOD","body":"Up until 2 weeks ago LEXUS APP worked great\nSince nothing but trouble. Trip to Lexus and 8-10 calls have not helped. App is partially functional. Can unlock doors but the circle to hit keeps running long after the doors unlocked\nDitto for LOCK. Also no way to flash HAZARD lights like supposed to. And my IWATCH Lexus app wont work   Says I need to login on my phone EVEN THO I AM LOGGED IN\nCannot understand how a company that makes such superb cars and delivers great service can have such terrible apps. There are enough complaints one would think they get things right\nPLEASE ISSUE A NEW LEXUS APP THAT WORKS\n\nNov 10 update. Was helped greatly yesterday\nApp can start car, and open and close doors\nThis is huge improvement but App still not 100%. HAZARD LIGHTS not showing in app\nAnd same problem with IWATCH app. Tells me I need to login on my iPhone when I AM LOGGED IN\n\nAre the tech/Programmers busy on something else?  Response is we are working on it\nBut that’s been not 2 days but 2 months\nPLEASE PLEASE GET THIS APP RIGHT AGAIN","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6627874100","version":"1.1.5","date":"2020-11-10T01:02:21.000Z","authorName":"Big Bald Beaver","rating":1,"title":"Horrid App","body":"When the Lexus app works, it’s great but that is not often. 99% of the time it will not connect to my 2020 ES to use ANY feature. I have contacted Support for assistance 4x and other than long hold times, nothing gets resolved.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6626960505","version":"1.1.5","date":"2020-11-09T18:28:29.000Z","authorName":"FUKUZIMER","rating":1,"title":"Apple Watch Lexus app","body":"Horrible such a waste of my time get it together LEXUS!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6617569750","version":"1.1.5","date":"2020-11-07T04:52:16.000Z","authorName":"FLNJItalia","rating":3,"title":"Slow to do anything","body":"Just a simple locking of the doors has it spinning for a minute or longer. The app doesn’t recognize when the doors have been looked. I had to recheck the vehicle status. \n\nLook alive developers. You need the app to know when the task is accomplished and to do it faster.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6617459482","version":"1.1.5","date":"2020-11-07T04:00:08.000Z","authorName":"jacke47","rating":1,"title":"Dr","body":"This is the worst experience with both: Lexus app and Lexus customer support. This app does not work on my (iphone 7) or my wife’s (iPhone 6). Obviously, there is a bug there because it works on on old iPad. The customer support gives only two suggestions:\n- check with your cell service provider (stupid, because I tried with and without  WiFi)\n- Something wrong with hardware (even more stupid because it doesn’t work on both phones)\nAnd they just repeat this b. s. Again and again. I was begging to connect me with somebody more technically proficient. They were unmoved. \n“Experience Amusing”. Indeed.\n\nUpdate\nIt’s even Kafkaesque than I expected. The developer suggested to “share this feedback with us using the in-app feedback function within the app?\"   This app does not work on my or my wife’s iPhone. \nHas Apple any responsibility for quality of the products it allows to download?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6615992465","version":"1.1.5","date":"2020-11-06T17:57:33.000Z","authorName":"lancer 72","rating":3,"title":"Broadway","body":"Tried several times to connect with remote useless stop trying","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6615499627","version":"1.1.5","date":"2020-11-06T15:13:09.000Z","authorName":"Jhawkjuno","rating":1,"title":"Absolutely useless","body":"This app is a scam.  This app should be the subject of a class action lawsuit.  It is absolutely useless as are the Lexus help phone numbers.  Do not get this app.  Do not spend your money.  This app is cumbersome, slow, no good in an emergency.  \nWhile waiting for road side assistance due to the remote services not working i was on hold and disconnect TWICE!  I had locked my keys in the car and the phone help and the app could not get me into the car.  So instead I had to Uber home, get the key, and Uber back.  Total abject failure on the part of Lexus and their roadside assistance team.  If I had been in the middle of the desert with my family we’d all be dead.   Thanks for nothing.  Whoever developed and manages these departments should all be fired.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6606104150","version":"1.1.5","date":"2020-11-03T22:07:57.000Z","authorName":"Mississippiqool","rating":1,"title":"Not for watchOS 7.0.2","body":"Does not work on Apple Watch with latest OS.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6605764037","version":"1.1.5","date":"2020-11-03T19:39:39.000Z","authorName":"vendormsn19","rating":2,"title":"Cannot get the application to talk to my car","body":"I had to call in to get the application to register to my car. It now shows the miles and gas gauge correctly but it will not lock/unlock doors, turn hazard lights or remote start the car. This application is useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6604731259","version":"1.1.5","date":"2020-11-03T13:34:37.000Z","authorName":"really horible","rating":1,"title":"Worst customer service ever!","body":"Paid in September and it’s still not working. Called November 2nd and they could not get it to work. They were going to transfer me to tech and was on hold 20 minutes(I hung up). I deleted the app and re-installed it still not working. I called and went through the same rigmarole with another operator, she was then putting me on hold three times talking to Tech then it hung up. Bought another months subscription (I bought 12 months in September) to see if that would work,  downloaded authorization codes 4 times still not working.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6599031154","version":"1.1.5","date":"2020-11-01T22:34:24.000Z","authorName":"LillieGray","rating":1,"title":"New Enform App 2.0","body":"I’m stuck....after updating this I have NO Enform service and all records reverted back to my previous Lexus.  HELP!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6598888866","version":"1.1.5","date":"2020-11-01T21:29:47.000Z","authorName":"SMareane","rating":1,"title":"App isn’t even functional","body":"The Remote app is apparently no longer a thing. I try to log into this app and it just endlessly loops me through the log in screen. The app isn’t even made for a post 2017 iPhone. Cancelled every service I was paying for because the features and app simply never work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6598441144","version":"1.1.5","date":"2020-11-01T18:22:55.000Z","authorName":"Juke Box Junkie","rating":1,"title":"Lexus watch app is not worth downloading","body":"I’ve tried to use the app on my watch over and over. To my dismay it’s not working. I had the old app and it worked great a year ago.It tells me to log into my phone on the Lexus app which I am. But over and over it will not work. I removed it reinstalled it re-logged in still tells me to login. It’s useless to have an Apple Watch for your Lexus when it doesn’t work. Like the old app better. Even for my phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6597330952","version":"1.1.5","date":"2020-11-01T12:32:14.000Z","authorName":"TT-is-Me","rating":1,"title":"Doesn’t work properly","body":"When using this app to lock your doors or start the vehicle the controls on the app continuously scroll around in circles. It doesn’t inform you if your doors are locked or if your car has started it just errors out.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6596991231","version":"1.1.5","date":"2020-11-01T10:35:36.000Z","authorName":"09$!","rating":1,"title":"This app is terrible","body":"When using this app it only turns on my lights to car it’s not starting the car up as it should but the app will say the car is running 🤬","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6593784647","version":"1.1.5","date":"2020-10-31T13:44:15.000Z","authorName":"Lexown","rating":3,"title":"Missing vehicle locator","body":"Used to have vehicle locator, very useful  but now is missing. Called to lexus enform service and they told me enform service was down, the feature is still missing after 2 days of waiting.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6593530855","version":"1.1.5","date":"2020-10-31T12:21:58.000Z","authorName":"Mwlawrence91","rating":1,"title":"1990 technology","body":"For a leader in car tech, this doesn’t do it for me.  \nEvery time the app updates I have to re-enter all my login information.  \nI can’t control the temp or settings of my car from the app.   \nNo driver report.  \n\nMy friends Toyota app is more high tech.  \nOn top of that I don’t have Apple car play in a fully loaded Lexus yet my friends halfassed Toyota does.  \n\nGoing to back German.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6592559786","version":"1.1.5","date":"2020-10-31T05:23:08.000Z","authorName":"Souldivine2u","rating":1,"title":"Hate this app","body":"I saw that the other app is no longer in use so I had to download this one. It wont go any further than the page that says Enform trial.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6590335976","version":"1.1.5","date":"2020-10-30T14:50:40.000Z","authorName":"BJLIII","rating":5,"title":"Improvements","body":"Has there been improvements in this app to make it worthwhile for me to try?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6590277877","version":"1.1.5","date":"2020-10-30T14:32:55.000Z","authorName":"EMAshley358","rating":1,"title":"Inconvenient","body":"Terrible app!!! I have to continuously input my information because it deletes my car’s VIN with every update, despite selecting remember  my ID.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6590259810","version":"1.1.5","date":"2020-10-30T14:27:29.000Z","authorName":"Me the saver","rating":1,"title":"Apple Watch app no working.","body":"It’s been a while since the Apple Watch app stopped working, it keeps asking to sign in in your phone even if you are signed in, I think is about time for you to get this fixed, if you guys don’t have a technician capable of fixing this, is time to hire a real one.\nIt makes no sense to have and Apple Watch app if you can’t use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6586889931","version":"1.1.5","date":"2020-10-29T15:34:05.000Z","authorName":"NikkiBad@$$","rating":2,"title":"Not satisfied","body":"Why would you expect a customer to pay a yearly fee for an app that works half of the time? I haven’t been able to use the app for the last two days! I am so happy that I’m not paying for it because I’m still within my free year. I’m not even sure if I want to pay for this app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6586782466","version":"1.1.5","date":"2020-10-29T14:59:39.000Z","authorName":"Ddfmnnttfg","rating":2,"title":"What’s the point??","body":"Cold morning and o can’t rompe start my car...AGAIN. I will NOT pay for this again. Why is it so hard? \nMy husband never had issues with his GM app. I expected better since I have a “luxury” brand.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6586622466","version":"1.1.5","date":"2020-10-29T14:10:37.000Z","authorName":"Doma2k","rating":1,"title":"Worst app ever","body":"Lexus needs more professional App Developers. It’s like the car designers are developing the App. Updates to the app often break functions or features that use to work in the previous version. Why not completely test the upgrades before releasing them. Additionally, the app is very basic with only generic and hardly useful features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6584864235","version":"1.1.5","date":"2020-10-29T01:38:19.000Z","authorName":"nikkim1234","rating":1,"title":"Non-functional","body":"Obliviously this is an issue that still hasn’t been resolved. I use the Lexus app on my iPhone as well as my Apple Watch. Until the new update the app functionality for both was fine. After the update the app is useless on my Apple Watch and I can only use it on my phone.  It’s taking up space. I am very disappointed, especially since I am paying for this feature via Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6581597031","version":"1.1.5","date":"2020-10-28T03:53:47.000Z","authorName":"ph121694","rating":1,"title":"Phap","body":"I have had this app on my Lexus GX460 2017 but only working half of the time. I won’t buying Lexus again.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6579937184","version":"1.1.5","date":"2020-10-27T16:23:03.000Z","authorName":"neitm","rating":2,"title":"How an app should not be.","body":"This is by far the most horrible app I have used.  The old Lexus remote app was much better in appearance and functionality. Why was that discontinued and replaced with this slow, error prone app, I have no idea.  The app seems to be hanging with the message ‘in progress’ for a long time even after the requested operation has been complete. Please bring back the old app and scrap this ASAP.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6578079579","version":"1.1.5","date":"2020-10-27T03:56:02.000Z","authorName":"Zeapple","rating":1,"title":"really","body":"toyota may be the most reliable carmaker out there but in coding they sure are the last ones,cannot even log in into the app since at the time of typing the vin it freezes and crashes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6576726719","version":"1.1.5","date":"2020-10-26T17:58:41.000Z","authorName":"trb75252","rating":1,"title":"Buggy","body":"Why do they bother putting out this app? I can’t really tell you if it is useful because it won’t let me use it. I entered my VIN, and even though it found my car I couldn’t continue using the app without calling some phone number. Not worth your time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6575352223","version":"1.1.5","date":"2020-10-26T09:39:14.000Z","authorName":"KTDids","rating":1,"title":"Disappointing","body":"I was excited about the app but $80/year is unacceptable for something that should be free with purchase of the car. It’s like the $400 charge to keep the navigation maps updated. You either believe in customer comfort & safety or you don’t. I hope Lexus learns to follow the lead of companies that recognize a free app adds to a buyer experience, loyalty & recommendations to others. It’s a safe & comfortable car. Make us a customer for life.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6574550399","version":"1.1.5","date":"2020-10-26T02:37:41.000Z","authorName":"Pink_diamond33","rating":2,"title":"It’s terrible","body":"Brought a 30 day subscription on September 13 and October 8 I sad let me go ahead now and renew as soon as I did it the app logged me out then could not use my subscription for about 4 days . Now October 23 I go on the app to start my car and it’s telling me I have no active subscription and to purchase one. I keep having there issues they take my money but I can’t use it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6574197197","version":"1.1.5","date":"2020-10-25T23:55:19.000Z","authorName":"Zargar66","rating":1,"title":"The app is not working","body":"Hi For almost two months since new version of this App came out I can’t sign in and I called to customer service they checked out and an issue still not resolved ,and I keep paying money for remote control services","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6573930004","version":"1.1.5","date":"2020-10-25T21:53:13.000Z","authorName":"Inhisimage1","rating":1,"title":"Not working","body":"I upgraded to iPhone 12 and app is not working. Tried to reset password, but never receive confirmation text.  Tried numerous times.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6573104468","version":"1.1.5","date":"2020-10-25T16:38:53.000Z","authorName":"shoecanoe","rating":1,"title":"App change a disaster!!!","body":"When I bought my NX last year I was baffled why there were four separate apps to do all I needed. Happy when this new app was to roll\nAll into one. Ugh should have stayed with old ones at least they let me login to my own account. \nHave spent so far also 5 hours on multiple attempts to login to new app. Can log in on my laptop but the app says I’m not authorized. Purchased my car with my husband as co owner.  Sexist salesman listed my husband and all his info. Now I can’t login because they say my email is not on the account. Car is titled in my name.  Spent 2 hours on a call to tech support. No change. Did a second call, did the SOS stuff, deleted\nApp and reinstalled on all my devices. No change. I am PAYING for the remote service but can’t access. \nSeriously why are you making it so hard?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6573027019","version":"1.1.5","date":"2020-10-25T16:12:44.000Z","authorName":"mad in minny","rating":2,"title":"New Lexus Enform app","body":"I too upgraded to this new version.  It is very unreliable.  After several attempts I was able to lock my doors, but could not remote start the car, kept getting notices that something was preventing this..I.e doors unlocked, sun roof open etc.  but after a day it finally worked on the 4-5 attempt.  I purchased my brand new Lexus for quality, service and peace of mind.  The app to support the car are light years behind the service level I expect.  What gives Lexus?  Very unhappy and frustrated customer.  And you want to charge me $160 for this opportunity on a yearly basis?  It should be complementary until it actually works each and every time.\nPlease help!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6572637291","version":"1.1.5","date":"2020-10-25T14:01:56.000Z","authorName":"11tazzG","rating":2,"title":"I watch app","body":"This app use to work find know is not working it ask to opens the app at my phone in order to work . I have done it severa time turn off both devices to see if they will link up and no respond on my Apple Watch app can u fix this bug problem the app work find on my phone but will not work on the watch ps both of my devices   Are up to date thanks","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6569819353","version":"1.1.5","date":"2020-10-24T18:04:44.000Z","authorName":"78st Boys Elmhurst Queens","rating":1,"title":"You charge high end prices but app is trash 😡😡😡","body":"Before it was the inconveniences that unfortunately we had to get used to. Logging in and out. Installing reinstalling. But now my car erased and having to re-enter the vin to be told it doesn’t match your records after it pulls the correct car up. Ridiculous!!\n\nWeeks later and still the same garbage. Nobody wants your generic I’m sorry blah blah blah we want a fix. You screwed up now own up and fix it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6567913411","version":"1.1.5","date":"2020-10-24T06:19:42.000Z","authorName":"the moon salon","rating":1,"title":"Is not working on Apple Watch","body":"Please fix the problem. The application does not work on the iPhone watch from the time of the new update. Everything is beautiful and wonderful in the car. Once this application can not run the car from it, especially these days during the cold","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6567694783","version":"1.1.5","date":"2020-10-24T04:31:01.000Z","authorName":"cofidis2","rating":1,"title":"Worthless app","body":"I’ve got a new 2020 es350 and this app has stopped working (worked great for about 2 months after buying car). Won’t update location or status of my car. Can’t remote start.  My old es350 it worked fine. Please help.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6565477429","version":"1.1.5","date":"2020-10-23T13:35:59.000Z","authorName":"wuxiaoinnb","rating":5,"title":"good","body":"很好用，可以远程启动了。冬天不怕冷了","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6560502482","version":"1.1.5","date":"2020-10-22T02:17:03.000Z","authorName":"JacobNY","rating":1,"title":"Lexus messed up big time","body":"Don’t know what they did but my new Lexus app no longer works, keeps asking for vehicle vin, but is not recognized by their system. Yet they charged me the renewal fee.\n\nLexus Support: I already contacted you via email and no one responded. You ask me to use the in-app feedback, but I can’t even get that far. I log-in, then asked to add the vehicle (even though it’s already been added), then asked to confirm my vehicle and dealership, then when I press Save Changes, I’m presented with error that the vehicle entered does not match you records. It’s a 2016 NX 200t, Eminent White Pear. If you read your reviews, I’m not the only one with this problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6559887148","version":"1.1.5","date":"2020-10-21T21:26:05.000Z","authorName":"ulvazell","rating":1,"title":"Terrible","body":"Lexus has really messed up on this one. App will not save the VIN# and then it crashes...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6558172037","version":"1.1.5","date":"2020-10-21T11:14:17.000Z","authorName":"PaneinGlass","rating":1,"title":"Here’s the  Watch Solution Devs","body":"So here’s the issue with your  watches notifying that you must log into the phone app in order to use the watch app. If you log into the phone app using the full login (if you can remember your username and password) the watch app will wake up. But, the watch app DOES NOT RECOGNIZE SETTING UP THE iPHONE APP TO OPEN WITH FACIAL RECOGNITION!! You gotta sign out and sign in to the phone app longhand before the watch app will connect to the phone app.  C’mon man, fix this!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6557980906","version":"1.1.5","date":"2020-10-21T09:58:09.000Z","authorName":"mustachi0","rating":1,"title":"No excuses. Lexus, you’re 10 years behind.","body":"Why is it that this software isn’t auto renewing? The process of keeping my remote start working is unbearable. \n\nStep 1: wake up on a cold morning and discover your subscription is expired \nStep 2: enter in credit card info again\nStep 3: assume it’s working again\nStep 4: Wake up on a cold morning and realize it’s not\nStep 5: Hit SOS button in car and talk to a machine!?! This steps necessity is completely confounding.\nStep 6: Open email with code sent by SOS and enter it in your app.\nStep 7: wait another HOUR for the system to activate. Why exactly?\n\n$80 year for this BS. My dad has a Tesla model S and has been trying to get me to switch over. The Tesla is a technical marvel in comparison to this garbage. \n\nI hope Lexus understands they’re losing an entire customer base due to this terrible software.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6555484090","version":"1.1.5","date":"2020-10-20T15:40:12.000Z","authorName":"Jennie414","rating":1,"title":"Not great","body":"It amazes me the amount of money we spend on a luxury vehicle, yet Lexus can’t seem to allocate funds to a luxury app to match. The app consistently kicks me out, despite checking the box that says keep me logged in. Today, I got the special experience of logging in and continuously being kicked back to the login page. Over and over again. Deleting the app and reinstalling didn’t work. Restarting phone didn’t work. It’s just a bad app. Sometimes it works, sometimes it doesn’t. Better yet is they want you to pay for services each month when the app only works intermittently. Lexus Enform, you really need to do better. Get a better app developer.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6555403140","version":"1.1.5","date":"2020-10-20T15:13:30.000Z","authorName":"vinny0924","rating":1,"title":"Bad","body":"I just pay for 1 year enform but i can not use my app at all","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6553816860","version":"1.1.5","date":"2020-10-20T04:42:58.000Z","authorName":"YoungPetey","rating":1,"title":"Trash","body":"Utter trash","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6552170550","version":"1.1.5","date":"2020-10-19T17:17:50.000Z","authorName":"JrJ1388","rating":1,"title":"Last update destroyed app functionality","body":"Ever since the last update, this app doesn’t work. The car status details no longer update, and when I try to refresh, it spins for several minutes until timing out. I can’t lock, unlock, or start the car from the app anymore, and my last parked location won’t update either. I’ve already closed the app, reopened it, deleted it completely, reopened it and nothing worked. My iPhone is totally up to date with the newest iOS software, and the app is up to date. Literally nothing solves this issue. Please do something to get this working ASAP!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6552063470","version":"1.1.5","date":"2020-10-19T16:39:58.000Z","authorName":"LeBlancWeb","rating":1,"title":"Can’t add my car","body":"The old Lexus Driver app is supposed to be replaced by this, but if your car is older (2010 IS350C) and you don’t have any subscription services it doesn’t let you add your vehicle. All I see is my new Toyota vehicle. This means I no longer have a convenient place to look up my owners manual or any of the things the LD app let me do.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6549653644","version":"1.1.5","date":"2020-10-18T23:01:25.000Z","authorName":"GCC1961","rating":1,"title":"Won’t accept my vin","body":"New App is asking for me to re-enter my vin’s.  Will not accept either scanned or keyed, gives invalid message.  Old app was fine, fixing something that wasn’t broken...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6548670062","version":"1.1.5","date":"2020-10-18T16:20:40.000Z","authorName":"Chelsea016","rating":2,"title":"So much logging in","body":"Prior to the latest updates, I was able to open the app quickly and use my face to log in. Now it is redirecting me almost every time to the website to enter my username and password. It’s such a pain, I’d rather walk to my garage to lock my car instead of using the app. My watch app doesn’t work either. I try to lock the car, but it tells me to log in on my phone. What’s the point in having a watch app then. Please fix this!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6545551005","version":"1.1.5","date":"2020-10-17T18:14:42.000Z","authorName":"Not Well Del","rating":1,"title":"Why? Why?","body":"Why has this app changed to nothing??? Every time I go into my app, it just goes blank! It was fine before this “makes-no-sense” update! I’ve still not been able to get on! Are they going to renew my subscription for free? I don’t have time to spend on the phone to correct whatever they did.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6545071692","version":"1.1.5","date":"2020-10-17T15:28:25.000Z","authorName":"Waveydavey1968","rating":1,"title":"Not good with a used Lexus","body":"Just purchased a used Lexus and app doesn’t let me use the vehicle at all.  Tried calling and no help.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6540396112","version":"1.1.5","date":"2020-10-16T08:43:13.000Z","authorName":"GXcruising2020","rating":3,"title":"App work this go around","body":"I am a Lexus Gx driver. Got the app on 8/8/20 .I get having the system for the car it’s great for winter days and  don’t have to deal with any outside sources to install  etc. But   for a yearly subscription on a auto start  you would think this system would be a smooth transaction especially from a brand like LEXUS!! It works for me but depending on the weather the app does glitch, the lock car system will spin all day until I exit the app then says doors are unlocked when it’s locked then after I lock it says I can’t start the engine .  This last update on or around 10/9/20 actually works to lock and then again to start all in one transaction no complaints without exiting app.. this is my experience so far","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6539344383","version":"1.1.5","date":"2020-10-16T00:12:38.000Z","authorName":"PaneInTheGlass","rating":2,"title":"Phone App Ok, Watch App a Disastert","body":"Watch OS 7, IOS14, used to work fine in iOS 13, now was prompting to register a car, now prompts to log into the phone. Phone is logged into, app was deleted and reinstalled and logged into. Watch app was deleted and reinstalled. No change. Can use all functions from the phone but the watch is a disaster. What’s the point of having the watch app?\n\nYou keep telling all of us here in your responses here that your “checking into the compatibility” of the app with IOS 14 and watch OS 7. The betas have been out since July, you didn’t see this coming?  You had all this time to prepare the same as any other app devs. There have been a ton of updates but none that I have seen from you guys. For the amount of money we pay for our wonderful Lexus cars and for those that are forced to subscribe, this is a disgrace! My friends with Fords have apps that work far better.  Lexus has always been a step behind with car tech while BMW always leads the way. It’s time to hire some competent software engineers to get the job done.","voteCount":3,"voteSum":2,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6537655400","version":"1.1.5","date":"2020-10-15T13:15:59.000Z","authorName":"sammy13800","rating":1,"title":"Bad app","body":"It kick me out and need me to enter the vin again, it doesn’t work and need to call ! It is a trouble ..","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6536275130","version":"1.1.5","date":"2020-10-15T03:10:06.000Z","authorName":"Qrsr","rating":1,"title":"Loved the app on iwatch,  so please fix it","body":"Approved. Was a great use of the iwatch to \nDo you things like starting your car remotely from the watch. The last upgrade caused the disconnect where the watch requires you to login to the app on your phone first before the watch is functional. However, you are logged onto the app on the watch.... but the iwatch thinks you’re not.Tried removing the app from the watch, rebooting the watch, rebooting the phone, re-logging into the app on the phone all to no avail. The I watch app asks you to login on your phone and you already are. Strongly believe that the I watch app needs an upgrade and fixed to this bug","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6531125840","version":"1.1.5","date":"2020-10-13T15:24:17.000Z","authorName":"Silverdrmd","rating":1,"title":"Worst app on my iPhone","body":"I have complained about this multiple times and nobody seems to do anything about it. I drive my car about once a month now because of the pandemic and occasionally forget to lock my car. Every time I do this I get a notification that my car is unlocked and when I open up my app I can’t log back in until I remember my passwords. It doesn’t remember my face ID nor my passwords and it takes me a half an hour to lock the car when I could just go outside and do it by hand. This app is ridiculous has been this way since day one. When are you guys going to learn how to write software for humans. I can only say this because I used to be a software developer and did not have these difficulties with my clients. I’m getting a new car next month and it’s not going be Alexis.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6530731068","version":"1.1.5","date":"2020-10-13T13:12:50.000Z","authorName":"Lizzy_A","rating":1,"title":"This app is awful","body":"I was forced to upgrade to this app. It is perpetually spinning and won’t lock/unlock my car. Everything is super slow, and most things never end up ultimately completing the task I click. I’m truly confused as to why I was forced to upgrade to an app that doesn’t work. I have the latest software on a new iPhone. 🤷🏻‍♀️","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6527998908","version":"1.1.5","date":"2020-10-12T17:01:58.000Z","authorName":"not simpke","rating":2,"title":"Confusing","body":"My app showed me when I left the car opened. Then stopped all together??? Now I have put in the new app???? Why?onfusii","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6523939597","version":"1.1.5","date":"2020-10-11T13:02:29.000Z","authorName":"momo9151213","rating":1,"title":"C mart","body":"Totally frustrated. Used the Enform 2.0 app which was more dependable for operating the lock/unlock/start because it was mode dependable. Now it tells me it is not valid and I need to use the Lexus app. Would love to—if it would work!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6518716497","version":"1.1.5","date":"2020-10-10T01:12:10.000Z","authorName":"Armydad2002","rating":2,"title":"Don’t bother","body":"I purchased my new Lexus ES 350 29 Jan 2020. The tech guy was anxious to show me this app and how great it was. The last time the app worked was 29 Jan 2020. I have tried to update the status of the car while sitting in the car and the app failed to find the vehicle. My vehicle has about 3500 miles and the app shows 129 miles. Nothing I do makes a difference. I just updated it “again” to help with those darn bug fixes. Looks like the bugs are smarter still. I will be taking the vehicle in for its second service soon. Maybe they can fix the app at the same time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6517041011","version":"1.1.5","date":"2020-10-09T14:04:43.000Z","authorName":"ZoeysMom88","rating":2,"title":"WHY???","body":"I try to use my app, won’t allow me to use Face ID and I need to sign in. I try to sign in, but if I do I give permission for the app and web site to share my information...scary!  Now if I opt to continue with the app, I’m redirected to a website?  What’s up with all the craziness?  The app was working fine before all the updates.  The app is supposed to be a convenience not a headache! \n\nFrustrated!!!!!!!!! Fix it Lexus!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6515600298","version":"1.1.5","date":"2020-10-09T03:34:10.000Z","authorName":"boatculebra","rating":1,"title":"Don’t work Apple watch","body":"Always say please login on your phone,when is login already","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6515458587","version":"1.1.5","date":"2020-10-09T02:26:38.000Z","authorName":"1NML1","rating":1,"title":"Bring back the Enform remote app","body":"This app is horrible.  Lexus Enform remote app consistently worked.  Now with this update, the Apple Watch app says to login on your phone to use this feature. I am logged in on my phone.  Uninstalled, reinstalled, still the same error. What is the problem?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6514870368","version":"1.1.5","date":"2020-10-08T21:49:49.000Z","authorName":"Lvs2ride","rating":1,"title":"Worst Auto App ever","body":"Lexus apps are the worst. They just take up memory space on my phone, useless. It is stating go and use the Lexus app for what? It does not do a single thing... Lexus needs to improve their app services they are worth ZERO stars not even a 1 star is worth it. We are in the 21st century for goodness sakes...hire individuals that represent \"luxury\" of Lexus. The Sonata has better apps that this I compared with my neighbor.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6513604774","version":"1.1.5","date":"2020-10-08T13:54:45.000Z","authorName":"Illusion104","rating":1,"title":"Password","body":"I get never ending page loading after first loginto this app and creating password","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6513273112","version":"1.1.5","date":"2020-10-08T11:57:10.000Z","authorName":"VPLexusVP","rating":1,"title":"Messed up","body":"Stop engine timer showing after you start engine remotely and last location of the vehicle on the map showing wrong \nLocation showing that vehicle is parked on the next street Since IOS updated.\nPlease fix this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6509932557","version":"1.1.4","date":"2020-10-07T12:35:37.000Z","authorName":"geff99","rating":2,"title":"The app is inconsistent","body":"When I fist got my ES 2 months ago, I was excited to try this app. The more I use it, the more disappointing it is to use. \n\n1.  At first there was the card that showed where my car is parked. This card disappeared. I have tried everything, including erasing and reinstalling the app. I checked online for support. Nothing.  \n\n2.  The watch app does not link with my phone app.   All my other phone apps link to their corresponding watch apps. If I try to use the watch app, nothing works and I get a message to login on my phone, which I am. \n\n3.  Password. This app does not take advantage of my phone’s password storage feature. Why ask me if it should use Face ID when it does not store my password?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6508989451","version":"1.1.4","date":"2020-10-07T05:26:57.000Z","authorName":"Sam_20l","rating":1,"title":"Stopped Working","body":"Unable to use the app anymore since the new update. My vehicle information has been erased. When I try to add my vin number again, it finds my car information and it shows what it’s capable of. However, when I click save it displays a pop up message saying “the vehicle information entered does not match our records”. I have tried many ways of entering my vin including copying and pasting, manually typing it and using the snap picture ability but to no avail. It always gives me the above error message. I even tried during different times of the day...\nI am able however to remote start my car using the key fob which became available when I activated my subscription. Lexus, kindly fix the app.\n-2016 Lexus IS350","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6508175328","version":"1.1.4","date":"2020-10-06T23:18:36.000Z","authorName":"Mr C O","rating":1,"title":"Can’t Believe It!","body":"I’m not too happy with the new Lexus App. It will not support my 2008 LS460L on or after October 19th. It’s sad because all my service history will be considered as junk. I’d pride myself with the use of Lexus services. That’s how I do my business whether it’s major service, tires, ordering parts, etc. Why? All because my Lexus IS 18 years old (and it runs just as good as a new one!) I hope the developers make an exception. If you (the developers) are seeing this, please advise how I can get all my service history data. In the meantime, please reconsider your position on excluding 2008-2009 Lexus vehicles for the thousands of customers who still drives their 16-18 year old vehicles. I know it’s not going the happen, but at least I’ll hope that you do until October 19th. Sorry about your new app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6503832654","version":"1.1.4","date":"2020-10-05T17:20:50.000Z","authorName":"radman2008","rating":1,"title":"Login not responsive.","body":"Frustrating. I get notifications all the time but have no idea what the problem is without logging into the app on iPhone. \nBetter if it gave the error without having to log in. \n\nI have gotten in before on this phone. It works on my wife’s phone. Just a dead screen. Tried multiple times","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6499779457","version":"1.1.4","date":"2020-10-04T14:23:12.000Z","authorName":"JJKdudette","rating":1,"title":"Features don’t work","body":"Have been trying to keep the curfew hours to save to 11pm-5am for a selected profile and it repeatedly changes back to 7pm-1am.\nIf these features can’t be changed then it shouldn’t be feature. Static requirement is not a feature.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6498218341","version":"1.1.4","date":"2020-10-04T04:06:40.000Z","authorName":"HisQueenKD","rating":1,"title":"Remote start","body":"Remote start was free at one point 3rd Lexus. Now u have to pay and the app don’t work correctly. It’s been like that since 2018 off and on!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6496769674","version":"1.1.4","date":"2020-10-03T18:05:26.000Z","authorName":"Glock top shot","rating":1,"title":"Useless app","body":"The old app I could check status remote  start.  etc. this new piece of sit keeps sending me to another Lexus site.  Then I can not sign in as it says enable cookie.  Duh this is a new iPhone. Lexus  seems to not understand software has to be useful. I have paid for service I am not getting. Shame on Lexus. Scam","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6496734478","version":"1.1.4","date":"2020-10-03T17:53:48.000Z","authorName":"next car will be audi","rating":1,"title":"App broken","body":"Like, others the latest update once again breaks the app, wiped out data, now VIN says not validated. Don’t ask me to call with more details, the problem is your app and you have the info from many others. Just fix the app....and stop making “improvements”...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6496270166","version":"1.1.4","date":"2020-10-03T15:22:03.000Z","authorName":"Atlanta streaker","rating":1,"title":"Not accepting my vin number","body":"I have used this for a while and loaded the new version today.\n\nIt does not pull over my info. It ask for my vin number and does not recognize it. Now I cannot use the software at all.\n\nNext day it worked fine after I re injected it with car.\n\nNow it is not working again","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6496065224","version":"1.1.4","date":"2020-10-03T14:21:13.000Z","authorName":"Azersw","rating":1,"title":"Horrible - keeps logging me out","body":"App is not convenient . Keeps logging me out so I have to sign in every time I use it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6494935924","version":"1.1.4","date":"2020-10-03T07:26:33.000Z","authorName":"Kaze916","rating":1,"title":"Worked until the most event update!","body":"I have a 2020 Es350 and have been using this app to lock, unlock and even start my car now all of a sudden when I log in the app tells me the app is no longer supported on my device that is running iOS 14. Now when I go through the App Store there is no longer a app that controls these functions. This definitely needs to be fixed ASAP. Rating the app 1 star.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6494513284","version":"1.1.4","date":"2020-10-03T04:17:51.000Z","authorName":"Scottana","rating":1,"title":"Pathetic app","body":"Once again, another update and now I can’t login from my app! I can login to the Lexus drivers website, but the app can’t login to the Lexus drivers website.Why would I get this stupid message every time the Lexus app needs to login via the Lexus drivers website. I have other apps that  sync to my websites that don’t give me this stupid message. When you call Lexus tech-support they act like they’ve never heard of this problem before, when it’s been ongoing for over a year for several customers. They will never FIX this problem! I’m stuck with two cars and tech I can’t use. Lexus  should call GM and ask them how they set up their app because GM’s apps works better than Lexus app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490975658","version":"1.1.4","date":"2020-10-02T05:38:23.000Z","authorName":"mecarboy","rating":1,"title":"How can you wreck an app","body":"You let Lexus Toyota update it.  This “improved” version is pure junk.  Hard to read, no color coding.   Just pure garbage.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490753987","version":"1.1.4","date":"2020-10-02T03:59:00.000Z","authorName":"Michaels Family","rating":1,"title":"VIN number","body":"I just updated the app. I go through the ID and password. Then it asks for the VIN number. I put it in and save and get msg that the vehicle information does not match our records. I just used it this afternoon before the update. I also miss the Trip A and B miles.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490691387","version":"1.1.4","date":"2020-10-02T03:31:15.000Z","authorName":"T. Grand","rating":1,"title":"Garbage","body":"Use it everyday now all of a sudden I cannot sign in. Keeps asking for a VIN but won't accept the VIN I entered in. Checked online and confirmed \"my garage\" still has my 2019 ES 350 Luxury Edition. And please don't reply with \"Please use the app feedback to address concern\" want to know why? Because we cannot get to it morons! Can't sign-in remember?!!? Keeps redirecting to the enter a vehicle vin like a piece of crap app that it is! If Lexus is luxury than I am really scared to find out what standard class is because this is not luxury!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490669155","version":"1.1.4","date":"2020-10-02T03:22:05.000Z","authorName":"Jay Lowman","rating":1,"title":"Absolute Mess","body":"I have thoroughly enjoyed my experience with my 2019 Lexus NX, apart from the terribly integrated Lexus Inform software. \nThe software offers great features WHEN it works which is approximately 20% of the time in my experience. For example, I live in Colorado and love the remote start feature during the cold winter months. However I frequently have to attempt to start the car 3-4 times before it will actually go through. And sometimes it actually goes through, and says that it didn’t! \nBut with the last update was the last straw for me. After downloading the update I was required to re-verify my vin number, which I did. The app loads the vin, correctly identifies my car, and then upon clicking save says errors that the information provided “does not match the records on file”, and tells me to CALL Lexus or to visit the dealership. \n\nAs a software engineer myself, these kinds of bugs are absolutely unacceptable and will be the reason I choose a different make of vehicle with better software integration on my next purchase.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490571419","version":"1.1.4","date":"2020-10-02T02:42:15.000Z","authorName":"Mook95444","rating":1,"title":"Frustrating","body":"This app is both the most expensive and most frustrating to use, not good combination. The communication to vehicle to execute commands takes a long time and then you need to force close the app and reopen to execute a new command. Now today I had to re log into my account and my vehicle was not there and when I took the time to look up the vin and renter, it says it’s not linked.  Really frustrating especially after paying so much $ for the app to begin with.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490561860","version":"1.1.4","date":"2020-10-02T02:38:06.000Z","authorName":"strauty","rating":1,"title":"Horrible app","body":"Updated my remote app this evening. When I logged in it tells me to add my vehicle by scanning the VIN. When I scan it I get a pop up message that my information doesn’t match your records?  I guess I know I won’t be renewing my remote features next month.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490559715","version":"1.1.4","date":"2020-10-02T02:37:12.000Z","authorName":"MrIncognito2U","rating":1,"title":"A worthless App","body":"I have never had a more worthless app.   Doesn’t work as advertised.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490501744","version":"1.1.4","date":"2020-10-02T02:13:03.000Z","authorName":"Sunrayburn","rating":1,"title":"Really needs professional help","body":"This app is causing me a lot of trauma over four years I’ve seen it go through multiple versions and every time there’s an update something else goes wrong I just downloaded the most recent app and tried to get back into my car and it doesn’t recognize my vin or me or my ID or anything \n\nit’s unbelievable you guys really got to figure out how to do upgrade seamlessly and cause drama and trauma to users I’m glad you’re not right in the code that runs the car This app is causing me a lot of trauma over four years I’ve seen it go through multiple versions and every time there’s an update something else goes wrong I just downloaded the most recent app and tried to get back into my car and it doesn’t recognize my van or me or my ID or anything it’s unbelievable you guys really got to figure out how to do upgraded seamlessly and not cause drama and trauma users I’m glad you’re not right in the code that runs the car","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490484232","version":"1.1.4","date":"2020-10-02T02:05:36.000Z","authorName":"Rockshox0905","rating":2,"title":"Updates break the app","body":"What a horrible app. Half of the time it doesn’t connect to my vehicle. You have to send commands multiple times before they work. Takes too long to connect and execute what you’re trying to do (i.e. lock doors, remote start vehicle, etc.). The final kicker is you update the app and you lose all settings even though you’re registered to Lexus’ website. Settings should be stored in the cloud. Come on Lexus. You can’t do better than this?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490185488","version":"1.1.4","date":"2020-10-02T00:05:51.000Z","authorName":"Gsdhnejxiebd","rating":1,"title":"Worked great for the first year, now I haven’t been able to use it for about 8 months","body":"The original enform app, while clunky and outdated, worked great. The “new” Lexus app started out awesome, and has gone downhill from there. It’s gotten to the point where whenever I try to sign in, it will ask for my VIN. After that it tells me that I need to call Lexus as my “information doesn’t match our records”. I have contacted them on multiple occasions and they say its a known issue and that a fix is in the works. I have to admit that I’m frustrated that I pay for this service as it has become absolutely useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6490135854","version":"1.1.4","date":"2020-10-01T23:45:36.000Z","authorName":"tywmbw","rating":1,"title":"Cannot add Vin","body":"I paid for the subscription and still\nto use it until today. Try to remote start my car then the APP asked to add the vehicle again. \nAfter added the VIN number, it said the VIN entered for this account could not be authenticated. This is so confused. My subscription still valid!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6489892936","version":"1.1.4","date":"2020-10-01T21:59:32.000Z","authorName":"Davidl3940","rating":1,"title":"New Update","body":"Lastest update on my Lexus App for my iPhone was downloaded today.  It wiped out all old data on previous app.  I started to re-enter my vin # on my 2019TX450H. An error message kept coming up saying to call this 800 number.  I called them and they said they had heard of issues but they had repair. Said they would pass it on. ??????  I would have thought Lexus would have put out a product that would work!!\nDon’t know when it will be repaired.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6489196135","version":"1.1.4","date":"2020-10-01T17:11:56.000Z","authorName":"J Tawlian","rating":1,"title":"Not happy with this app","body":"Totally useless app. It doesn’t work most of the time. \nI tried again today to start the engine and it did not work. Had problems with unlocking also","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6489139029","version":"1.1.4","date":"2020-10-01T16:51:44.000Z","authorName":"jgkmd","rating":1,"title":"Wasn’t particularly useful to start...","body":"Now with the Oct 1, 2020 update, the app no longer works at all!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6489069905","version":"1.1.4","date":"2020-10-01T16:28:06.000Z","authorName":"rama of the jungle","rating":1,"title":"Lexus Enform Update","body":"in regards to your update of your Lexus Enform it is a miserable failure first of all I had difficulty trying to upload the new version finally had to call LEXAS person by phone to help me load the new version the new version is poorly conceived and hard to read where is the previous version everything was clear sharp and easy to find information the new version has very small printAnd it’s difficult to read I know… But you need to update the app but at least Make it easy to read my car’s information hopefully if you go to a new version that you will look at these things that make it a rating of only one star","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6489051208","version":"1.1.4","date":"2020-10-01T16:21:52.000Z","authorName":"pilot625","rating":1,"title":"Doesn't connect without Enform 2.0","body":"Used to work fine.  Update today broke all app services.  Now the Enform 2.0 doesn't work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6488839995","version":"1.1.4","date":"2020-10-01T15:13:08.000Z","authorName":"Me from CT","rating":2,"title":"Remote app suggestion","body":"It would be awesome to be able to roll up windows or close moonroof via the app, if you detect that you forgot to do so after leaving the vehicle. Discovering these situations via the app and not being able to cure situation makes app useless other than the knowledge that vehicle is not securely closed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6481966201","version":"1.1.3","date":"2020-09-29T19:22:33.000Z","authorName":"rgunson","rating":1,"title":"Privacy","body":"I paid for one year of service after free service provided at lease. Three months to go on my contract, use of the new app requires me to allow the app and website to sell my information.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6481405301","version":"1.1.3","date":"2020-09-29T16:00:36.000Z","authorName":"Jenn 108","rating":1,"title":"Do NOT update","body":"My old app worked. I updated and now I can't log in. I'm glad I didn't renew my subscription. This app doesn't work anymore! The keyboard pops up but doesn't actually type so you can't log in. So frustrating!!!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6481139030","version":"1.1.3","date":"2020-09-29T14:31:12.000Z","authorName":"E_absolute","rating":3,"title":"Works with iPhone but not the Apple Watch","body":"Love the new interface. However, the app is not working with the watch anymore. When I go to start or unlock/lock my car it says “please add a vehicle.” I am signed in on the phone so that’s not the issue. \n\nPlease fix.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6479155645","version":"1.1.3","date":"2020-09-28T23:47:03.000Z","authorName":"nothappyreno","rating":1,"title":"Broken","body":"Was just forced to update the app now can’t even get the sign in screen ti work. Can’t enter password!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6479154758","version":"1.1.3","date":"2020-09-28T23:46:42.000Z","authorName":"basicz","rating":1,"title":"Well...","body":"I don’t think I’ve ever written an one star review on the App Store so this is a first because I am absolutely frustrated with this junk. I have been trying to log in for the last 20 minutes after multiple attempts to reset the password, creating new ones then was left stuck on a screen that says once reset the password and write it down. I understand the app is not making Toyota big bucks but come on it’s 2020.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6476688712","version":"1.1.3","date":"2020-09-28T07:24:59.000Z","authorName":"Schizzo Lexus","rating":1,"title":"I can’t add VIN","body":"I bought Lexus IS 300 2019, and can’t add VIN to the app. To any Lexus app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6472454323","version":"1.1.3","date":"2020-09-27T01:20:54.000Z","authorName":"smith2576","rating":1,"title":"It does not work","body":"Nothing works and I am paying for this???\nThe old app worked fine","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6470684997","version":"1.1.3","date":"2020-09-26T13:52:03.000Z","authorName":"Mkmac1000","rating":1,"title":"Pathetic","body":"Old marginal app disabled and new app does not work.  Two calls to Lexus contract support and they cannot figure out why it does not work with my 2019.  Contract support cannot reach out to me either by phone or email as, “they can only email customers regarding cancellation. and are not allows outside calls”  Thus if I want this app functionally I have to continue calling to check if they have figured out the issue.   If I really did not have a use for remote start would give up on it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6464245720","version":"1.1.3","date":"2020-09-24T17:36:55.000Z","authorName":"Savvy User","rating":1,"title":"Good Idea, Poor execution","body":"The iPhone app works sporadically, sometimes completing tasks correcting, sometimes completing tasks and continuing to show spinning wheel, and sometimes not doing anything. Apple Watch app displays “Please add a vehicle.” I’d like to use either device, but the software is problematic.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6461629592","version":"1.1.3","date":"2020-09-24T00:06:56.000Z","authorName":"Mdfoust","rating":1,"title":"Major Problems","body":"Have taken it to dealership 3 different days & still doesn’t work. They said it’s on the app side, with problems. Won’t lock, unlock or start plus  keep getting messages that it’s unable to work at this time. Look how many times they have tried to fix it on updates in the past 7 months & still doesn’t work!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6458643508","version":"1.1.3","date":"2020-09-23T04:53:50.000Z","authorName":"StevenWUWUWU","rating":1,"title":"Such a useless app","body":"This is my first lexus car and I feel very disappointed \nThe car system is really hard to control \nDon’t even think to control it when you are driving \nThis app completely useless\nI won’t be a return customer for sure \nI should get BMW or other same lvl car","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6457300680","version":"1.1.3","date":"2020-09-22T19:20:32.000Z","authorName":"ProfoundRay","rating":1,"title":"Logging in issues","body":"Every time I try to login after typing my password, I get sent right back to the login screen, the app won’t login","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6455784179","version":"1.1.3","date":"2020-09-22T10:50:45.000Z","authorName":"cordelia84","rating":2,"title":"Lexus Remote App","body":"After updating to iOS 14 my Lexus Remote App is not working. Anyone else having this issue?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6455143260","version":"1.1.3","date":"2020-09-22T05:43:53.000Z","authorName":"lizardflaco","rating":2,"title":"Bad","body":"Just got a Lexus and was happy to hear about the app and it’s capabilities. The potential of this app is there but not executed. Every other time I attempt to enter it stalls and will not let me in. At other times it acts like I’ve never registered a vehicle or simply locks up. The Apple Watch component asks that I add a vehicle or tells me to connect via the phone app. The watch app tells me my fuel but will not start the vehicle and when I try it says there’s no vehicle connected. For Lexus to be such a luxury vehicle, this app gives your company a bad name. I should have tried this app out before I signed. Please fix your app for the watch (series 6) and iPhone 11 Pro Max. Also add features like virtual car keys through wallet like BMW has. Please don’t make me further regret my purchase and fix this. Your customers pay lots of money for high quality and this couldn’t be further from that.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6455091029","version":"1.1.3","date":"2020-09-22T05:17:43.000Z","authorName":"thedudewtf","rating":1,"title":"Re: why make us download a new app?","body":"What kind of dog sheeeeit is this app?!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6454100376","version":"1.1.3","date":"2020-09-21T21:50:23.000Z","authorName":"mizza37","rating":1,"title":"Never worked for brand new 2020 RX","body":"App never worked since buying a $60k car. Been 4 months and Lexus keeps saying “we do not have an ETA yet.” Translation: we aren’t really trying. Pathetic.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6443172022","version":"1.1.2","date":"2020-09-18T21:46:34.000Z","authorName":"dnelon","rating":2,"title":"What is the Point","body":"The only thing I really NEED this app to do is allow me to start the vehicle remotely. The other things are interesting and “nice to have” but what I want for sure is remote start.  Now, it defeats the purpose of having an app if it forces me to manually sign in almost everyone I try to use it. And to make things worse, it sends me to a browser page to do it instead just letting the app handle the redundant login. If that is going to be required, why have an app on the first place?  Just send me to a webpage to start the car. Further, I do not need a notification to tell me to go check the app. If the system can send push notifications it should be able to tell me what the issue is in the initial notification like every other app I have ever used seems to be able to do.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6442798566","version":"1.1.2","date":"2020-09-18T19:14:07.000Z","authorName":"Sheri - NX300","rating":1,"title":"Experience Amazing is what the Lexus tv commercial says","body":"When I updated this app, everything stopped working.  Notified Lexus on various occasions with no success.  It’s really not an amazing experience!  Please resolve this issue ASAP!  I should not be experiencing issues like this for the amount of money I am paying Lexus for my car and the perks that are offered.\n\nNOT AMAZING!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6442008599","version":"1.1.2","date":"2020-09-18T14:48:45.000Z","authorName":"gertee1(Mary )","rating":2,"title":"Needs improvement","body":"I just bought my first 2020 Lexus NX 300. They told me to download this app. I did. I drove my car twice before my son came home from California. He was here 13 days and drove my car. When I finally looked at the app I was shocked!! All high numbers! He used my fob and I didn’t sign him in as a guest. There’s no way to erase these high scores!!! I’m speaking of harsh turns, etc..I’m disappointed because I’m 68 years old and a very safe driver!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6436637609","version":"1.1.2","date":"2020-09-17T00:32:09.000Z","authorName":"lindy111111","rating":1,"title":"Does not stay logged in / forces me to create new password","body":"It’s baffling how Lexus enform was working very well ... and every since I was forced to migrate to this app, I have only been successful in signing in once! I can log into my account with my credential via a website on a desktop just fine, but using this app, which reroutes to you a website to log in, it seems to ask for my email every time, verify my email with a code, and then create a NEW PASSWORD. Why? I can log into my account on the deskto, why do i need to create a new password? Also, once I am log in, it says the vin I’m trying to connect with my already linked account requires special attention, and call a phone number.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6436093387","version":"1.1.2","date":"2020-09-16T20:18:03.000Z","authorName":"Super:Woman","rating":1,"title":"Extremely Frustrating","body":"I purchased Enform through the app. First, I didn’t receive the activation or authorization code. Called SOS to help which led to tech support or whatever to reset the code. Finally got the app to do something. I was told to drive around for 15 minutes to link up all systems. After I drove for 15 minutes, the app magically refresh and I lost my subscription. I called support again, they don’t see my subscription so I had to resubscribe and repay for the subscription! In following, I ran into  “remote activation error”. Called support AGAIN and no one was able to help. A “ticket” was put in to see what the issue is and I won’t hear from Lexus until the next 3-5 days. This is bull and the most inconvenient technology. At this point, I just want a refund.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6429737548","version":"1.1.2","date":"2020-09-14T23:28:16.000Z","authorName":"Lance baby","rating":3,"title":"Not bad. However.....","body":"Ok so the app isn’t bad. The restrictions you can put in place for certain driver profiles are pretty neat. It’s simple and not difficult to use. That being said it updates far too infrequent for me. If my teenager is out and I’m curious where the vehicle is parked because she hasn’t answered her phone. It can be pretty useless. Example. It’s 7:30 and the vehicle was last updated around 4pm when I was in another town. If it could store activity for the day that would be great. The app is not bad at all. However not sure if all the features are worth the money since it doesn’t update frequently. The connecting speed is great. When you lock or start the car. Doesn’t take long at all. That aspect is great. I hope this gets worked on. Definitely something I’ll consider on my next vehicle. Everything is wireless now. Kind of a big deal.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6429290129","version":"1.1.2","date":"2020-09-14T19:51:27.000Z","authorName":"Tutsygirl","rating":1,"title":"Terrible app","body":"This has to be the worst app ever!!!! I’ve had my car since February and this app at best works maybe 50% of the time. It’s infuriating to say the least. It does not connect to my vehicle so I can remotely start, only on some rare occasions. The last time it supposedly connected was 15 days ago. The most consistent thing that it monitors is the most recent trip, every thing else is off. They need to give this app a complete overhaul. The previous app worked more consistently on my last car. Not a happy customer. Probably won’t be paying for it after the trial period.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6420232491","version":"1.1.2","date":"2020-09-12T04:42:07.000Z","authorName":"Grannyxo","rating":1,"title":"Seriously!","body":"I logged into my former Lexus app and it stated that this app was shut down September 8th and no longer available. I was guided to open this new Lexus app. It doesn’t work! It will not start my car remotely or lock or unlock the doors. Now what It’s useless?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6419715918","version":"1.1.2","date":"2020-09-12T01:07:10.000Z","authorName":"reezyH","rating":1,"title":"Remote Functions stopped working","body":"New app released several months back now I can’t get any remote features to work for my 2015 GS","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6419263411","version":"1.1.2","date":"2020-09-11T21:43:51.000Z","authorName":"rrrrrrrrrrrrrooo","rating":1,"title":"Ron","body":"Lexus Enform changed to new\n App. However the new app does not\nHave any information on my Lexus!!\nAnd I cannot access anything about the Lexus?????\nIt does give information on my Camry only!! ???? \nPlease advise.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6414848597","version":"1.1.2","date":"2020-09-10T14:30:49.000Z","authorName":"ishines","rating":1,"title":"Does not work","body":"I have a 2020 ES 350. I’ve called multiple times to active remote access. It never activated and I’ve gotten a different story every time I’ve called. The last person finally told me there was an update needed and I need to take my car to the dealership to update.  Made an appointment will see if that works. Very frustrating and disappointed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6412949939","version":"1.1.2","date":"2020-09-10T00:33:04.000Z","authorName":"Dirk Haggan","rating":1,"title":"Doesn’t work","body":"I have had my car for app most 4 weeks now and every time I try to log in it says it can’t authenticate my VIN.  I traded in a GMC and never had a problem with my phone app.  I was expecting a lot more from Lexus.  Ever time I call I’m told they are working on it.  4 weeks seems like a long time to be working on it.  I love my new Lexus this is just putting on damper on my first time ownership excitement.  I got a new toy and I can even use it.  🙁","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6412942241","version":"1.1.2","date":"2020-09-10T00:29:39.000Z","authorName":"lexus rx350","rating":1,"title":"Park location","body":"While Lexus makes great cars. The driving is comfortable and quiet, but I can’t say the same for the Enform app.  Even after I brought to dealer for software upgrade, the parking location work sometimes.  Wish there was a zero star.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6412704723","version":"1.1.2","date":"2020-09-09T22:43:59.000Z","authorName":"Missmba","rating":1,"title":"Horrible App","body":"I’ve been trying for weeks to get this app to work with no luck. It isn’t updating, sending any notifications, lock/unlock doors or start my engine. My subscription is active so I’m not sure what is happening.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6410164792","version":"1.1.1","date":"2020-09-09T05:22:03.000Z","authorName":"Stylesdeluxe","rating":1,"title":"This app is Disappointed","body":"So I my Face ID didn’t work for 3 tries now I gotta put in my password and guess what when I try to click on the part to put in my email the keyboard is bigger than the screen and there isn’t a way to shrink it, I’ve tried, trust me!!!!!!!!!!!! perfect!!!. why does your website have its own keyboard in the first place?!? Oh and you can’t use Safari to log into the website cause it doesn’t register the domain","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6408905947","version":"1.1.1","date":"2020-09-08T19:45:00.000Z","authorName":"Hlady64","rating":1,"title":"Unimpressive!","body":"Dull, expected a better presentation from Lexus.  I guess it does what it is supposed to, that the reason for the 2 star.  However, images appear faded and unimpressive👎🏼","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6379552749","version":"1.1.1","date":"2020-08-31T05:30:02.000Z","authorName":"Asghazala","rating":1,"title":"Not working","body":"Could not use this app due to not working , downloaded the app worked only few days and was not accurate at all then stopped , talked with Lexus and tried many ways to activate but did. Ot work , received many promises to check what is going on but nothing , almost 6 months.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6373930948","version":"1.1.1","date":"2020-08-29T13:42:39.000Z","authorName":"hpyguybrian","rating":3,"title":"WiFi issues","body":"Not a bad UI or anything like that.  If you can login it’s fine. But functionally it is a very portly tested App. It won’t work in some WiFi networks, so I can’t even login when I’m at work unless I turn off WiFi. That’s really not acceptable when you’re also paying good money for subscriptions to use services. This needs to be addressed before the old versions are discontinued. Do the right thing Lexus.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6370115359","version":"1.1.1","date":"2020-08-28T12:43:50.000Z","authorName":"Fresa.4.Life","rating":3,"title":"IS BLACKLINE EDITION","body":"App works just fine to my needs; however, I LOVED how 3-4 updates ago I saw my actual IS BLACK-Line edition as the picture in my app, instead of a regular IS that it’s showing currently.\nAre we can bringing that feature back?\nOther than that, works just fine. Thank you.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6368572559","version":"1.1.1","date":"2020-08-28T02:20:23.000Z","authorName":"4zapu","rating":1,"title":"Not user friendly like Enform","body":"Doses not offer PIN number setup new look is poor not attractive \nIf you buy  high end car  ready to pay. Yearly subscription!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6368354607","version":"1.1.1","date":"2020-08-28T00:50:49.000Z","authorName":"marcomadapp","rating":1,"title":"vin not authorized for this account","body":"FIX IT!!!!!!  it still doesn’t work!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6360338091","version":"1.1.1","date":"2020-08-25T19:21:07.000Z","authorName":"Gamer Reviwer_2019","rating":1,"title":"Won’t let you sign in","body":"For some reason the app won’t sign in even after entering your credentials","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6359869612","version":"1.1.1","date":"2020-08-25T16:21:53.000Z","authorName":"Badapp707","rating":1,"title":"Awful","body":"Reviewed this once before but the review never appeared. The app does not work since the latest update. Pay monthly for remote starting but the ‘Start Engine’ button disappeared. Have sent feedback 5 times, no response. I mean this app is so worthless it’s amazing Lexus even makes it available, they’d be better off with no app at all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6356386966","version":"1.1.1","date":"2020-08-24T17:18:28.000Z","authorName":"Myspaceistaken","rating":2,"title":"Remote Start works 10% of the time","body":"For a luxury vehicle, it’s disappointing when you cannot rely on your remote start to work especially when you live in the south and have a pet in the car.  My son’s 2016 F150 pickup has a reliable remote start in the key.  I wish we didn’t have to use an app for this feature as it rarely works for me.  It takes too long to contact the vehicle especially in the heat.  Please improve this service or add the feature to a key fob.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6355567721","version":"1.1.1","date":"2020-08-24T12:45:05.000Z","authorName":"mls326","rating":1,"title":"**THE WORST APP**","body":"Lexus should be embarrassed!\nThis does not work...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6349475247","version":"1.1.1","date":"2020-08-22T18:03:45.000Z","authorName":"mmiami","rating":1,"title":"Complete trash","body":"I wasted 20+ minutes in a very poorly DESIGNED unfriendly app. Like many of the electronic Lexus features, not good at all Not intuitive. Must have been created by novices or for other mindset. Just like navigating the unnecessarily compñex dashbord links for sound, Bluetooth and other car controls. \nIf the cars were like the apps or the electronic board in them I would simply switch brands. We’ve used Lexus from the beginning. \nWake up and try your apps and inputs before advertising an app that won’t deliver. \nAfter going through all the safety barriers, the system couldn’t verify my VIN. It asked me to call Lexus!  That did it. I can’t try anymore.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6347061403","version":"1.1.1","date":"2020-08-22T02:51:25.000Z","authorName":"Kik1958","rating":1,"title":"Useless app","body":"Received no notification that old app was being replaced. Downloaded new app. Doesn’t recognise my VIN. \nMaybe it’s time to retire a 6 yo car that Lexus doesn’t recognise and get a different brand.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6342677493","version":"1.1.1","date":"2020-08-20T22:08:13.000Z","authorName":"RDriver22","rating":1,"title":"I agree with Truly Baffled","body":"Why have you removed significant functionality from the revised app?? Vehicle Finder was a function I use frequently and it is now gone! Why??","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6342319827","version":"1.1.1","date":"2020-08-20T19:29:26.000Z","authorName":"justap77","rating":1,"title":"Very annoying, keep getting signed out","body":"Same problem I had with previous app before they switched to this new one.  I use the app primarily for remote start.  I sign in, enable FaceID, and I can start the car.  Works for 1-2 days before having to sign in again, enable FaceID again.  It’s infuriating to input email and password over and over every couple of days.  I’ve used many apps that are able to stay signed in, use FaceID to unlock and use app, without putting in my password over and over.  Lexus should be able to fix this issue.  It really reduces the usefulness and convenience of the app.  Please please fix this, Lexus!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6339840587","version":"1.1.1","date":"2020-08-20T03:56:27.000Z","authorName":"Wont register car","rating":1,"title":"Doesn’t work","body":"The app won’t register my car. Horrible","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6339500504","version":"1.1.1","date":"2020-08-20T01:38:08.000Z","authorName":"canisteo99","rating":1,"title":"Can not save info","body":"When I try to sign in the app tells me there is a problem try again. Can not input info","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6336291609","version":"1.1.1","date":"2020-08-19T05:45:55.000Z","authorName":"Cool Fresh","rating":1,"title":"App does not work","body":"My app has not worked for months.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6331418727","version":"1.1.1","date":"2020-08-17T22:18:43.000Z","authorName":"the great on 15","rating":5,"title":"Review","body":"When I went to ira in Danvers it was. Great experience especially the person that checked me in name escapes me but he was great","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6326915702","version":"1.1.1","date":"2020-08-16T17:36:13.000Z","authorName":"Kristina3579","rating":1,"title":"Not working","body":"The app was very useful but it hasn’t worked on my phone for months. I shouldn’t be paying for an app that no longer works. FIX IT.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6326658886","version":"1.1.1","date":"2020-08-16T16:11:39.000Z","authorName":"MikeyP1024","rating":2,"title":"Open door after remote start kills engine. Doesn’t indicate door lock status","body":"The remote starter works. However as soon as open door or hatch kills the engine. Poor system integration and usability. In summer heat want AC to continue running while settle in. In winter when open hatch to get scraper want defroster to keep running while scrape snow off...Then minor inconveniences. No door lock status indicator. So press Lock takes 30 sec then tells me doors are locked...The worst was wouldn’t login many times at first. Tries to start a website to login. Poor design. Should use REST API and display a usable error message instead of relying on the browser displaying a generic useless HTTP error. Violates basic CS101 usability. I finally figured out required cookies enabled on Safari. So after wasting several hours was able to use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6323129518","version":"1.1.1","date":"2020-08-15T17:39:39.000Z","authorName":"dc53","rating":1,"title":"Terrible","body":"This app doesn’t work. I’ve tried for 3 months to open it but always get the same message “Unexpected error. Please try again.” So far it’s the only thing about Lexus that I don’t like. But I can use the services the app offers bc it will not open. I know the VIN I entered is correct bc it brings up the correct description and dealer name. Guess I won’t renew the services.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6316423506","version":"1.1.1","date":"2020-08-14T00:46:47.000Z","authorName":"unsuccessfil","rating":1,"title":"Stopped working","body":"Worked for 6 months the it was updated and won’t work. Don’t waste your time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6312179478","version":"1.1.1","date":"2020-08-12T23:16:45.000Z","authorName":"MaliciousV2","rating":1,"title":"Not worth a free download","body":"Wow, $20 a month to lock and unlock a car?\n\nCrazy to see Lexus being run into the ground by god knows who that is in charge.\n\nThe design and technology teams (aside maybe interior architecture and leather teams) need to be completely gutted.\n\n Lexus has to stop trying to make ugly angular cars with horrible infotainment systems. But, by the time they realize , germans will offer decent reliability and Lexus will have no piece left of the market.\n\nBye!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6311830475","version":"1.1.1","date":"2020-08-12T20:55:20.000Z","authorName":"tx77dc","rating":1,"title":"Great when it works","body":"9 out 10 times it doesn’t. What a disappointing app! Lexus, you can do better!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6308815103","version":"1.1.1","date":"2020-08-12T03:29:24.000Z","authorName":"Bobie-Sue","rating":3,"title":"App Update Changes","body":"What happened to checking the oil level in the app? Was it removed in a recent updat? I just returned from a trip and wanted to check the level and it’s no longer there. This feature is very important to someone with arthritic hands.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6308452184","version":"1.1.1","date":"2020-08-12T01:11:00.000Z","authorName":"Picnic44","rating":5,"title":"Positively surprised! Nice UX","body":"I honestly didn’t expect much and I am sorry about my hasty judgement. You’ve done a fantastic job with the app. It’s elegant, intuitive and has a very smooth UX in general. I find the Lexus adds a little distracting on the bottom, (especially XFM) but I really can’t say anything bad. Like! 👏","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6308379134","version":"1.1.1","date":"2020-08-12T00:43:14.000Z","authorName":"Mr. Pensig","rating":1,"title":"Steaming pile of garbage","body":"Can’t get SSO login to work.  Can’t get direct email account creation to work.  Can’t reset password even after getting email account creation to work.\n\nWho made this system so bad you can’t even log in, in the first place?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6308073843","version":"1.1.1","date":"2020-08-11T22:41:15.000Z","authorName":"Jayson T Shelton","rating":1,"title":"Difficult to log in","body":"While this app is generally nice when you can get into it the app requires you manually sign in every now and then for security. Fine. But when you enter your user name and password it doesn’t always recognize you. I got locked out of my app for four hours today to finally find that I had been putting in my correct info all along. Hey Lexus....fix it!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6306733397","version":"1.1.1","date":"2020-08-11T14:58:09.000Z","authorName":"Neyssa","rating":2,"title":"Not functional","body":"The app lets me sign in but does not update the vehicle I have on line. When I add the VIN it does not let me add it because I already have it. This app is useless unless it can synchronize with what is on the web.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6303871395","version":"1.1.1","date":"2020-08-10T21:54:53.000Z","authorName":"AAALovey","rating":1,"title":"App Bummer","body":"Save your time and don’t even bother finding and inputting your vin number.  This is the second Lexus for which I have attempted to activate an app with NO SUCCESS!!!  EVERYTIME I get to the end of the sign up, I get the message that an unexpected error has occurred.  I have tried multiple times, different times of the day, etc. etc., blah, blah, blah.  They promote this app when purchasing the vehicle and I was told it was new and improved, again blah, blah, blah.  I call it false advertising.  You would think they would employ programmers who could make this work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6302231340","version":"1.1.1","date":"2020-08-10T12:12:03.000Z","authorName":"Dissatisfied#2","rating":1,"title":"Updates make the app worse","body":"Every time the app has an update it says it doesn’t recognize my sign in. This is really annoying making the app and more importantly the remote start feature which I paid for USELESS.  I’m not the only one with this complaint which means it is definitely the app configuration.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6300658566","version":"1.1.1","date":"2020-08-10T01:55:47.000Z","authorName":"NX200t Driver","rating":4,"title":"New Lex App","body":"I like that the interface is more user-friendly and simplified; however, I use my Apple Watch and although it works fine, do you know if there is a complication feature? I would like to add it to my watch face as I did with the old app but it doesn’t have that feature.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6299906533","version":"1.1.1","date":"2020-08-09T20:34:39.000Z","authorName":"Mjavadipour","rating":1,"title":"Vehicle connect via Bluetooth -message on phone","body":"Message pops up on phone constantly. Impossible to operate phone while vehicle is on. Super annoying.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6299080195","version":"1.1.1","date":"2020-08-09T15:27:30.000Z","authorName":"Ppvav","rating":1,"title":"Latest update 🤬","body":"Latest update won’t allow me to sign in. Trying to force me to use an Apple Id sign in. PLEASE FIX","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6295844006","version":"1.1.1","date":"2020-08-08T18:48:10.000Z","authorName":"robfosure","rating":1,"title":"Worst lux car app ever!!!","body":"Figure it out!!!!!!!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6294982728","version":"1.1.1","date":"2020-08-08T13:54:49.000Z","authorName":"Mimay F","rating":1,"title":"Hmmm","body":"It deleted my Lexus information and i tried to out it back the information to add but keep saying error.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6291184620","version":"1.1.1","date":"2020-08-07T14:43:20.000Z","authorName":"togatown1","rating":1,"title":"Re: Too many issues for years!","body":"This app is NOT dependable and I have complained since 2017! It’s ruining the good Lexus name!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6290805486","version":"1.1.1","date":"2020-08-07T13:04:31.000Z","authorName":"Natdabat79","rating":3,"title":"Lexus Remote Start App","body":"I like the app; however I think there should be an improvement to maintain motor run condition when you attempt to access the vehicle. Just like my Toyota Sequoia; once you access the vehicle the car shuts off. My remote start on my Nissan remains on; however once you get in the car you have to press the start button and maintain connection with the key fob to drive.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6289002804","version":"1.1.1","date":"2020-08-07T02:21:12.000Z","authorName":"Dr. Tet","rating":4,"title":"Update is a bust","body":"Hope this is fixed soon, won’t let me sign in saying missing information all fields need to be completed. The only field is mobile phone number and my mobile phone number is there in the field.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6288302299","version":"1.1.0","date":"2020-08-06T21:29:39.000Z","authorName":"Joyfulgrimmace","rating":3,"title":"Missing Features","body":"Old version of the app which was discontinued had more features and information about my vehicle. For example, I miss being able to see odometer information for Trip A and Trip B, which used to be present in addition to the total mileage reading on the odometer. \n\nThis app has a cleaner UI but isn’t as feature rich as the old version.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6283130837","version":"1.1.0","date":"2020-08-05T14:19:00.000Z","authorName":"crazy c","rating":1,"title":"The park car location finder","body":"I have a 2015 GS 350... I don’t know what’s wrong with the map update of the location of my car.. I thought it work with your phone location.. I open up my phone location to see if it make a difference but it didn’t.. \nit shows that my car park at a location i left four days ago.. what’s the use...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6274700699","version":"1.1.0","date":"2020-08-03T11:50:43.000Z","authorName":"Fix this app 1234","rating":1,"title":"New App- still not working","body":"I have been trying for 5 weeks now to get this new app to work. The remote functions simply will not work. I have called the contact us number in the messages 4 times now and pushed the SOS button 3 times. No one can seem to figure out why the remote function will not work. The old app worked great. Now I am paying for a service that Lexus cannot figure out how to make work. My other two vehicles (not Lexus), their apps are easy to use and they actually function. Lexus, please fix this terrible app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6269839152","version":"1.1.0","date":"2020-08-02T05:16:19.000Z","authorName":"Rose141414","rating":1,"title":"Great When It Works","body":"I really like the idea of being able to lock/unlock and start my car remotely.  It’s really handy if I forgot something and Don’t have my key handy or if I want the heat or AC to run before I get into the car.  However, the app only works maybe 1/10 times.  The first time I brought it to the dealership and they reset everything and it worked... for about a week.  Now it’s 1/10 times if I’m lucky.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6267263568","version":"1.1.0","date":"2020-08-01T13:03:35.000Z","authorName":"DA42PLT","rating":1,"title":"Junk App","body":"More Lexus junk. \nThis app was thought up by 20 something idiot.  Are there any adults at Lexus?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6265117300","version":"1.1.0","date":"2020-08-01T00:08:04.000Z","authorName":"PediMo","rating":1,"title":"Yearly subscription of $160 expensive","body":"The most useful feature of this app is remote lock/unlock and starting the engine. Vehicle health is useful as well. Paying $160 a year for them is way too expensive and not worth it! Tesla has a better app and it’s free.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6260977371","version":"1.1.0","date":"2020-07-30T22:47:29.000Z","authorName":"LouWho999","rating":1,"title":"Slow and unreliable- why do I have to PAY for this","body":"This app is continually glitchy slow and unreliable. I don’t understand why this type of service is free with my Ford vehicles but I have to pay for it with my luxury vehicle. Not a great customer experience Lexus s!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6260597845","version":"1.1.0","date":"2020-07-30T20:08:23.000Z","authorName":"Cheeky Monkees","rating":1,"title":"Still trying to get AP working after FIVE WEEKS.","body":"I’ve called Lexus customer service multiple times. Always another story to get me off the phone. I’ve heard “service is out wait a week”, “wait two days then just hit the SOS button” and “wait 24 hours and refresh”. Nothing has worked. Pathetic. I can’t believe LEXUS management allows this situation to exist. I looked through the reviews and am shocked.\n\nUPDATE \n\nCalled Lexus App support AGAIN. Now they are telling me to take it to the dealer. They seem to think it’s a hardware issue which I seriously doubt given the in-car to Lexus (SOS) communication device works but asks for a PIN # to activate. I spoke briefly to the service manager at the dealer and he seemed very competent. Time will tell. \n\nI’m seriously rethinking my next vehicle purchase.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6259680468","version":"1.1.0","date":"2020-07-30T14:41:56.000Z","authorName":"Cortez483","rating":1,"title":"What’s the point","body":"I took delivery of a 2020 Lexus ES 350 on 4/21/20.  While there, my sales person set up the Lexus Enform system and had me download this app.  It has not worked correctly from the very beginning.  At first, I could see my odometer reading, my miles to empty and if my doors were closed and locked.  I’ve never been able to lock or unlock the doors, nor start the engine.  It’s now showing my last update to be 7/21/20, and my last recorded parking spot is from 7/24/20.  I’ve spoken with the dealership and was first told I would need to bring the car back in and they’d need it for a few hours to do a software upgrade or something like that.  I decided to wait as we were leaving on vacation.  When we got back I called and spoke to my dealerships IT guy and arranged to bring my car in.  All he did was essentially everything I had tried and he confirmed that, yeah, it’s not working.  He supposedly sent my issue up to Lexus or whomever, and that’s been a few weeks ago.  Still no resolution, still not working correctly.  Thus the title of this review.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6258043887","version":"1.1.0","date":"2020-07-30T05:11:08.000Z","authorName":"fether88","rating":1,"title":"Money WASTED on Enform Subscription","body":"I have not been able to use the Enform app since the update to this new, “improved” app. It’s been MONTHS now. I now continually get the “VIN cannot be authenticated” and the app cannot be used. Multiple calls over the last few months to customer service and it’s STILL not fixed. Lexus should be ashamed of this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6253559060","version":"1.1.0","date":"2020-07-29T01:30:36.000Z","authorName":"Austex Danl","rating":1,"title":"App is a JOKE","body":"I am now driving my 6th Lexus. This time I thought I’d enroll in Lexus Enform and use the Lexus App.  Everyone at Enform was “helpful” but after an hour and a half of trying multiple approaches I could not even log into the app. I am not an IOS novice and I have never experienced anything like this with any other app.  My recommendation to Lexus is to stick to cars or make the investment in a NEW app that lives up to the standard you’ve set for your cars.  The app should enhance the Lexus experience, not diminish it.  My recommendation to you if you’re considering this app: DON’T use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6253357432","version":"1.1.0","date":"2020-07-29T00:14:22.000Z","authorName":"Ken Dasaro","rating":1,"title":"This new app is terrible","body":"I had a remote app and when opening the app it told me it was being replaced on September 8th and to download this as replacement. I did that and this app has no remote start capability and is terrible.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6252723557","version":"1.1.0","date":"2020-07-28T19:59:14.000Z","authorName":"kluelessk","rating":1,"title":"Never worked for me","body":"I was super excited to know of this app and to be able to remotely start my car, so that it was able to be cooled off prior to me getting in. I live in FL and this summer heat is serious. Anyway, I have NOT been able to ever get my car started remotely. Is it just me? If so, what am I doing wrong?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6252586798","version":"1.1.0","date":"2020-07-28T19:05:50.000Z","authorName":"Marsdys","rating":2,"title":"Not intuitive","body":"Have been successfully using the previous app. Told the same thing as in other reviews that it was expiring so I downloaded this one and found it to be not intuitive. Some of it had to do with my human error so I updated my review. Hope to be able to make it easier for use.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6252476962","version":"1.1.0","date":"2020-07-28T18:24:48.000Z","authorName":"jsp123!","rating":1,"title":"Terrible down grade","body":"What is the point of this “upgrade”? I pay a premium for the ease of locking/unlocking and remote starting my GX460. I can not figure out how to do these basic things in the new app. This is simply an advertising platform that I have the “luxury” of paying a premium for. The old app while not perfect added value and was user friendly. This is none of those. Maintentance.... advertising. Sirius.... advertising.... Vehicle status who cares if you can’t manage from the app. What a waste.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6249561808","version":"1.1.0","date":"2020-07-28T00:50:02.000Z","authorName":"Scubanicholas","rating":4,"title":"Apple Watch complication?","body":"Updated from 1 to 4 stars. Much better than several months ago. How can I add a complication to the Apple Watch? Is that something I’m missing or are you working on it? I still have the old app installed because not all features are present in the new app. But work in progress I suppose. Pleased with the improvement, but still disappointed Lexus customers were basically beta testers for this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6245677652","version":"1.1.0","date":"2020-07-27T00:07:38.000Z","authorName":"Billybobjr.the7th","rating":1,"title":"Unusable","body":"Keep trying to register but it keeps telling me the trial period is over.  Very amateurish app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6244500098","version":"1.1.0","date":"2020-07-26T15:58:51.000Z","authorName":"grandana","rating":2,"title":"Worse app","body":"This app is worthless, the Enform was so much better. After the last update it’s even worse. It doesn’t show the mileage, the miles until empty, it also doesn’t show last trip, parking or your score. Hard to believe Lexus doesn’t have a better app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6244228190","version":"1.1.0","date":"2020-07-26T14:29:55.000Z","authorName":"Seggy23","rating":1,"title":"Updates","body":"The app has poor functionality, do you guys test the app before launching an update? If you could provide more details in the description of the update as well that’d be appreciated so we know what bugs have and haven’t been fixed cause it just seems like the app gets slower every week you push an update.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6238790103","version":"1.1.0","date":"2020-07-25T04:47:27.000Z","authorName":"TeddyP1906","rating":1,"title":"Horrible app","body":"Bought a 2020 es 350 the dealership say the app and my I phone 11 is not compatible so when I cut the car on my Apple Music goes down and the comes up loud. Come on Lexus that’s the best you can do for all the money I Pay for this car","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6234145200","version":"1.1.0","date":"2020-07-24T00:48:33.000Z","authorName":"mcaldwell_12","rating":1,"title":"Remote services do not work at all","body":"Paying for the remote services and I can’t even use it. The dashboard has said “remote activation pending, can take up to 24 hours” for two weeks now. Worked fine on the original app, ever since I was forced to switch I can’t use the service I’m paying for. I will be requesting a refund on my paid remote services because I can’t use them.\n\nUpdate: pressing the SOS button in my car did nothing for connecting to the app. I am still unable to connect my car to the app and use the remote services. Judging by the vast quantity of 1-2 star reviews, it’s pretty obvious the app needs a ton of work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6234121319","version":"1.1.0","date":"2020-07-24T00:38:58.000Z","authorName":"frank0525","rating":3,"title":"Car image not displayed.","body":"A month ago, the app showed the image of my car (2015 IS) and after the most recent updates the apps says “Image Not Found”. This has happened with previous updates where the image is displayed then after an update, it’s gone. Not like my car is a 1990 either.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6233868514","version":"1.1.0","date":"2020-07-23T22:53:22.000Z","authorName":"tmoz1","rating":3,"title":"Works sporadically","body":"I would love if the remote start worked every time I need it! Very frustrating when I have to continually press start and nothing happens.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6233154718","version":"1.1.0","date":"2020-07-23T18:00:12.000Z","authorName":"Digital AR","rating":3,"title":"Feature Missing","body":"Please add back the feature where the password is required before using any of the functions.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6233102312","version":"1.1.0","date":"2020-07-23T17:41:01.000Z","authorName":"tchmrl","rating":1,"title":"Useless unless you pay $240/year","body":"You don’t need this app. It’s useless unless you pay up to $240/ year for the services. Someone at Lexus needs to rethink the price pony on this. I don’t pay that much for Office 365 and I use that every day.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6232303613","version":"1.1.0","date":"2020-07-23T13:32:00.000Z","authorName":"DaynetWatson","rating":1,"title":"New App not visible to use remote starter","body":"The app doesn’t allow you to use your remote starter. I am paying for something and receiving the benefits of!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6229999996","version":"1.0.24","date":"2020-07-23T00:00:09.000Z","authorName":"goog de stuff","rating":1,"title":"No improvement","body":"Previous app you could use 4 number code to access. Not available in this","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6229913694","version":"1.0.24","date":"2020-07-22T23:26:54.000Z","authorName":"JHGraves","rating":1,"title":"What’s up???","body":"Where is all the Enform car data that we had with the prior app?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6229434775","version":"1.0.24","date":"2020-07-22T20:17:08.000Z","authorName":"GreeneInk","rating":2,"title":"Very Slow Response","body":"The app does work but there needs to be a notation telling users that only one set of credentials like email address and phone can be registered to a VIN. This would facilitate setup for multiple drivers and cellphones. \n\nWe can lock/unlock and start the car remotely but the status updates can take up to two minutes. I unlocked the car remotely and tried to start it remotely - which is not allowed by the app. So I locked the car remotely and watched the mirrors on our NX fold in a few seconds, but I had to sit on my hands for two minutes waiting for “unlocked” to disappear from the status screen before the “Start” instruction timed out and offered to lock the car for me - when it was already locked. Multiple active processes need to better communicate. \n\nThe app is sluggish at best which marginalizes the utility of having the remote app to begin with. Please consider significantly increasing responsiveness when next updating the remote app - with thanks in advance for doing so.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6225961304","version":"1.0.24","date":"2020-07-22T00:50:43.000Z","authorName":"Milanni08","rating":1,"title":"Good until it failed me!","body":"I can’t give it more than one star simply because thieves were able to get into my vehicle and steal my belongings and the app literally did nothing to notify me of this. The day I needed that notification more than any other day it simply failed me 😡","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6225654477","version":"1.0.24","date":"2020-07-21T22:46:56.000Z","authorName":"blackeyedyams","rating":1,"title":"Regret","body":"Maybe I should’ve read the reviews before actually paying but I figured, hey it’s a Lexus, what could go wrong. It seems EVERYTHING! Been on the phone almost all day to get it fixed but to no avail. I am only paying to use the remote service. It doesn’t give me a fuel update or mileage either. How can a company pride themself on quality and customer satisfaction but cannot hire competent people to solve a simple software issue in today’s time. FIX IT!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6224268817","version":"1.0.24","date":"2020-07-21T14:34:24.000Z","authorName":"Knitting Maven","rating":1,"title":"Not a good app","body":"I put my VIN # as requested.  I was told that they don’t recognize the #.  I was advised to call some one  I can’t be bothered.  Many things can be cured, but not STUPIDITY!","voteCount":1,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6210527175","version":"1.0.24","date":"2020-07-17T23:37:13.000Z","authorName":"Rule13-1","rating":2,"title":"Why buy this??","body":"I have had this for almost a year now.  Frankly, it's not very good.  My wife has a remote that starts her car very quickly while I have to wait some 15-20 seconds for this to work.  Buy the time I have to wait I am close to the car.  I can't believe they actually CHARGE for this awful app.  Now I get a notice there is a new more functional app but it doesn't work with the RX.  I keep getting the notice but what do I care since I actually have an RX.  I suspectt will take Lexus 5\nYears to work with Apple to get their car app from iOS14 to work.  I left BMW to try a Lexus.  It's a good car but their internet support, like this app, needs t catch up with the world.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6206032052","version":"1.0.24","date":"2020-07-16T19:37:33.000Z","authorName":"DCaruthers","rating":5,"title":"Great app","body":"Much better than the previous one","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6202235578","version":"1.0.24","date":"2020-07-15T21:20:43.000Z","authorName":"leroy5686","rating":2,"title":"Why","body":"This updated? app is worse than the one it replaced. Using my Apple Watch app it keeps telling me to login with my phone. I am always logged in with my phone.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6194099075","version":"1.0.24","date":"2020-07-13T19:57:58.000Z","authorName":"coco1234455669","rating":1,"title":"Not responsive","body":"These apps aren’t always the most reliable. Hard to justify the cost of the heart service. All it tells you is where the car is, or at best its last location hours ago, which is not even where it really is. Hard to get a good connection to get it to get a status update. Wish it was better after the first Enform app, don’t think I’ll renew the next year. I hardly use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6187888287","version":"1.0.24","date":"2020-07-12T05:17:57.000Z","authorName":"natasha ivanov","rating":1,"title":"Safety notification not working","body":"The old App worked perfectly but this one just terrible every day needed apdate just for receive safety notification","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6187281903","version":"1.0.24","date":"2020-07-12T01:36:20.000Z","authorName":"False Adverisement","rating":1,"title":"App does not work","body":"App will not allow user to renewal expired subscription as advertised","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6186660957","version":"1.0.24","date":"2020-07-11T21:24:05.000Z","authorName":"Billy Dick G","rating":2,"title":"Remote start doesn’t work","body":"Shows all the status of the 2020 ES, fuel distance etc but won’t start it from the house  Notification on, as req   The key fob does start remotely. Old app always worked","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6181637995","version":"1.0.24","date":"2020-07-10T15:28:08.000Z","authorName":"Crista513","rating":2,"title":"Truly Doesn’t Work","body":"Every now and then I can get the remote features to work.  Generally, I can stand directly next to my car and can’t even get the app to lock it.  Disappointing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6181461543","version":"1.0.24","date":"2020-07-10T14:36:23.000Z","authorName":"Sideman7","rating":2,"title":"Please add a vehicle","body":"The new app is still worse than the old version. The watch app hardly ever works on the first try, always saying “please add a vehicle”... The phone app shows the car just fine when I open it. Does anyone test these apps?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6179573546","version":"1.0.24","date":"2020-07-10T05:15:40.000Z","authorName":"bonnielhar1","rating":1,"title":"New Enform app","body":"Every time I want to use it, it says I have to download it again. Bad app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6178475593","version":"1.0.24","date":"2020-07-09T22:34:28.000Z","authorName":"Onc45","rating":1,"title":"Crashing","body":"This new update on iOS 12.4.1 is an embarrassment for a supposed upscale car maker. The odometer, fuel status, and miles to empty no longer show up, and crashing occurs at random. Please fix.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6178363775","version":"1.0.24","date":"2020-07-09T21:51:05.000Z","authorName":"ok ron 99","rating":3,"title":"Update make app stop working","body":"Was hoping with this new app that when they did updates it would make app stop working properly.  But not the case. As with older apps when updates happen app doesn’t work properly. \n\nNot impressive for Lexus and Toyota.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6175018074","version":"1.0.23","date":"2020-07-09T04:13:24.000Z","authorName":"Where is the actual band?","rating":1,"title":"Worked great until it didn’t","body":"Bought my Lexus in April 2020 and I absolutely love it. Set up the app, was kind of a pain but once set up was awesome! Worked through May and stopped working in June. Have called multiple times and have received zero help, just that they are “working on it”. \nPretty awesome I paid $80 for the year for remote start that hasn’t worked for longer than it actually worked.\nGet it together, you should be embarrassed that this app is out in the world right now.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6174645710","version":"1.0.23","date":"2020-07-09T02:21:07.000Z","authorName":"LizaahMarieh","rating":1,"title":"Not functional","body":"Remote start & lock/unlock features have yet to work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6173314239","version":"1.0.23","date":"2020-07-08T18:41:56.000Z","authorName":"apensa123","rating":1,"title":"Confused","body":"I have so many Lexus icons on my phone I don’t know which is which and for what they are used","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6169209184","version":"1.0.23","date":"2020-07-07T18:41:44.000Z","authorName":"D_Harris","rating":1,"title":"Useless Garbage","body":"This app is useless.  First of all after I paid for my subscription the app kept saying I had no active subscription.  Contacted customer support who just basically said they are having issues and don’t know when it will be back up.  It’s been about a month and I still can’t add my vehicle","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6166327411","version":"1.0.23","date":"2020-07-07T02:21:52.000Z","authorName":"Valerie Larkin","rating":1,"title":"Remote doesn’t work","body":"I bought a 2020 Lexus UX250h a month ago. I was supposed to get three years of the remote services, but nothing works. Can’t start car or lock/unlock doors. Calls to the dealer are unreturned, and can’t get customer service from Lexus. The car is fine, though.\nUPDATE- got through to customer service, and they tried to reset app several times, to no avail. So they said I had to go to the dealer to have my car reprogrammed. I spent half a day with the dealer , which was a total waste of time. After the dealer supposedly did something, they also reset the app again. I went home while waiting for the app to reset, only to find it STILL DOESN’T WORK. This is my third Lexus, but likely my last.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6166171018","version":"1.0.23","date":"2020-07-07T01:26:21.000Z","authorName":"XoxoBloom","rating":1,"title":"It NEVER works","body":"If I could do -1 stars I would!!!!! It literally NEVER works...I feel like this app waisted my time and I feel like Lexus ripped me off assuring me of a remote start feature that only worked for a few weeks after purchase.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6165185136","version":"1.0.23","date":"2020-07-06T18:52:15.000Z","authorName":"XLE owner","rating":1,"title":"App needs serious work","body":"I have. 2020 ES F Sport. This has has basically no functionality except how fuel I have. Won’t remote start the car, won’t lock/unlock, no parking update on the map. It’s pretty useless. Expected so much more from Lexus!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6162734258","version":"1.0.23","date":"2020-07-06T04:38:48.000Z","authorName":"FrankieT","rating":2,"title":"Not fully functioning","body":"I just got a new ES350. Connected to this app. It shows my image and gas remaining. But I can’t connect to lock and unlock the car. It keep showing that all doors are unlocked even thou that is not true. Don’t know what else to do to fix this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6160593975","version":"1.0.23","date":"2020-07-05T14:43:31.000Z","authorName":"FAK Office Computer","rating":1,"title":"Confused...","body":"I purchased my NX in 2017 and absolutely love my Lexus. I received the free app service and decided to continue with PAID service since the day the free service expired. Now that the original enform app I was using has been removed I have not been able to access the new app. The app will not allow me to add my VIN and log in. I’ve called customer service “three” times now and have been told the “minor” bugs are being fixed to just give it another week or so. Well it’s now been a few months. How are you able to get away with charging for a service that is not accessible? I love my Lexus and the Lexus service in house. This app is not functioning and you are now stealing from me and providing answers. Extremely unhappy with this service.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6160540562","version":"1.0.23","date":"2020-07-05T14:25:55.000Z","authorName":"Sam@_","rating":1,"title":"It doesn’t work","body":"The app and lexus customer service are both useless","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6158066531","version":"1.0.23","date":"2020-07-04T23:04:54.000Z","authorName":"Steve-2","rating":1,"title":"Disaster","body":"We have 2 IS300s, a 2016 and a 2019. Over the past couple of weeks both updated the head unit software to add Alexa. I updated both this app and the Enform app on my iPhone X in response. Since doing that a) the paid Enform subscriptions on both cars have been cancelled (received a credit to my credit card already). And the telematics have been shut down entirely on the 2016 according to the Waiver agreement and emails I received. Puzzled, I didn’t ask for any of this. Not really sure what’s going on here, if Lexus messed up or I did something wrong when installing the new app. But, doesn’t seem worth the risk.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6157189765","version":"1.0.23","date":"2020-07-04T16:49:27.000Z","authorName":"pacollins","rating":1,"title":"Non-functioning app","body":"Why have an app that takes forever to respond! The new app version did not turn off my car after the app finally connected and gave me a message my car had been shut off. Went outside to make sure and it was still running.   App is cumbersome and If I finally get to log in to start my car, I’m already at the car. Why bother using the app. Lexus really lags behind on technology. Why can’t you start the car by using the key fob like other competitors do?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6154320071","version":"1.0.23","date":"2020-07-03T23:55:48.000Z","authorName":"jobestirsthepot","rating":5,"title":"For the Lexus app","body":"Seamless use ability for upgrades styles colors overall was able to experience lifelike excitement as if I’ve been at the show room floor just at the touch of my phone. All the information was relevant to my exact character as if the app was talking to me personally as I scrolled through all the options  and acquired the different information is to build the car and I love.. with so many choices but yet pinpointed the mindset inspired my exact character.The developer of these cars and apps are truly a class and technology out there in their own time and space","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6153908764","version":"1.0.23","date":"2020-07-03T20:59:58.000Z","authorName":"smuthjz","rating":1,"title":"Constant Log-In","body":"After setting up a log-in and Face ID\nthe app should be easy to use. Trying to use remote start is hampered by asking me to log in for security purposes. I should not have to do this repeatedly especially when it’s hot and I’m trying to cool off the car. Why not just trust Face ID? I don’t need this much security. This app should work each time with no issues.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6152489156","version":"1.0.23","date":"2020-07-03T13:24:31.000Z","authorName":"C.P>","rating":1,"title":"Messed up new version","body":"I have two Lexus rx350 /2019. Before the update,  I was able to have both cars information on the same app and was able to switch them to start and use other Options and see status.\nMy wife had the same app on her phone with the same ability to start cars remotely or see the status on both my phone or her phone.\nSince updating these options are not available on either phones.\nMy call to Lexus made it worse .\nIs it possible to let we have the previous version of this app?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6150097389","version":"1.0.23","date":"2020-07-02T23:24:33.000Z","authorName":"rachaelgonz","rating":2,"title":"No access after Update","body":"I had access prior to the latest update. Now, since the latest update, it’s been two weeks and counting of not being able to do anything in the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6145771358","version":"1.0.23","date":"2020-07-01T21:24:38.000Z","authorName":"Tilbrewer","rating":2,"title":"Update lacking","body":"I value finding my parked car. I am missing being able to check navigation which I truly valued as a service in knowing family members were making expected progress on medical appointments etc. I would go back if I could.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6142050181","version":"1.0.23","date":"2020-07-01T01:16:57.000Z","authorName":"PCShutterbugaBoo","rating":1,"title":"What is going on Lexus","body":"I buy apps all the time but I hate paying for subscriptions.  I folded on this app and now I ask myself why each day.  The credibility of the data is strange to say the least...and sends me in circles.  e.g. notification that the door is unlocked.  OK push the button to lock it...after running circles for a while it reports that it is unable to lock the doors.  I go to the car and it is locked.  I manually open close and lock all the doors.  Same message.  Then the message to change the app.  OK.  I update to the new app.  Now it wants to send me a verification code that never comes.  Closed the app.  Upon opening the app again, it sends me to update the app again.  Now it repeated the whole stupid cycle again.  So the only use of this app is to waste my time.  The inconvenience and frustration comes at a high subscription cost.  Get you act together Lexus.  My previous Lexus was a dream.  I see now it was to be a one shot dream.  I made a lot of compromises to stay with Lexus.  Now I know it was not wise.  I am so sad that I can no longer recommend Lexus.  Do better Lexus!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"},{"id":"6141988665","version":"1.0.23","date":"2020-07-01T00:53:18.000Z","authorName":"AllEyezOnRod","rating":3,"title":"I’m disappointed","body":"2018 GS 350 F Sport keeping indicating that my doors are unlocked which isn’t the case. I can’t use the app, because of the errors that I am receiving. I shouldn’t have to pay for this app when other vehicle manufacturers have remote start for FREE!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1468484450","appName":"Lexus"}]