[{"id":"7640051366","version":"5.4.0","date":"2021-07-31T19:02:34.000Z","authorName":"Th98","rating":1,"title":"Apple Watch app is useless and iOS app is now worse…","body":"Update as of 7/31/21: Apple Watch app is useless again. Every day when I open the watch app, it says “Logged Out, Log In on your mobile device”. If I have to use the mobile device, the watch app becomes useless. Also, the iOS app is now worse. Every day, the iOS app requires that I sign in regardless of whether I toggle the “Keep Signed In” switch. So every day I have to sign in with my email/password as well as the pin code (the toggle to use Face ID on the pin code screen also times out every day). I’ve reinstalled and no luck. Every app update that comes through, I have anxiety. Will the app be better or worse? \n\nUpdate as of 2/27/20: They have put out an update that fixes the problem I listed below. I will leave the description of the problem in case anyone else experiences it but it has now been fixed for me. Changing review to 5 stars.\n\nLet me start by saying that the iPhone app is great. It lets me start/stop/lock/unlock the vehicle with simple FaceID authentication. However, the Apple Watch app (that installs to your watch when you install this iPhone app) is completely useless. If you want to start or unlock your vehicle from the Watch app, you have to pick up your phone, unlock it, find and open your myChevrolet app, and it will ask for your PIN code as soon as it loads. When you put in your PIN code, you can then go back to your watch and use the various functions successfully. Once a few minutes pass (say you went into a store to shop for example), you have to go through that entire process again to perform any functions on the watch. This makes the Watch app completely useless. If I’m required to open the myChevrolet app on my iPhone every time to do any functions on the watch, I will just do those same functions on my phone. I’m already in the app so it’s far quicker to just do them on the phone. There is a setting inside the iPhone app that allows you to “save the PIN code to the Watch” but it has not worked at all for me. I’ve uninstalled and reinstalled the apps numerous times. Maybe it’s a glitch with iOS 13? I’m not sure. But as it stands, the Watch app only takes up space, it doesn’t have a purpose in day to day use. EDIT: Per the developer’s response below, this is the expected operation of the Apple Watch app. Which means that the Apple Watch app is completely useless. If the Apple Watch app requires a pin code due to security concerns (and I understand this) why not ask for the pin code ON THE APPLE WATCH? If I have to open the myChevrolet app on my iPhone each time I want to perform a function that’s available on the Watch app, why in the world would I (or anyone else for that matter) use the Watch app? Especially if I have the cellular Watch model. I feel like there is a problem with their app and the latest WatchOS or iOS 13 or something. I have contacted their support group and was told it was forwarded to the correct team but that was several weeks ago and I haven’t received a single response from them since. I can only give this app a 1 star due to the completely nonfunctional Watch app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7639995617","version":"5.4.0","date":"2021-07-31T18:39:25.000Z","authorName":"Pee_Tricks","rating":4,"title":"Overall good with one flaw","body":"As a Chevy salesman I really enjoy the app and showing it to customers but recently the app has continually signed me out even after I select stay signed in which is frustrating because I’m then unable to do remote commands from my watch. Also me and many of my customers find it a little ridiculous it’s $15 a month to have access to this when other manufacturers have it for free.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7639416357","version":"5.4.0","date":"2021-07-31T14:48:49.000Z","authorName":"XXDreams","rating":4,"title":"Pretty Decent","body":"I enjoy being able to start my car from my phone:. The only thing I hate about this app is that it logs me out even when I’ve gave it permission to NOT log me out.. I’m always on the go so it’s easy to just remote start from my watch rather than have to pick up my phone just to log in. I really hope it gets fixed soon.. I’ve already deleted the app and reinstalled as wel","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7637538215","version":"5.4.0","date":"2021-07-31T03:08:21.000Z","authorName":"THE000000000","rating":1,"title":"On star is absolute trash","body":"Rarely ever works especially when i really need it. Almost never works. App freezes constantly","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7637464934","version":"5.4.0","date":"2021-07-31T02:39:33.000Z","authorName":"RodM777","rating":5,"title":"Older IPhones 6","body":"How come when you try to download the older compatible app to the iPhone 6 it does not take.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7636616674","version":"5.4.0","date":"2021-07-30T20:31:45.000Z","authorName":"AMJAX2020","rating":1,"title":"Cant even load","body":"Ever since I’ve had my new car for two months, every time i log into the app the Chevrolet home page loads the whole entire time. I’ve never even gotten into the actual app. Im signed in but I can never get past the loading page.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7636495748","version":"5.4.0","date":"2021-07-30T19:39:37.000Z","authorName":"okey d11","rating":5,"title":"Issue w unlock feature","body":"I like the app and functions that enable me to check status of the vehicle but I’m have an issue where the “unlock” function is no longer working . I can unlock with my key fob but not the app.\nAny tips on what’s wrong?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7636325493","version":"5.4.0","date":"2021-07-30T18:31:09.000Z","authorName":"LowHaws","rating":2,"title":"Too expensive!","body":"Basic services like remote unlock and remote start are free on Fordpass, c’mon Chevy!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7635680067","version":"5.4.0","date":"2021-07-30T14:49:51.000Z","authorName":"Angry Gorilla","rating":3,"title":"$15 A month to use the app.","body":"I get that companies are trying to make money, but I wish they’d be upfront about the cost. \n\nTo save you the hassle I’ve posted the price in this review. \n\nSo for $180 you can have your phone do what your keychain does. \n\nI’m bummed, because it would’ve been a nice perk…but seems hardly worth it. \n\nI gave three stars because I couldn’t actually use the app since I didn’t want to pay. It may be worth more or fewer stars, but I guess I’ll never know.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7635160688","version":"5.4.0","date":"2021-07-30T12:10:49.000Z","authorName":"disappointed_chevy","rating":1,"title":"Not worth paying for","body":"Never had a problem with the prior version of the app.  This version regularly requires me to log out and log back in, just for the functions to work properly.  Feels like a waste of money to have to pay for it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7635045469","version":"5.4.0","date":"2021-07-30T11:30:55.000Z","authorName":"MadFalcon","rating":1,"title":"It works","body":"Not when you need it. Tried to login hour prior to when I intended to use it, logged me out again anyway. Same issue, all versions for past six months since I got it. And no, I will not waste my time emailing support, if app developers can’t read issues about app on App Store. Already wasted enough time writing this. One star is where it will stay.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7633711154","version":"5.4.0","date":"2021-07-30T02:54:43.000Z","authorName":"Nmelecio","rating":3,"title":"Doesn’t work the same on Apple Watch","body":"Before the update I was able to lock and unlock my car doors from my watch. Now it won’t let me do anything on my watch unless I have my phone close by so it can unlock. That’s why I liked the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7633429491","version":"5.4.0","date":"2021-07-30T01:08:56.000Z","authorName":"ClarkSnowdall","rating":1,"title":"Useless app","body":"I’m a loyal GM owner and consider myself an early adopter and tech savvy. The old version of this app worked very well and provided what I needed. The new version of the app is horrible and completely unusable. On iOS on a new iPhone 12 the app rarely remains up and running more than 30 seconds at a time. It’s highly unstable and usually takes a dozen or more launches before I can get status of my car. I have restarted the phone multiple times, I have restarted the app repeatedly, I’ve tried logging out and logging back in, and I have uninstalled and reinstalled the app. Nothing will make this app stay open longer that 10-30 seconds. It has become a tragic burden that I can’t use my fancy app with my fancy EV. Please please please GM fix app stability!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7631713804","version":"5.4.0","date":"2021-07-29T14:59:28.000Z","authorName":"N810dahood","rating":1,"title":"It was a trial","body":"If this is a selling point to you for a Chevrolet (or any other GM vehicle), look elsewhere.\n\nThis app works without a subscription for 5 years. Which is ridiculous. I spent nearly $40k on this vehicle and am still paying for it, but to have this app and it’s functionality will cost me extra and the subscription price is outrageous. Everything costs something on a monthly basis and none of it is reasonably priced.\n\nThat’s absolutely unreasonable and greedy of GM. Fortunately it’s my last GM vehicle because I have had so many issues and continue to do so and GM’s lack of a warranty on much of it tells me they don’t have faith in their own vehicles’ longevity. This just put a nail in the coffin for me.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7631072985","version":"5.4.0","date":"2021-07-29T11:48:56.000Z","authorName":"David Nolasco","rating":1,"title":"Was good then update ruined everything","body":"Also support for apple watch app is non existent","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7629046875","version":"5.4.0","date":"2021-07-28T22:27:48.000Z","authorName":"David - Nash, TN","rating":1,"title":"Paid plan for previous free features","body":"I used to remote start my 2012 Camero, but now I have to pay! No thanks keep your payment plan! I paid for the car, I guess that’s not enough.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7628705751","version":"5.4.0","date":"2021-07-28T19:54:33.000Z","authorName":"Auntie59","rating":5,"title":"Good App","body":"It needed a good updated to newer version instead of plain Jane type.All information are all wrong..","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7627656135","version":"5.4.0","date":"2021-07-28T13:51:33.000Z","authorName":"Zirya","rating":1,"title":"Disappointed","body":"I’m 73 and the old app was very useful. The new one not so much. I was able to track how much gas I had and mileage, accuratly. I could check my tire pressure without getting back in the suv when getting air. Chevy/GMC is making you pay more for this. As a senior and handicapped it’s a disadvantage.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7627462868","version":"5.4.0","date":"2021-07-28T12:55:10.000Z","authorName":"ybb101","rating":1,"title":"Stuck on Offers Promotions Service Visits screen","body":"Have deleted and reinstalled app numerous times but can’t get past this page. Keeps freezing here.\n\nPop up says unexpected error and check for update. Deleted and reinstalled numerous times and problem continues.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7626318582","version":"5.4.0","date":"2021-07-28T05:40:02.000Z","authorName":"Me torri","rating":1,"title":"Features are missing","body":"Where is my vehicle status and i cant lock my doors anymore from that app.. i used those features a lot should I reinstall???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7625676046","version":"5.4.0","date":"2021-07-28T01:18:37.000Z","authorName":"faceykim","rating":2,"title":"Updated app needs work","body":"Since the latest upgrade on iOS the app no longer automatically updates. I have to search for the app in the App Store and update it. And the app also keeps crashing. Prior to the update I liked using the app. It also continuously signs me out of my Apple Watch which the previous version did not do and disables face recognition. I have to log into the app every single time with my password and username name even though I continually try to have it remember my username and active both my pins and FaceTime. There are several days that I have to close the app several time and reopen to try to start my car. This was also not an issue with the old app. The previous app I could wake up on a cold morning hit the button and snooze my alarm while the car warmed up. There is some data that I am still unable to pull up still the new update; the only thing this new app has is a good look. I have tried deleting the app and reinstalling it that doesn’t work. It seem that there since the new release the app is crashing more than it works.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7625509571","version":"5.4.0","date":"2021-07-28T00:08:13.000Z","authorName":"M26757M","rating":1,"title":"Terrible since the update","body":"The door lock and unlock feature doesn’t work consistently. It used to work great before the new look. Now it tells you if your vehicle is already locked…only I learned the hard way my truck was not actually locked as it said and got broke into. I would rather the app let me lock an already locked truck like it used to, rather than telling me the incorrect lock status without the option to even lock!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7623906216","version":"5.4.0","date":"2021-07-27T13:52:39.000Z","authorName":"Harley-Puddin","rating":1,"title":"Terrible","body":"They keep making this app very difficult and useless with these updates I have to uninstall and reinstall to make it work, this is my 8th time removing and reinstalling","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7623708706","version":"5.4.0","date":"2021-07-27T12:54:46.000Z","authorName":"Test4echo73","rating":1,"title":"Latest update does not work","body":"Ever since their “overhaul” update, it rarely works. It now stuck on the Lock Screen. Have spare keys hidden if you rely on this to lock/unlock doors.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7623297887","version":"5.4.0","date":"2021-07-27T10:35:41.000Z","authorName":"Sassymak","rating":1,"title":"Why did you change it!!!!","body":"The previous version was FABULOUS! This version is horrible. I have had to delete and add the app 7 times in 4 days! The remote start randomly will show OFF. To fix it all you can do is delete and reinstall. FIX IT!!!!!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7622253899","version":"5.4.0","date":"2021-07-27T03:23:16.000Z","authorName":"317CF","rating":1,"title":"Disappointed","body":"Since GM deactivated the remote start feature, this app is pretty much worthless to me. It was included when I bought my vehicle but apparently they now want to charge for it. Sad.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7621888964","version":"5.4.0","date":"2021-07-27T00:56:24.000Z","authorName":"taytay0910","rating":2,"title":"Can’t even get connected","body":"I downloaded the app. Did the onstar welcome call to start my service. But the app still won’t let me connect my car. I’ve tried entering in the VIN number with no success. I don’t know what I’m doing wrong here","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7621847563","version":"5.4.0","date":"2021-07-27T00:38:38.000Z","authorName":"Mbiggers1","rating":1,"title":"Not disabled friendly","body":"This app used to work with voiceover on the iPhone. And then it got updated and nobody cared to include accessibility into the thought process and now all users that have print disabilities and use voiceover on the iPhones are unable to use the applications sad face I am disappointed in the developers of this application for not being inclusive of everyone","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7621815391","version":"5.4.0","date":"2021-07-27T00:24:35.000Z","authorName":"47medic","rating":5,"title":"Worked fine until IOS 14.7 (update)","body":"Initially after IOS 14.7 the app remote start didnt work but it seems to have resolved on its own and the app works perfect for me again.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7621358318","version":"5.4.0","date":"2021-07-26T20:53:51.000Z","authorName":"pcawley1964","rating":4,"title":"Not an improvement","body":"I had the old app and it always worked.  I’ve reloaded the new app 3 times, and while it works most of the time, it still hiccups.  The biggest issue is with the remote start, when you need it most it’ll say “Off” even if you haven’t opened the app since you last drove the car.  It also doesn’t like to keep me logged it.  The Apple Watch version flat out doesn’t work, I don’t think it’s supported anymore","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7620980099","version":"5.4.0","date":"2021-07-26T18:23:43.000Z","authorName":"azareldotcom","rating":4,"title":"Good features, status indicator would make it great","body":"Pretty cool app. I use it mostly for the remote feature. One option that should be added to make the remote feature more user friendly is to let you know the status of your doors.\n\nExample, let’s say I think I forgot to lock my doors. Sure I can just push to re-lock them, but would be nice if the app displayed that doors were locked. Also, if lights were on.\n\nThis would work similar to how the remote start button in the middle will display the time counting down for how long you’ve had vehicle running by remote.\n\nThere looks to be space in the center above where the remote start button is located that a status indicator could easily fit.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7617772088","version":"5.4.0","date":"2021-07-25T21:52:17.000Z","authorName":"do fm us an","rating":1,"title":"Bad upgrade","body":"This new version of the is horrible. Extremely difficult to navigate. The old version was simple and easy to use. Bring back the old version please…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7616168997","version":"5.4.0","date":"2021-07-25T12:04:58.000Z","authorName":"Mespanol12","rating":1,"title":"Update please!!!!!","body":"Update app please, Each time apple update IOs, I don’t have access in my app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7614354424","version":"5.4.0","date":"2021-07-24T23:48:22.000Z","authorName":"SouthlandHB","rating":1,"title":"Doesn’t work reliably anymore","body":"All their updates feel cosmetic- suddenly the app just isn’t reliable anymore. Remote start says “off” and won’t work. \n\nConsidering how much I spent for my car, I expect better. These nuisances have become too frequent. \n\nAdding insult to injury, I’ve been paying for Onstar for years, finally needed to use it, and it didn’t work. Still doesn’t. They can’t figure out why and they’re still working on it. They don’t have my car- so what exactly does that mean? \n\nI’ve started looking at the competition.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7613856292","version":"5.4.0","date":"2021-07-24T19:53:00.000Z","authorName":"Rich8798","rating":1,"title":"The app is a piece of crap","body":"I have to constantly login to the app. EVERY TIME I USE IT!!!!! And, it doesn’t work with the Apple Watch. Oh, there is an app on the watch but it is worthless. Constantly asking for me to login. And of course, can’t do that with the watch and have to use the phone. When it does work, never get a notification that the car is running. It, the app, just shuts down. USELESS AND A PIECE OF CRAP!!!!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7613552170","version":"5.4.0","date":"2021-07-24T17:45:13.000Z","authorName":"wonder bread","rating":3,"title":"Works sometimes","body":"When this app works it is great. Awesome to be able to open and lock and start the car from the phone I do wish we could open our trunk from the app too, but I don’t know if that is feasible. \n\nBut this app goes through weeks of not functioning correctly. It’ll have random cycles of weeks where it won’t let me start my car from the app like it is supposed to. \n\nCurrently I’m on about two weeks of it not letting me unlock my car from the app. \n\nIf this app would work consistently then I’d gladly give it a 5 star rating. Please fix these issues","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7613150644","version":"5.4.0","date":"2021-07-24T15:24:12.000Z","authorName":"Eyes 45","rating":1,"title":"This update doesn’t work","body":"I have tried and tried to get OnStar to fix the problems with this app, but so far have been unsuccessful.  I can’t see any of my OnStar plans on the myChevrolet app on either my computer or iPad.  I would think if you can break it you should be able to fix it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7612766778","version":"5.4.0","date":"2021-07-24T13:27:22.000Z","authorName":"Nfree31082","rating":2,"title":"App not useful","body":"App is not very helpful now since it has less things you can use.. The door unlock and lock was very helpful for me when I was not near my keys and had my phone near.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7611511786","version":"5.4.0","date":"2021-07-24T05:40:03.000Z","authorName":"Gordo Viewer","rating":4,"title":"App stuck on Locked","body":"Screen on app is stuck on Locked and won't allow any remote commands to be sent from phone. Apple Watch still works sending remote commands. Phone app stopped working with last app update. \nDO NOT RECOMMEND DELETING AND REINSTALLING APP. THIS IS 2021. TIME HAS PASSED FOR THAT MESS.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7610966042","version":"5.4.0","date":"2021-07-24T01:59:36.000Z","authorName":"Unique J.","rating":1,"title":"Doesn’t work! -2018 Chevy Malibu LT","body":"Look y’all I don’t ever leave reviews, I promise I don’t. But this app. Is irritating. For about a month now, it will do this thing where I open the app, and the power button that’s used to remotely start the car (that I pay monthly to be able to use) will say “off” and won’t let me start the car. And every single time it does this, I have to delete the app and reinstall it and it is so frustrating. One time, the power button worked, but the “lock” button on the app was grayed out so I couldn’t press the remote lock button on the app. This entire app is a headache especially when I’m PAYING MONTHLY.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7610064336","version":"5.4.0","date":"2021-07-23T19:30:41.000Z","authorName":"Hatethisss","rating":1,"title":"Very unstable","body":"Logs me out several times a day and forgets my settings at about the same frequency. Works ok sometimes, but worked a whole lot better last year and the year before","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7609885877","version":"5.4.0","date":"2021-07-23T18:15:37.000Z","authorName":"grrjr88","rating":2,"title":"Glitchy","body":"The app can do some pretty cool things - when it works. I constantly get a “service not available” message everyday, and the UI is frustrating. I’ve chosen to not have certain tips shown to me again, but they keep re-enabling themselves. The app is slow and glitchy to use, and it’s definitely not worth paying for its features with an Onstar subscription.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7609527517","version":"5.4.0","date":"2021-07-23T16:09:41.000Z","authorName":"Sheemababy","rating":3,"title":"The start button says off","body":"Sometimes when I go onto the app to start my car the button says off, I then have to delete and download the app again. Why do it say off?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7609267935","version":"5.4.0","date":"2021-07-23T14:48:44.000Z","authorName":"MedicHubbard","rating":1,"title":"Paid service now","body":"I’m on my 3rd Chevrolet and I’ve used the app since I bought my first one in 2014. Now that i have a 2021 you have to pay for any and all of the services in the app. It was nice to use when it was free but I’m not paying more for an app to unlock my truck than I do for Hulu, Netflix, or any other streaming service.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7606972719","version":"5.4.0","date":"2021-07-23T00:14:20.000Z","authorName":"Muskyhunter7","rating":1,"title":"App","body":"This is a update review,After you guys updated the app you can no longer use the app. It always says failed 😡","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7605504451","version":"5.4.0","date":"2021-07-22T14:27:49.000Z","authorName":"Headteacher7","rating":1,"title":"Bring back the old","body":"Personally, I liked the old app better, this one does nothing!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7603438490","version":"5.4.0","date":"2021-07-22T01:27:26.000Z","authorName":"AKA456","rating":2,"title":"Not as good as the ok’d app","body":"I’m not crazy about this new version of the app. For one thing it no longer shows the tire pressure which was one of the features that I liked best. A lot of the information that was available on the old app is no longer there. I imagine some things had to go in order to provide the energy info. I prefer the old app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7603208645","version":"5.4.0","date":"2021-07-21T23:48:32.000Z","authorName":"Fauxthoreau","rating":2,"title":"OK but inconsistent and sometimes inaccurate","body":"We just got a new Bolt.  The app often has difficulty connecting with my car.  The various app functions don’t always respond and some of the vehicle status updates appear inaccurate after checking the warning at an alternative source.  I would really like to like this, particularly because I like the car so much.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7599615680","version":"5.4.0","date":"2021-07-21T00:32:12.000Z","authorName":"stellarllc","rating":5,"title":"Not like it used to be","body":"IUse this app to start my truck remotely on hot and cold days all the time. After one of the updates remote starting is not even an option on the app. Not sure what’s going on but it this point whats the point of having this to just unlock my car and lock it. Please go back to the old way….if it’s not broke, don’t fix it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7599420976","version":"5.4.0","date":"2021-07-20T23:05:43.000Z","authorName":"Nick.r.t","rating":1,"title":"NOT WORKING !!!","body":"I have uninstalled it and re did it 3 times and still can’t turn vehicle on or off can’t do anything at all smh useless","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7599006022","version":"5.4.0","date":"2021-07-20T19:54:04.000Z","authorName":"afr3510","rating":4,"title":"Good app but check “send to nav” function","body":"On more than one occasion I’ve sent addresses to chevy app navigation, but when I got to vehicle and accessed the nav, the street number was good. The street name, city, state was there but not number. It took me several trips to realize why the nav and me were lost when looking for location. I have pics if the developers want to see. Call or text me.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7598424756","version":"5.4.0","date":"2021-07-20T16:07:33.000Z","authorName":"munpip214","rating":2,"title":"Too big","body":"Almost 500MB for a remote app? Should be 50MB. Don’t have room for it anymore","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7596054331","version":"5.4.0","date":"2021-07-20T01:06:48.000Z","authorName":"Clubbcarr","rating":1,"title":"Crap","body":"Latest update in July 2021 won’t let me unlock my doors from app. Crappy app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7595918489","version":"5.4.0","date":"2021-07-20T00:11:55.000Z","authorName":"Wvjyfbtrbhyvhschyvbtgbyfv","rating":1,"title":"Still flawed and Apple Watch app is still useless","body":"Looks like my honest review with updates after each update was removed. No wonder the app is rated so high. The negative reviews are deleted The app is still flawed and the Apple Watch app is still useless. The latest update has resulted in a blank screen on my phone Here’s how I get my app to work temporarily. Sign out then back in. The app will work for a day or so before going back to blank screens. Rinse and repeat. Still haven’t figured out a combination that will make the Apple Watch app useable until onstar fires the high school programming class and gets real programmers to fix the app. Update: glad to see that trying to use the Apple Watch app STILL causes the iPhone app to stop working Update: now that winter is over remote start finally works again. Glad I paid all that money for something that was useless when it was actually needed.\n\nUpdate:\nIt’s the gift that keeps on giving. The unlock button is grayed out and the lock button is gold. Neither one will do anything now. I’m glad I’m not depending on this app to get into my vehicle","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7592827023","version":"5.4.0","date":"2021-07-19T04:10:09.000Z","authorName":"kmccullough0784","rating":3,"title":"Freezes constantly","body":"The app is great when it works right but unfortunately it’s constantly freezing on my iPhone XR. I can close out of the app, restart my phone or do a hard restart and nothing works. The only solution I’ve found is deleting the app and reinstalling it and that’s getting pretty stupid. I’d give it 5 stars if I didn’t have to constantly delete and reinstall.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7591746994","version":"5.4.0","date":"2021-07-18T20:22:21.000Z","authorName":"Trocki123","rating":1,"title":"Useless at this point","body":"I’ve had to uninstall and reinstall this app every time I wanted to use it. Every time I try and unlock my car, it just shows the “locked” symbol highlighted in gold and the unlock option is restricted. Nothing fixes this, restarting the app, the phone, it’s not a signal issue. The app is broken.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7591724722","version":"5.4.0","date":"2021-07-18T20:12:25.000Z","authorName":"Can't start through app","rating":1,"title":"Can’t start","body":"The button you hold to start the vehicle through the app doesn’t work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7590778543","version":"5.4.0","date":"2021-07-18T14:33:07.000Z","authorName":"snddsn","rating":1,"title":"If I could give it 0 stars I would.","body":"New “improved” app is useless. Can’t remote start, unlock, check status, or flash lights. Yes, Developer, I uninstalled and re-installed. As a software developer myself if I let this piece of trash go out the door, I’d be fired. Which is what GM should do to you.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7589467505","version":"5.4.0","date":"2021-07-18T06:36:22.000Z","authorName":"SoulReaper31","rating":1,"title":"Remote commands","body":"I have no idea where the remote commands went off to they seemed to have disappeared a number of updates ago","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7588301679","version":"5.4.0","date":"2021-07-17T22:23:06.000Z","authorName":"lupi956","rating":1,"title":"Needs to be Checked","body":"Since it got the new update it had a lot of issues every time I wana do something I have to log in","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7588085201","version":"5.4.0","date":"2021-07-17T20:47:18.000Z","authorName":"Monz36","rating":2,"title":"Same issue","body":"I wrote a review about the same issue on the app or not being able to remote start engine and it was fixed for a few days and now same issue. I have a plan that supports the feature before you suggest I check. Can you please fix the app again.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7587919329","version":"5.4.0","date":"2021-07-17T19:34:08.000Z","authorName":"Rossy!!!!!","rating":5,"title":"Roberto Rios / Jack Phelan Chevrolet","body":"I purchased my new equinox 2022 today 2/17/21. Roberto Rios was excellent, he helped me with the purchase process.  Roberto was very patient and answered all of my question. Excellent customer service.  I am a very happy and satisfied customer.   Than you Roberto!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7587620029","version":"5.4.0","date":"2021-07-17T17:32:14.000Z","authorName":"Caryrae","rating":2,"title":"Loses connection to Bolt","body":"Bought a 2022 Bolt EV on July 14th and after just a few days I keep getting a connection error so I can’t check my charge status or anything to my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7587383325","version":"5.4.0","date":"2021-07-17T16:08:22.000Z","authorName":"simplyemily57","rating":1,"title":"Still Cannot Access Controls","body":"I haven’t been able to unlock or start my car remotely since the app was updated. I live in a state that gets really cold winters, and losing the ability to remote start my car so that it preheats will actually stop me from purchasing another GM product. I know many others are having issues with the app, and after two months no updates have been made to fix it. When cara have many of the same features available, it’s the ones they don’t have that make the difference, and right now my Chevy lacking.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7586776635","version":"5.4.0","date":"2021-07-17T12:57:34.000Z","authorName":"Luke Petrinec","rating":1,"title":"Unreliable","body":"This app is so bad and clunky. Super unreliable and barely works.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7586749942","version":"5.4.0","date":"2021-07-17T12:48:57.000Z","authorName":"Dooga33","rating":1,"title":"Crashes Between 0-30 Seconds Every Time","body":"Ever since the latest UI was added, this app crashes EVERY TIME it is opened. It has essentially rendered all smartphone functions for the car useless. Have been reporting and following up with GM after at least half a dozen updates (to the app and iOS) since, deleting and downloading the app and rebooting the phone in every permutation possible after each update. I believe it has been more than half a year now.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7585065655","version":"5.4.0","date":"2021-07-17T01:45:20.000Z","authorName":"rob sjc","rating":1,"title":"5.4.0 still crashing","body":"Why did you release yet another new version without fixing a crashing bug? Has someone bothered to look at the dumps?\n\nIf anyone at GM cares I can provide new dumps","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7584769026","version":"5.4.0","date":"2021-07-16T23:40:34.000Z","authorName":"Steamtrain John","rating":4,"title":"Unreliable interface with AppleWatch.","body":"Haphazardly connects/disconnects with iPhone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7583962932","version":"5.4.0","date":"2021-07-16T18:10:32.000Z","authorName":"Usachove","rating":1,"title":"Doesn’t work properly","body":"Almost each app start asks accept user agreement.\nReset OnStar PIN doesn’t work.\nFamily sharing looks broken.\n”keep me signed in” asks PIN that you can’t reset. Same for enabling Face ID","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7580611033","version":"5.4.0","date":"2021-07-15T20:56:52.000Z","authorName":"jayboydalowk","rating":3,"title":"My Chevy Lags","body":"My app lags to turn on my vehicle I feel like the app needs to be updated just a little bit more","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7577554357","version":"5.4.0","date":"2021-07-15T01:59:20.000Z","authorName":"user28384747","rating":1,"title":"New update is terrible","body":"All remote commands to communicate with my vehicle are gone. Vehicle status and alerts are gone. This app is now nothing more that a tool to show me webpages.\n\nI already uninstalled it completely, reinstalled and logged in again. Nothing changed. The entire team that developed this should be embarrassed, especially the PM who signed off on this trash.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7577000990","version":"5.4.0","date":"2021-07-14T22:06:06.000Z","authorName":"Cerus98","rating":1,"title":"Zero stars","body":"No way in heck are these legit 5 star ratings. App has been horrible ever since they took over and got rid of the onstar app. Can’t even edit locations for vehicle locate. Thank god we’ve sold our Chevy. Apps as bad as their cars.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7576755934","version":"5.4.0","date":"2021-07-14T20:21:05.000Z","authorName":"Lizzi93150","rating":2,"title":"Not great","body":"When the app works it works great. When it doesn’t it’s horrible. It logs me out constantly no matter that I select to stay logged in and even in good service areas there is a delay. Since I pay for this app I would hope it would be better. It’s only gotten worse since you all “updated “ it a while back.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7576734422","version":"5.4.0","date":"2021-07-14T20:12:01.000Z","authorName":"David E Miller","rating":1,"title":"App keeps crashing","body":"Was a great app, after last update the app no longer works a d crashes when you attempt to open","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7576722614","version":"5.4.0","date":"2021-07-14T20:06:59.000Z","authorName":"A. Rayne","rating":1,"title":"App hasn’t worked in a while","body":"Update: now the app won’t let me remote start. Instead of the power button-it just says OFF\n\nRecently, the app hasn’t worked for me in the last month. Every time I try to open it, I get a black screen. It also will not work on my Apple Watch","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7575966142","version":"5.4.0","date":"2021-07-14T15:27:13.000Z","authorName":"mattsgreat5","rating":1,"title":"Trash service","body":"Bizarre this cost $15/month when Ford is free and works way more reliably.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7575086014","version":"5.4.0","date":"2021-07-14T10:49:49.000Z","authorName":"Tim Speer","rating":1,"title":"Why Did You Eliminate Usable Information?","body":"So, this new version is so, so pretty. It’s so pretty BUT USELESS! I get it, the previous version landed on the vehicle information and you had to select dashboard to get to the controls. But now, there is no way to find the vehicle information! Now to get the mileage or engine size for any reason, say online trying to get a vehicle report or trade-value, I have to go out to the vehicle and retrieve it. Why do app developers always throw away the useful parts and call it improved?","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7573566529","version":"5.4.0","date":"2021-07-14T00:54:57.000Z","authorName":"JNodal","rating":2,"title":"Not working 100%","body":"The iPhone app is really glitchy and I can no longer use the app with my Apple Watch. The app won’t even appear on my Apple Watch. I have tried resetting my watch, uninstalling the app and re installing and nothing works I have an iPhone 12 and Apple Watch series 6.\n\n7/13/21 Update: phone app works better but it sill doesn’t work on the Apple Watch","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7573097625","version":"5.4.0","date":"2021-07-13T21:28:40.000Z","authorName":"Bjgsecfujdagvf","rating":3,"title":"Unlock button won’t stop","body":"Used this app for yrs, helps a lot especially in the winter. Lately the app unlock button won’t stop circling so I can’t use the lock or unlock function.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7572686176","version":"5.4.0","date":"2021-07-13T18:37:18.000Z","authorName":"mehoff88","rating":3,"title":"New update lies?","body":"The newest update(7/13/21) says you can start your vehicle from the Home Screen. I see no option or widget to do that.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7572613584","version":"5.4.0","date":"2021-07-13T18:10:21.000Z","authorName":"nimish600","rating":2,"title":"Adding family member function is borken","body":"I can add a family member but when I try and select the vehicle for them to have access to and save, the setting does not stick and they don’t get access to the vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7572571267","version":"5.4.0","date":"2021-07-13T17:55:56.000Z","authorName":"Gman4798","rating":1,"title":"Can’t connect my vehicle","body":"Everytime I try to add my vehicle the app lags and I can’t do anything but go back and retry and it repeats the same.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7572384176","version":"5.4.0","date":"2021-07-13T16:48:59.000Z","authorName":"GHT001","rating":3,"title":"Watch app doesn’t work","body":"Watch app is useless. Could be great if they could make it functional.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7572258321","version":"5.4.0","date":"2021-07-13T16:07:32.000Z","authorName":"t.westell","rating":1,"title":"Remote start and unlock doesn’t work","body":"Just downloaded this couple weeks ago worked great for a few days. Now I can’t start my truck from the phone and today my unlock won’t work either. App doesn’t seem like it works very well. Great idea though","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7571737474","version":"5.4.0","date":"2021-07-13T13:25:45.000Z","authorName":"Steep17836","rating":1,"title":"Terrible","body":"This was supposed to be an improvement the old version was much better.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7571598720","version":"5.4.0","date":"2021-07-13T12:40:33.000Z","authorName":"TimberlandBill1","rating":1,"title":"Unreliable since revision","body":"The app has been a problem since the redesign was released, I’ve had to reinstall the app weekly because the start button just says OFF and won’t let me start the car. I’ve told OnStar this and they tell me to just reinstall it which will work for a day or two but then it goes back to being useless again. I’ve also noticed the tire monitor doesn’t always match what the car says so I get notifications saying my tires are low but they’re fine according to the car and an independent pressure gauge. The app looks nice but it needs to be functional, dependable and accurate. Please fix these issues so we can enjoy it again.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7571593598","version":"5.4.0","date":"2021-07-13T12:38:58.000Z","authorName":"Safire8808","rating":3,"title":"Works great when it works","body":"Overall the app is handy, however, after a recent update I can no longer start my car with the app. The start circle just says “off” and will not respond to anything. Tried uninstalling and reinstalling the app with no change. Looked online for a solution and found nothing. Please fix this issue.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7569926389","version":"5.4.0","date":"2021-07-13T01:29:54.000Z","authorName":"Pregabalin","rating":2,"title":"Needs more features","body":"Could use more features like being able to schedule remote start.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7569918325","version":"5.4.0","date":"2021-07-13T01:26:41.000Z","authorName":"Y88Y88Y88","rating":1,"title":"Bring back the old version","body":"App is trash now. Might be ok if you’re new to it (post v5? - you’d know if you used the previous). They want to dictate the security on your phone, give you a couple flashy buttons on the main page and bury all the rest where before you could configure the layout. Seriously wish I never updated. Update notes keep saying they’ve “listened to us” so I keep hoping that there will at least be the OPTION to have the old app back. Why am I paying for this??","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7569827994","version":"5.4.0","date":"2021-07-13T00:50:52.000Z","authorName":"JoeSkate","rating":3,"title":"Watch App","body":"Can the watch app be fixed pls. Every time I try and use the app on the watch it tells me to log in on the app.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7569694462","version":"5.4.0","date":"2021-07-12T23:55:02.000Z","authorName":"avdaisy","rating":1,"title":"Don’t like update!","body":"This update is just not working for me, I liked how everything was set up on the old one!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7569457023","version":"5.4.0","date":"2021-07-12T22:09:40.000Z","authorName":"Stpat31773","rating":2,"title":"Constantly kicked off","body":"I generally like the app but it hardly allows me to stay my vehicle from app. I have to sign out then sign back in for it to work. Not all the time but a majority. When this occurs, it reads \"off\" where it should have the power on symbol on the middle. Another issue, I noticed I received low tire pressure warning but when I'm unable to start my vehicle, the report said no issues found. Then I sign out, log right back in and there's the warning and can stay my car. I've deleted, reinstalled and reset app. Nothing helps.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7569418277","version":"5.4.0","date":"2021-07-12T21:52:21.000Z","authorName":"sddj58","rating":3,"title":"Use of app","body":"For several months now when I open my app the screen is just black. I can not use this any longer. Would like some feedback as to what the problem could be.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7568831812","version":"5.3.0","date":"2021-07-12T17:51:05.000Z","authorName":"Andretti2SS","rating":3,"title":"Remote start","body":"The update of the app is a bit more confusing to navigate! I can’t figure out how to lock/unlock my doors or how to start my car from the app. The previous version was a bit more straight forward in my opinion.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7568763445","version":"5.3.0","date":"2021-07-12T17:25:35.000Z","authorName":"TurboChards","rating":1,"title":"App issues","body":"Constantly does not work.  Gets stuck on Chevy logo.  Uninstall re-install doesn’t work.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7568013451","version":"5.3.0","date":"2021-07-12T13:26:25.000Z","authorName":"MiniWex","rating":1,"title":"Blank screen","body":"When I open the app, the screen shows the Chevy logo, then goes dark gray and stays like that.  I have the most recent version of the app and an iPhone 12 mini.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7567624716","version":"5.3.0","date":"2021-07-12T11:11:41.000Z","authorName":"Happy Hour?","rating":4,"title":"Face ID","body":"Overall, it’s a great app. I just don’t know why the Face ID doesn’t work anymore.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7567334748","version":"5.3.0","date":"2021-07-12T09:12:09.000Z","authorName":"djehuti","rating":1,"title":"Was good","body":"Was a great app. I don’t like the new layout and I have had to delete it and reinstall due to then unlock bottom getting “stuck” and I’ll have to do it yet again.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7566281722","version":"5.3.0","date":"2021-07-12T01:47:14.000Z","authorName":"Tebassco","rating":1,"title":"Upgraded?","body":"It will not open. Only black screen?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7565458212","version":"5.3.0","date":"2021-07-11T19:54:51.000Z","authorName":"john tilis","rating":5,"title":"Won’t start","body":"Updated the app now my truck won’t start","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7565203698","version":"5.3.0","date":"2021-07-11T18:13:15.000Z","authorName":"OrangeFactor","rating":2,"title":"Latest Version Unreliable","body":"Saved logins don’t matter much when the app logs itself out after most updates. This makes the Apple Watch companion app completely worthless. Nothing convenient at all about getting a message to use your phone to logon and select vehicle anytime you try to use. We get this failed 70% or more of the time. \n\nFocus on reliability, and better UX. A lot of minor issues all around.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7564946636","version":"5.3.0","date":"2021-07-11T16:39:35.000Z","authorName":"Marlins79","rating":2,"title":"Bad update","body":"Since the update to the app appearance the start button won’t reset after starting the vehicle. It either stays in sent mode or off. I usually have to leave the app open for several minutes before it finally clears out and allows me to start the vehicle. Even if I don’t use the app for several days when I open the app it’s either in sent or off mode, and has to be open for several minutes before resetting. I’ve uninstalled and reinstalled the app only to have it work correctly the first two times before acting up again. I also don’t like the fact that I have to hold the button to operate any of the features of the vehicle, I preferred just having to tap it once to send the message to the vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7564150420","version":"5.3.0","date":"2021-07-11T12:19:56.000Z","authorName":"snelsonTX","rating":1,"title":"Will not unlock","body":"The app does not let me unlock.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7562673238","version":"5.3.0","date":"2021-07-11T02:19:12.000Z","authorName":"Cape MacMan Dave","rating":4,"title":"Remote Gas Tank levels- feature request","body":"Hey, wouldn’t it be handy to be able to see how full your gas tank is - or isn’t- remotely via this app?\n\nYou’d know without having to run out and start the car whether you need to leave early to buy gas. Or if you already had plenty for that big trip. \n\nYou could even set alarms to remind you when it goes below a certain level you can choose. \n\nPlease consider adding this feature. Thanks!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7561532667","version":"5.3.0","date":"2021-07-10T18:05:56.000Z","authorName":"a0l0a","rating":1,"title":"Not working","body":"Ever since the app was updated it’s hasn’t been working for me I have to delete it then reinstall it almost everyday.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7561090603","version":"5.3.0","date":"2021-07-10T15:28:21.000Z","authorName":"Nanita9987","rating":3,"title":"2020 Chevy Trax","body":"I currently can’t lock or unlock my car through the app. It either says failed or it is transparent to where I can tap it.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7560504044","version":"5.3.0","date":"2021-07-10T12:23:41.000Z","authorName":"Ga User 999","rating":3,"title":"Needs Improvement","body":"Twice in the last 2 weeks I have tried to unlock my truck via the app as my key fob was not on me. 1 time the lock and unlock buttons were not available (dimmed out) and the other time the unlock button was dimmed but it was locked. Need to have and update or sync button somewhere in the app so things will sync back up and the app know the status of the vehicle. Other than that I love the app and functionality with my truck.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7559145079","version":"5.3.0","date":"2021-07-10T03:09:02.000Z","authorName":"mallisonsmith","rating":2,"title":"Worse after the update","body":"I used to love the MyChevrolet App. However, after the most recent update, the app does not work as it should. I have had to reinstall the app multiple times just to lock and unlock my doors. This need is essential when keys happen to get locked into the car. This is something that needs to be corrected, as I am not the only one that is having this issue.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7559007751","version":"5.3.0","date":"2021-07-10T02:15:54.000Z","authorName":"Jkucz2","rating":2,"title":"Log in/ Apple Watch app","body":"I have the leave me logged in enabled but that doesn’t happen. Constantly I have to keep logging into the app. Also what’s the point of having an Apple Watch app with remote features if you can’t even use the app. Tells me to log in and select a vehicle. I do this and it works for a few hours and then I have to select a vehicle again… mostly the main reason I bought an Apple Watch was to not have my phone on me and I can remote start my truck.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7558984196","version":"5.3.0","date":"2021-07-10T02:06:47.000Z","authorName":"marcusamantite","rating":3,"title":"Good app but having difficulties","body":"All of a sudden every time I try to use the lock or unlock feature it says the truck is already unlocked so I can’t unlock the truck and the truck info won’t update it just tries updating forever and never updates. I don’t know hat to fix this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7558847648","version":"5.3.0","date":"2021-07-10T01:12:44.000Z","authorName":"Sputnik5871","rating":3,"title":"Troublesome app","body":"Twice in as many weeks I’ve had to delete and reload the app. First to rectify the unlock button that would not work and kept saying it was unlocked. Second the app would not start nor unlock my 2019 Silverado. \nThe old app was never a problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7558656295","version":"5.3.0","date":"2021-07-09T23:53:30.000Z","authorName":"Cy514539","rating":1,"title":"Keep Crashing if your system language was not English","body":"Keep Crashing if your system language was not English, there are no way to open this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7558623676","version":"5.3.0","date":"2021-07-09T23:39:19.000Z","authorName":"aj37594","rating":1,"title":"Requires constant deleting and reloading","body":"The app after its major update that changes the face of the app home screen has resulted it no longer functioning. I have to delete and redownload the app in order to lock and unlock my truck. Extremely poor app support as well.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7558579677","version":"5.3.0","date":"2021-07-09T23:20:16.000Z","authorName":"Bdjshhajahdjhsbwjajx","rating":3,"title":"It's aiight","body":"It works when it wants to. All I know is if this app don't stop freezing up ima demand a refund","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7558527020","version":"5.3.0","date":"2021-07-09T22:56:52.000Z","authorName":"Pandahubs","rating":1,"title":"Can't use remote start","body":"The only reason I pay the subscription is so I can use remote start from the app (which should be free to begin with 🙄) and I can't even use it. It will let me lick and unlock but it does nothing when I press and hold the remote start. It used to work just fine until a week ago, so I know it's not user error.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7557844885","version":"5.3.0","date":"2021-07-09T18:06:41.000Z","authorName":"LeLe0608","rating":2,"title":"Unreliable","body":"This app would be great if it was reliable. Randomly will not allow me to use the start vehicle feature. Very frustrating since Onstar charges extra for this “service”.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7557625969","version":"5.3.0","date":"2021-07-09T16:47:55.000Z","authorName":"Meggers79","rating":1,"title":"App won’t open","body":"Since the last update, the app won’t open. It just shows a black screen. Very frustrating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7557187654","version":"5.3.0","date":"2021-07-09T14:29:44.000Z","authorName":"Over21!","rating":1,"title":"No longer opening!!","body":"This app was working a month ago and since last week it just clocks with 3 dots bouncing up and down.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7556976564","version":"5.3.0","date":"2021-07-09T13:27:03.000Z","authorName":"Col Austin","rating":1,"title":"21st Century should work better","body":"The update brought it up to 2015 standards.  I can walk outside and start the truck by the time the app loads,  eventually validates and gives me a Home Screen. It’s choppy and freezes. FYI - 256gb iPhone 11 Pro Max so it’s not the phone. We just can’t seem to get technology up to current,  much less ahead!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7554630946","version":"5.3.0","date":"2021-07-08T21:45:15.000Z","authorName":"Abcd666666","rating":1,"title":"Multiple Issues","body":"It keeps logging me out ever so often. I have had to reset passwords more than a few times. It does not sync with the server to store details. Why bother to have the app, if I cannot use it to remote start my vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7554503159","version":"5.3.0","date":"2021-07-08T20:49:22.000Z","authorName":"Cycyh","rating":1,"title":"Horrible since last upgrade","body":"Why must you continually mess with stuff that works. I have do delete and reload my app everytime i want to use it since the last upgrade. Keep up that great work.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7554446504","version":"5.3.0","date":"2021-07-08T20:25:23.000Z","authorName":"help this app please","rating":1,"title":"App not working since update.","body":"Apple Watch will not unlock truck unless app is open on my phone. Major issue when you lock your keys and phone in the truck and watch will not function. Used to work flawlessly now it is junk.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7553814474","version":"5.3.0","date":"2021-07-08T16:23:47.000Z","authorName":"Corki469","rating":1,"title":"Don’t work!!!","body":"When I  hit it the screen goes dark blank.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7551507659","version":"5.3.0","date":"2021-07-08T02:24:01.000Z","authorName":"RFreed515","rating":1,"title":"Latest update defective","body":"As of the latest update I can no longer lock or unlock my vehicle.  I pay for premium onstar services so not pleased with this defect. Please resolve ASAP.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7551338417","version":"5.3.0","date":"2021-07-08T01:19:25.000Z","authorName":"JavianP","rating":3,"title":"It’s still messing up","body":"It’s working much better, but the remote start sometimes just doesn’t work all. Like I can even attempt all it says is off","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7550567615","version":"5.3.0","date":"2021-07-07T19:45:57.000Z","authorName":"Bring back remote controls","rating":1,"title":"The update made the app worse","body":"Since my app updated, it has been nothing but problems. Now my button to start the car says off, and even after holding it, nothing happens. The weather is in the 90’s and I would like to have my car running before I get in to make it cooler. If my car is to far from the house to use, or when leaving work, I can’t start the car in the parking garage. Not happy at all. Last time I I had issues I couldn’t start the car from the app in the winter.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7550514839","version":"5.3.0","date":"2021-07-07T19:24:47.000Z","authorName":"DevinG42","rating":2,"title":"Used to be good","body":"This app was amazing when it worked right. The redesign was even great. But with the newest update, it’s just a black screen for me now. Reinstalling doesn’t work, no way to log out, and even my Apple Watch complication and app don’t work anymore.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7550104100","version":"5.3.0","date":"2021-07-07T16:54:24.000Z","authorName":"wvtraderinnsc","rating":1,"title":"Very disappointed","body":"The latest version of this app updated and now it requires me to have an Onstar service to use the remote key features.  Really Chevrolet??? I had this free since I purchased my Silverado in 2016 and now you require me to have an Onstar subscription!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7549804031","version":"5.3.0","date":"2021-07-07T15:17:08.000Z","authorName":"MadMaxx0530","rating":4,"title":"Great app","body":"Update……. I’ve always love this app and then as my review says things changed I was not able to start my car without having to hold the button in for up to five minutes. Now it only happens within seconds! I am very happy with it again. Thank you for the adjustment. The only thing different now is I am not able to lock or unlock my car using the app anymore .. i’m hoping that changes. I am changing the one star rating to a four star rating :) I got this app back in 2018 when I purchased my vehicle and I absolutely loved it and raved about it. About a month ago when you guys did the new update, it takes forever for you to hold the button to get it started. There’s times I have to hold it for up to 5 minutes before it will start rather than just tapping it like before. I hope this changes","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7549351903","version":"5.3.0","date":"2021-07-07T13:03:17.000Z","authorName":"Pastor Sheats","rating":1,"title":"Not working","body":"Scene i traded my traverse in for a Colorado my app won’t work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7547501042","version":"5.3.0","date":"2021-07-07T01:03:48.000Z","authorName":"Tony_T_8","rating":1,"title":"Newer is not better","body":"I had very limited issues ever before the app update. I have deleted and reinstalled the updated app more times than I can count. My wife has had so many problems with her my Chevy app that on-star gave her a month free. I don’t want free, I want a functioning app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7546673759","version":"5.3.0","date":"2021-07-06T19:19:36.000Z","authorName":"emdawg51","rating":1,"title":"Very buggy","body":"Doesn’t give me the ability to lock/unlock my car and says it’s unlocked without me ever holding that down- thankfully it wasn’t unlocked but basically all I can do is sound the alarm, and the lag between commanding it and it actually performing is so bad, once your alarm is going off it takes a good 30 seconds for your stop alarm action to come into effect.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7546661441","version":"5.3.0","date":"2021-07-06T19:14:59.000Z","authorName":"fjdbfndn","rating":1,"title":"New update doesn’t work","body":"The new version of the app doesn’t work and only shows a grayed out screen! This needs to be worked out so people can use the app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7545901988","version":"5.3.0","date":"2021-07-06T15:00:09.000Z","authorName":"Bmike2727","rating":1,"title":"7/6/21 app has a lot of issues","body":"Since the last update I’ve had to uninstall the app several times because of the buttons that we now have to hold down are stuck/ frozen in place and will not reset. Example I went to unlock my truck and the button is highlighted and will not accept the new command. Ridiculous that a app that worked no longer does . .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7545726911","version":"5.3.0","date":"2021-07-06T14:08:21.000Z","authorName":"Yerfono","rating":1,"title":"Key fob not working","body":"The main reason I liked the app is because I was able to use to key fob to lock, unlock, and start my car, now I don’t even have the option to do get to the key fob. Very frustrating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7545134683","version":"5.3.0","date":"2021-07-06T10:55:38.000Z","authorName":"IasquaredI","rating":3,"title":"Not able to lock/unlock the car","body":"After the recent update I am no longer able to lock or unlock the car.  I’m hoping this will be be fixed soon.  The app was great until this update.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7544866837","version":"5.3.0","date":"2021-07-06T09:09:43.000Z","authorName":"JE8156","rating":1,"title":"Does not work when needed","body":"When I really needed the remote key fob functionality, for which I pay, the App let me down. It is discontinued or broken in a latest update. The App is now focused on keeping you going to your dealership for services and selling you OnStar products, most of which you don’t really need if you have a cell phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7543763018","version":"5.3.0","date":"2021-07-06T01:32:44.000Z","authorName":"Jiharrell","rating":1,"title":"App not working after update","body":"I rely on this app for the remote lock/unlock feature often. The app won’t even open now. Wish I hadn’t updated. Will there be an update to fix the issue soon? It’s been 4+ weeks since the last update.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7543438955","version":"5.3.0","date":"2021-07-05T23:14:14.000Z","authorName":"car3:4","rating":1,"title":"App no good","body":"The app havent been working for months now its just a blank screen everytime i go on it even when I delete and re download it nothing happens","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7543175259","version":"5.3.0","date":"2021-07-05T21:18:24.000Z","authorName":"ITWASNTHENAILS","rating":5,"title":"Onstar","body":"Wish onstar had a cheap basic tier that had only car start","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7543148861","version":"5.3.0","date":"2021-07-05T21:06:42.000Z","authorName":"Nail07","rating":2,"title":"Locking and Unlocking feature","body":"I’m not sure why this app is no longer Locking and unlocking my car. Please fix","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7543062222","version":"5.3.0","date":"2021-07-05T20:29:42.000Z","authorName":"Jake from...not State Farm","rating":1,"title":"App NOT Working","body":"Worked fine earlier today. All of a sudden it stopped working and told me I needed to update the app. Did so. Still telling me the same thing. Unusable at the moment. Please fix ASAP\n\nUPDATE:  Now it won’t let me unlock my doors through the App. GARBAGE","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7542524266","version":"5.3.0","date":"2021-07-05T17:05:35.000Z","authorName":"jon11235813","rating":1,"title":"Not working with new iOS","body":"Downloaded the new iOS and now the app doesn’t work.  Just a black screen","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7542273178","version":"5.3.0","date":"2021-07-05T15:41:17.000Z","authorName":"Kaakaapoopoo","rating":1,"title":"App is not working","body":"I have been trying to access this app for months now and it just gives me a blank screen. No option to open anything up. Not sure why it’s not working.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7539012832","version":"5.3.0","date":"2021-07-04T17:15:42.000Z","authorName":"MartyMar45","rating":1,"title":"Chevy app not working","body":"The app is currently not working properly. Does not allow me to unlock or lock my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7538704829","version":"5.3.0","date":"2021-07-04T15:30:46.000Z","authorName":"Sabol611","rating":1,"title":"Useless after update","body":"Since the last update It takes several attempts just to log in, it logs me out and Face ID no longer works and I can not use with my Apple Watch because it logs me out and won’t save the pin.  \n\nPlease update soon so I’m not wasting my money for the Onstar connected services.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7538469578","version":"5.3.0","date":"2021-07-04T14:18:19.000Z","authorName":"Mac72400","rating":1,"title":"Can’t use remote features","body":"Why is my unlock button grayed out and i’m unable to use it??","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7537112949","version":"5.3.0","date":"2021-07-04T06:11:48.000Z","authorName":"B33fM4n","rating":1,"title":"The update is so bad I cancelled OnStar","body":"Probably the single reason I won’t purchase another GM product. Don’t bother telling me to email someone, you think that’s good customer service?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7535060473","version":"5.3.0","date":"2021-07-03T15:43:21.000Z","authorName":"ar19*","rating":2,"title":"Can’t get my app to work","body":"I really did like the app and ability to remote start and unlock my car. But I haven’t been able to get the app to work in months! I have tried everything from restarting the app, redownloading the app, restarting and updating my phone. It opens up to a black screen. I really hope something happens to fix that. I give it 2 stars because when I could get it to work it was great, but since April it’s been worthless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7534955693","version":"5.3.0","date":"2021-07-03T15:09:56.000Z","authorName":"PattyPressure","rating":3,"title":"Glitch!","body":"Once it’s been unlocked, started, etc., it won’t reset the button so I can’t unlock, start it, etc., even days later. I have to delete the app and download it again.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7533157140","version":"5.3.0","date":"2021-07-03T04:08:27.000Z","authorName":"JeremyJamie","rating":1,"title":"Remote unlock/ lock feature not working","body":"Ability to lock and unlock vehicle recently stopped working. All I can do now is remote start from the app. I can no longer lock or unlock my vehicle with the app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7532689106","version":"5.3.0","date":"2021-07-03T01:01:46.000Z","authorName":"cr ii","rating":1,"title":"Unreliable","body":"Great when it works.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7532452901","version":"5.3.0","date":"2021-07-02T23:18:59.000Z","authorName":"Mlisagor","rating":2,"title":"Buggy","body":"It keeps logging me out despite me checking the box to prevent this from happening. This is annoying because it makes the Apple Watch app useless if you are not signed in.\n\nUPDATE: I uninstalled like they asked and it still logs me out.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7532414583","version":"5.3.0","date":"2021-07-02T23:01:29.000Z","authorName":"Bob4653","rating":3,"title":"Chevy app","body":"I won’t open, do I need to delete and re-install","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7530985300","version":"5.3.0","date":"2021-07-02T14:10:57.000Z","authorName":"Christian Bio","rating":1,"title":"Crashes regularly, but when operable, is adequate.","body":"This is one of the worst apps on my phone. Crashes 9/10 times. There isn’t an alternative to the Chevy app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7529153877","version":"5.3.0","date":"2021-07-02T02:43:04.000Z","authorName":"Tenacious 15785433","rating":1,"title":"Buggy","body":"Not opening at all. Was working before now nada. Any idea when it will be back up?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7528433512","version":"5.3.0","date":"2021-07-01T21:43:57.000Z","authorName":"Nesselrode201","rating":1,"title":"Doesn’t work","body":"I really wanted this app to work right.  It constantly informs me that I have a diagnostic issue based on something plugged into my  port.  I’ve never had anything plugged into the port.  It does not track my charge mileage although it’s supposed I get two dash marks where the mileage is supposed to show. I’ve spent hours on the phone with GM and On Star where they have tried and failed to fix these problems over the last three months.  The issues have been elevated to level 3 in the technical group.  Nothing ever improves and the feedback is crickets.  I’m sorry it doesn’t work for me but if I could have rated it 0 stars I would have.  Tomorrow I cancel On Star.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7528060156","version":"5.3.0","date":"2021-07-01T19:07:30.000Z","authorName":"16Diesel","rating":3,"title":"Fob controls gone","body":"Was working fine up until a few weeks ago. Now just shows “shop accessories” over where the fob controls would normally be. I cannot get to the fob controls. Fix your app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7528051234","version":"5.3.0","date":"2021-07-01T19:03:58.000Z","authorName":"becsumm","rating":4,"title":"Elimination of movement arrow on vehicle locate","body":"Why did you do that? It was a very informative and step saving feature. Now it’s gone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7524957674","version":"5.3.0","date":"2021-07-01T00:38:32.000Z","authorName":"Debkins2","rating":4,"title":"Different look but much slower","body":"Updated the app recently and it has a whole new look.. which is attractive, however it is much slower and frequently times out.  I used to almost be able to watch a vehicle turn by turn but now it is 15+ seconds between updates.. is this normal?  Just curious if this is the new norm for this.. thanks!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7524903095","version":"5.3.0","date":"2021-07-01T00:16:37.000Z","authorName":"A Caples","rating":2,"title":"Good App when it works","body":"I have had to delete and re-install the app multiple times. Because the remote start feature stops working, the Face ID stops working or it constantly logs me out.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7524877467","version":"5.3.0","date":"2021-07-01T00:06:11.000Z","authorName":"Graet","rating":2,"title":"Great app…when it works","body":"Depending on this app for quick remote starts from either my phone or watch is futile. I find it crashed just about every time I try to open it. This leads to forgotten PIN and password and deactivated FaceID. And makes it totally useless on my watch. I’ve used it over the last few years on 2 or 3 different iPhones with 3 different Chevy vehicles. Same behavior from the start.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7524714615","version":"5.3.0","date":"2021-06-30T22:56:59.000Z","authorName":"Ravenhair49","rating":1,"title":"Not working","body":"App worked fine then suddenly nothing.  It shows my car locked and the unlock feature doesn’t work.  App is not being fixed.  Frustrating since I pay for this every month.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7524629669","version":"5.3.0","date":"2021-06-30T22:20:22.000Z","authorName":"Blake A B","rating":1,"title":"No Longer Works","body":"All of the functions minus shipping for accessories have stopped working.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7524228342","version":"5.3.0","date":"2021-06-30T19:31:54.000Z","authorName":"Cspradlin","rating":1,"title":"Inconsistent and unreliable","body":"This app doesn’t work all the time. Opening it takes forever. I should have the option to turn off the passcode. I already have a passcode for my phone. I don’t need a passcode for this app. It takes forever to get into it to start my truck. Also there is no widget. Why not. Single button to start my truck right in my widget screen…yes please. Smart locks for my home have widgets, why not Chevy? The watch app is completely broken. It never works. Hasn’t worked since day one. It’s a shame too because that would be the best. This app is just really bad. Lots of other apps that can do the same things that do it way better. The UI is not good either. It would be super easy to put all the buttons on one screen. 😂🤣 but you have to hit “more” to get to the last 2 buttons. Also a status update telling you if your vehicle is unlocked or locked or running or off would be great. And why is there no Siri integration? This is just a bad app. I paid for a year but unless it gets some serious attention, I will not pay again. You can do better Chevy. Ram did……🤷‍♂️","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7523928598","version":"5.3.0","date":"2021-06-30T17:40:22.000Z","authorName":"SilveradoLTZ","rating":1,"title":"App does not always work","body":"I am paying for this service and it seems like 30% of the time it does not work!  \nSeveral times the app would not unlock my doors.  Today it will not start my truck.  \nWhat am I paying for?!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7520913883","version":"5.3.0","date":"2021-06-29T23:41:37.000Z","authorName":"Merlin601","rating":2,"title":"Not real handy","body":"The old version was okay, but the new version the unlock feature is now disabled.\nPretty useless if you can’t use the phone to unlock your truck if you don’t have your keys handy!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7520453591","version":"5.3.0","date":"2021-06-29T20:26:04.000Z","authorName":"thatmathguy","rating":1,"title":"Does not work","body":"The app keeps crashing on me. If it’s not crashing, it will log me in and then ask me to put in my car info. After I do that it spins and spins just to send me back to the login page and have to do it all again and keep getting the same results. I have both my phone and the app fully up to date. I’ve deleted the app and reinstalled it, but I shouldn’t have to do this to be able to use the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7519906199","version":"5.3.0","date":"2021-06-29T17:00:59.000Z","authorName":"U.S.C.G.BM1","rating":1,"title":"App is total trash","body":"I’ve had this app for years since the recent update it does not work. I know I’ll get the standard response and I’ve already read all the other reviews. Yes I’ve deleted and reinstalled. Now every time I try to add my vehicle it freezes and I have to log back into it. This is typical of Chevrolet and the overall service I’ve received over too many years. My next vehicle purchases will not be with GM so help me god.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7517538596","version":"5.3.0","date":"2021-06-29T02:08:35.000Z","authorName":"bovee1234","rating":4,"title":"App not working","body":"Every since I got my new iPhone 12 plus, this app doesn’t work anymore. I’ve deleted the app and still won’t work.\n\nUpdate: I did something (don’t ask)and it is now working. Customer service did reach out to me to rectify the issue but it is resolved. I love this app because I have control over my vehicles where every they are!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7517199451","version":"5.3.0","date":"2021-06-28T23:46:36.000Z","authorName":"Mister Plow","rating":3,"title":"Stay Logged In Does Not Work Rendering Apple Watch App Useless","body":"The stay logged in setting for the app does not work.  The switch is toggled but every time I try to use the app, it wants the OnStar password.   And because of this, the Apple Watch App no longer works as the watch instructs you to login on your phone.  The previous version of this app used to retain the stay logged in setting.   Please fix this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7517191135","version":"5.3.0","date":"2021-06-28T23:42:53.000Z","authorName":"Ray.T66","rating":5,"title":"Problem with remote start","body":"App has been great for a long time now. I like the new dashboard layout. I especially like that the button to start the car now has the new glow so that you can see that it is activating.\nHowever, a bug was introduced in the latest rev that the button stays at displaying “Sent” after you use it once. Even after driving. Even after restarting the app. \nSo now it is a start once only, until the next app update... \nI’m hoping this gets fixed soon, but otherwise it’s a great app and deserves 5 stars.\n\nUpdate:\nDon’t know why, but after my review I tried logging out and closing the app. Initially I had just restarted my phone and the app. Logging out worked. Something reset during the login? \nAnyway it’s working perfectly now!\nUpdate from 4 stars to 5 on this great app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7517120246","version":"5.3.0","date":"2021-06-28T23:11:21.000Z","authorName":"Chill-House","rating":1,"title":"I get black screen!?","body":"Even updated version won’t do anything. Only thing after a while it says your signed out… it’s not working at all!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7516836602","version":"5.3.0","date":"2021-06-28T21:09:19.000Z","authorName":"C Grif","rating":2,"title":"Need help. App doesn’t work.","body":"Hi. My chevy app no longer works. It has disappeared or gone dormant. I try to open and at first I see the chevy bow tie but then my screen goes dark and nothing comes up.  I am unable to delete it and reinstall. What next?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7516588902","version":"5.3.0","date":"2021-06-28T19:33:37.000Z","authorName":"D. Czar","rating":1,"title":"Horrible Design!!!!","body":"This app is terrible. You would think a big company like Chevrolet would put more effort into their app. It’s so bad, I’ve just deleted it. It’s not worth the frustration. So disappointed that with all this technology built into my new truck, they can’t create an app to work with the vehicle. So bad it has me rethinking buying another Chevrolet in the future. That’s hard to say for a die hard Chevy fan, but I feel this strongly about how awful this app is!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7515109893","version":"5.3.0","date":"2021-06-28T11:31:39.000Z","authorName":"snw151","rating":1,"title":"Bad update","body":"The app has worked perfectly from day one. However the last time I updated the app it caused the remote start button to be stuck in the truck off position. When that happens it makes it impossible to start the truck. Need a new update to fix the issue.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7513829884","version":"5.3.0","date":"2021-06-28T02:25:09.000Z","authorName":"Dr g in Enola","rating":2,"title":"App is not as good as it was.","body":"I used to like the app. I used it to check status and especially liked the remote start in cold weather.  It’s response time was pretty good.   Now, most of the time, it fails to connect. The fix is to start car to reconnect. If you are using the locate function to find the car, that would be a little hard. I don’t know why the app went down hill so much, but the nicer graphics are no replacement for poor reliability.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7513674098","version":"5.3.0","date":"2021-06-28T01:17:39.000Z","authorName":"Hetter88","rating":2,"title":"Very Disappointed","body":"Since the last update I have had nothing but issues. I have to reinstall the app four times because it eventually will get stuck on the last command. Once it gets stuck I cannot do anything except uninstall. It also keeps asking me to enable biometric even though it is already enabled. \n\nI am a new Chevy owner and probably will not purchase this service after my free trial is up. To much of a headache. \n\nTwo stars only because when the app is not glitching I do like the features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7513615064","version":"5.3.0","date":"2021-06-28T00:51:41.000Z","authorName":"KeepitMovingPeople","rating":1,"title":"Aggravating!","body":"Since the recent “updates” this app works horribly! I continuously have to delete and reinstall the app for it to work, if that’s what you would call working. When I open the app to lock or unlock my vehicle the function is ghosted so you can’t even select it to use. I cannot imagine what this scenario would look like if I was having an emergency! The original version worked perfectly fine for me without any hiccups.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7513315675","version":"5.3.0","date":"2021-06-27T22:31:26.000Z","authorName":"Hgfhhhfggg","rating":5,"title":"Not reliable","body":"The older version was better than this new one. Never works properly. Garbage. Not even a way to send feedback.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7512410884","version":"5.3.0","date":"2021-06-27T16:24:28.000Z","authorName":"justthetip7","rating":1,"title":"They ruined the app","body":"I loved the old app. All you had to do is just push a button and move on to lock/unlock or start your car. Now you have to sit there and hold it. Second thing is and I've tried reaching out to them to get help on this issue but I'll open the app and it says \"off\" on the button to start the car. Since they haven't been helpful with this I have had to delete the app and add it again and login and everything. I hate it this app. I just want to be able to push the button and go about my business and not have to sit there and hold the button down and wait to see if it was \"sent\"","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7510976108","version":"5.3.0","date":"2021-06-27T08:07:49.000Z","authorName":"joshgjohnson","rating":2,"title":"Fancy looking garbage","body":"I’m honestly about to cancel the whole OnStar deal and delete the app because it’s worthless. They have a box that you can check to “keep me logged in” for 365 days, but every time I open the app I have to login again and then use my passcode only to have to login again. It’s like a weird loop. Once you’re logged in everything is good, but it makes the watch experience useless because literally every time I open the watch app it tells me I need to login with my phone and have to have my phone and it needs my phone for something. So… Why do I have a watch with cellular and can go without my phone and even pay for purchases but this app needs my phone and forces me to login constantly? I liked the older version when this problem didn’t exist.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7509706589","version":"5.3.0","date":"2021-06-26T23:26:03.000Z","authorName":"kandjcreationsnh","rating":2,"title":"Unlock not working after update","body":"Unfortunately after the most recent update they lock button won’t work on my app. If it were working I’d definitely give it 5 stars!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7509681694","version":"5.3.0","date":"2021-06-26T23:14:52.000Z","authorName":"tickedoff2019","rating":1,"title":"App","body":"I can’t get my app to open. Just has the black screen with the Chevrolet emblem on it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7509449029","version":"5.3.0","date":"2021-06-26T21:27:23.000Z","authorName":"MELISSADFLORES","rating":3,"title":"Difficult","body":"I can’t access my keys to lock and unlock my truck from the app after this last update","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7509336799","version":"5.3.0","date":"2021-06-26T20:38:32.000Z","authorName":"jrohm","rating":1,"title":"Poor QA. Developer out if touch with users needs","body":"I have had my 2016 Volt for nearly 5 years. About a year ago Chevy pushed us to this nee app and has been rapidly updating it. However, with every update it appears the app gets less and less stable and fewer features. I also recently discovered that they plan to retire the web interface from my computer. I like the ability to update the cars and features over time, but Chevy is using that to remove features I need and paid for. Totally unacceptable and tone deaf to consumers.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7509178122","version":"5.3.0","date":"2021-06-26T19:31:49.000Z","authorName":"Blackoakian","rating":1,"title":"Doesn’t work.","body":"look above","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7509152204","version":"5.3.0","date":"2021-06-26T19:20:57.000Z","authorName":"fred88ne","rating":2,"title":"Unlock/Lock","body":"The unlock and Lock feature doesn’t work most of the time. I’ve deleted and reinstalled and it don’t seem to help.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7508384688","version":"5.3.0","date":"2021-06-26T14:54:19.000Z","authorName":"mmaynar1","rating":1,"title":"Grey screen","body":"This app is useless now. It never loads and just shows a grey screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7507889668","version":"5.3.0","date":"2021-06-26T12:18:24.000Z","authorName":"boet6","rating":1,"title":"Diagnostics","body":"Cannot receive a diagnostic report . The app constantly says there’s something plugged into the port. I have called on star, deleted the app several times and had it reset at the dealership . It’s still there. My last vehicle I had zero issues with the app this time nothing but problems .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7507888709","version":"5.3.0","date":"2021-06-26T12:18:04.000Z","authorName":"Georgiagal8","rating":1,"title":"Version 5.3.0 won’t unlock","body":"The app has worked great for over a year. However this latest update version 5.3.0 the app will no longer unlock the car and has prevented the watch app from working as well. The lock button stays highlighted with a yellow ring and the unlock button js greyed out not giving you the option to send the command. The watch app allows you to send the command but gives you an error message and won’t complete the task. This proved most frustrating & embarrassing at the beach when I had to get my 2 young children off the beach, walk through a restaurant, pools, hotel lobby/ground level and parking lot to use my key fob for a friend all because the app won’t work. My fiend said note to self don’t buy a chevy since their technology doesn’t work. She has a Ford.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7505806300","version":"5.3.0","date":"2021-06-25T21:59:05.000Z","authorName":"Kylie'smommy42006","rating":2,"title":"Used to be great","body":"Since the upgrade it rarely works.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7505174363","version":"5.3.0","date":"2021-06-25T17:43:07.000Z","authorName":"Emms'","rating":1,"title":"Doesn’t work","body":"Worked fine for a while and now Every time I open the app it just goes to a Gray screen no matter how many times I close it and reopen it. Remind me again why I pay OnStar so that I CANT use the features of this app.  Really frustrating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7504599664","version":"5.3.0","date":"2021-06-25T14:40:35.000Z","authorName":"Jennavell","rating":2,"title":"Grey screen","body":"My tire blew on the highway, and when I tried to get into the app to get ahold of my roadside assistance, I had nothing but a grey screen while I had an emotional breakdown on the side of the road.  It did save once when I was loading my groceries and put my purse in my trunk and was able to unlock my car with the app.. but now I can’t even do that.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7503013541","version":"5.3.0","date":"2021-06-25T04:32:08.000Z","authorName":"MamaDietzer","rating":3,"title":"Not opening","body":"It seems when I need this app the most it doesn’t work.  Very disappointed. For example I need to lock my car from a hotel room and only the Chevy logo appears and the screen goes black.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7502874266","version":"5.3.0","date":"2021-06-25T03:33:24.000Z","authorName":"Asfghfsftxfd","rating":2,"title":"Not working","body":"I went to unlock my 2017 Silverado today. The app said it was already unlocked. It was locked. No matter what I have tried it still shows it as being unlocked even when it is locked. Frustrating to say the least.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7502359246","version":"5.3.0","date":"2021-06-24T23:54:58.000Z","authorName":"10101010101010101000001010101","rating":1,"title":"Zero stars","body":"For some reason I am unable to unlock my truck. I can’t lock it or anything. All I can do is start it. Are you going to fix this app or should I just purchase a different brand vehicle?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7501743496","version":"5.3.0","date":"2021-06-24T19:23:48.000Z","authorName":"Whozay86","rating":3,"title":"Very Buggy","body":"App is very buggy within the last few weeks’ updates.  Sometimes won’t let me start my vehicle and it currently won’t allow me to unlock my vehicle.  App def needs attention.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7500904201","version":"5.3.0","date":"2021-06-24T14:28:23.000Z","authorName":"plovelace102","rating":1,"title":"Can’t log in","body":"My wife and I both have this app. We traded in our old car and bought another. My wife uses the app and loves it. Then we got a new car (Chevorlet) the dealership said it would load. I went to go in and all I get is a black screen., nothing nada and hers did the sane thing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7500812380","version":"5.3.0","date":"2021-06-24T14:00:25.000Z","authorName":"Player 6789221","rating":3,"title":"Blank screen","body":"I like this app - until today: it’s just a blank screen. I’m on latest IOS. Please fix!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7500283194","version":"5.3.0","date":"2021-06-24T11:04:47.000Z","authorName":"richarddlig","rating":1,"title":"App is broken after update","body":"Just a grey screen","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7500051700","version":"5.3.0","date":"2021-06-24T09:32:18.000Z","authorName":"pdh623","rating":1,"title":"Unreliable APP","body":"The APP is constantly failing.   You download it one day and later in the day you get a black screen.  Customer Service can’t help solve the problem .  I use an IPhone 11 too.  Too much trouble to deal with can’t depend on it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7498371253","version":"5.3.0","date":"2021-06-23T21:08:49.000Z","authorName":"Mister Music","rating":1,"title":"Latest update broke app","body":"The latest update broke the app. The door lock button is highlighted and is non responsive. The unlock is dimmed and also unresponsive.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7498264198","version":"5.3.0","date":"2021-06-23T20:23:00.000Z","authorName":"mrc0508","rating":4,"title":"Has become unstable","body":"Been using the app for 3 years \nRecently like in the last 2 weeks \nIt has become very unstable and freezing \nUp \nHave to constantly delete and reinstall to make it work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7497424279","version":"5.3.0","date":"2021-06-23T15:22:23.000Z","authorName":"Mike's northern star","rating":1,"title":"Remote lock/unlock now require paid plan","body":"When I first got my car the app was awesome. The main feature I wanted was the remote lock and unlock in case I locked my keys in and it worked like a charm. I haven’t needed it in a while and I tried to open the app today and there was just a black screen. So I uninstalled and reinstalled the app. After signing in the app came up no problem. Everything looks different but that’s okay. But my lock/unlock feature is nowhere to be found.  I checked the description of the app in the App Store and noticed the asterisk by the feature *requires a paid plan. Why?!?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7497420123","version":"5.3.0","date":"2021-06-23T15:21:06.000Z","authorName":"ayersracing15","rating":2,"title":"Good concept…doesn’t work for me.","body":"The concept is great but I cannot get the app to come up. Downloaded it and it just sits on the icon screen. I tried uninstalling and reinstalling with no luck. I have no issues with my GMC app. Maybe an update is needed?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7497333774","version":"5.3.0","date":"2021-06-23T14:55:28.000Z","authorName":"rtme24","rating":3,"title":"Buggy","body":"My app quit working. Deleted my info. Reload and continues to ask for bin Ngoako. When enter goes right back to login","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7495712517","version":"5.3.0","date":"2021-06-23T04:53:27.000Z","authorName":"jaron137","rating":1,"title":"Crappy! (Not the fish)","body":"Crappy app, had to delete and re-download several times to make the remote features work!!!  It’s glitchy and gets hung up often. Doesn’t matter how good of device you have or WiFi. Just crappy!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7495317301","version":"5.3.0","date":"2021-06-23T02:14:11.000Z","authorName":"2020 Silverado","rating":4,"title":"Smart driver","body":"Does not keep up smart driver like it once did. Has not displayed the last 3 days of trips. A few months ago the info was there immediately after the trips!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7495040966","version":"5.3.0","date":"2021-06-23T00:26:03.000Z","authorName":"Bearsfan4life","rating":1,"title":"Why…","body":"Why does it keep telling me to connect to onstar after I already did that. Fix the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7494591318","version":"5.3.0","date":"2021-06-22T21:13:29.000Z","authorName":"Kdowentx","rating":1,"title":"Can’t get status","body":"In app, click vehicle status and get page where I can schedule service but it does NOT show me my vehicle status. Nothing about recalls (which there are a bunch on 2021 Tahoe), can’t see tire pressure, can’t see oil level. No status.\n\nAfter working with GM’s Social Media Support Team I have realized that this app is only good for 2 things: to schedule maintenance and to have GM try to sell you OnStar services or accessories.  Don’t bother, it is not worth the hassle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7494454158","version":"5.3.0","date":"2021-06-22T20:18:57.000Z","authorName":"Slane86","rating":2,"title":"Redesigned Version","body":"I like the layout of the redesigned app. But ever since the update, the app constantly shuts down after a minute or two.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7494119397","version":"5.3.0","date":"2021-06-22T18:14:04.000Z","authorName":"CsHeL88","rating":3,"title":"June update issues","body":"Just like everyone else, after the update I can’t open the app. Just a blank grey screen. The app was nice since you could basically do anything on it, like schedule maintenance and use OnStar. Hopefully the app will be fixed soon.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7493540665","version":"5.3.0","date":"2021-06-22T15:02:33.000Z","authorName":"NMC Boston","rating":1,"title":"Truck won’t remotely start since my last update","body":"Every since the last update to the app, my truck app remote start has not been working. This is very disappointing Bc I have to walk out to my truck at home and at work. Hope there is a patch to this soon. I like to have my truck warmed up before I go to work or go home .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7493130755","version":"5.3.0","date":"2021-06-22T12:55:40.000Z","authorName":"boboblh","rating":2,"title":"Lock and unlock features not working.","body":"My app has been having some issue since the update. My app is not giving me the option to lock or unlock my car. I’m a huge fan of this feature and it is definitely the component I use the most. The lock button seems to be locked or stuck and doesn’t actually allow me to lock my vehicle when it is unlocked. The unlocked button is grayed out like it isn't an option. \nVery disappointed in this features malfunction.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7491952634","version":"5.3.0","date":"2021-06-22T04:40:41.000Z","authorName":"nayxwasxhere","rating":1,"title":"Doesn’t work","body":"Won’t let me select the make and model of my car in order for me to continue therefore I can’t use the Bluetooth.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7491240820","version":"5.3.0","date":"2021-06-21T23:36:41.000Z","authorName":"LaCross View stinks","rating":4,"title":"Good app but clearing alerts needs work","body":"Useful app and generally good except for notification of service issues. I had an Emission system alert that I had expeditiously corrected, alert was cleared in my Impala but the My Chevrolet app stubbornly resists showing things as normal. Very irritating…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7491185022","version":"5.3.0","date":"2021-06-21T23:11:21.000Z","authorName":"leebassett","rating":1,"title":"At one point, a good app. Now? Not so much.","body":"Won’t stay logged in. Will not work with my Apple Watch because it will not stay logged in.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7491005441","version":"5.3.0","date":"2021-06-21T21:49:43.000Z","authorName":"Magical74","rating":1,"title":"App will not open","body":"I used to love this app. But now it won’t open. Been trying to open the app for a couple hours now to no avail. Please fix.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7490863631","version":"5.3.0","date":"2021-06-21T20:48:57.000Z","authorName":"Diazca","rating":1,"title":"My Chevrolet App!","body":"The My Chevrolet App is not working! It just turns black when you click it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7490631556","version":"5.3.0","date":"2021-06-21T19:17:25.000Z","authorName":"Rad tech 823","rating":2,"title":"Door locks??","body":"I can still use the app to remotely start my car but the option to lock and unlock my doors no longer works???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7490488731","version":"5.3.0","date":"2021-06-21T18:23:59.000Z","authorName":"MHH1917","rating":4,"title":"Remote start not available","body":"I successfully used the remote start feature on June 18, 2021. Both yesterday & today (June 20 & 21, 2021) when I open the app remote start button shows “Off” and I am unable to use it. Very frustrating!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7489510424","version":"5.3.0","date":"2021-06-21T13:10:01.000Z","authorName":"DRussell123","rating":1,"title":"Update?","body":"App was working great for basic features such as locking and unlocking vehicle. Updated the app and the features do not work anymore","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7489471475","version":"5.3.0","date":"2021-06-21T12:57:27.000Z","authorName":"Becki79","rating":2,"title":"Would be nice","body":"I love the app when it actually works but since the app was upgraded as they say either unavailable to get in too app at all keeps loading or if it does load it doesn’t start my car or truck so far digging through my purse to get my actual keys worked better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7489267680","version":"5.3.0","date":"2021-06-21T11:50:10.000Z","authorName":"SGenaGutierrez","rating":4,"title":"Please fix","body":"I like it but for some reason it won’t load for me it just stays on the grey screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7489201125","version":"5.3.0","date":"2021-06-21T11:26:16.000Z","authorName":"Jewels1113","rating":1,"title":"Doesn’t Open","body":"App will not open at all even after being updated on my new iPhone 12 Pro. Very frustrating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7488857767","version":"5.3.0","date":"2021-06-21T09:05:44.000Z","authorName":"Wx Guy","rating":1,"title":"App will not load","body":"App does not get past the splash screen of the Chevrolet logo.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7488171104","version":"5.3.0","date":"2021-06-21T03:48:46.000Z","authorName":"JP Surf Dog","rating":2,"title":"Problems with the app not starting.","body":"App worked when my salesperson got everything set up at the dealership. And I used it for the day. Now three weeks after buying the truck it doesn't work. And Onstar trial period will be ending soon in a few weeks. Oh yeah. When you get free wifi in your trial period it's only 2gb of data. Well that only last a few hours in the drive home from picking up the truck. And it's on AT&T service too. Which it's really spotty service driving thru the Midwest.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7487860337","version":"5.3.0","date":"2021-06-21T01:29:42.000Z","authorName":"I LOVE TAYLOR S.","rating":1,"title":"This app gets worse and worse","body":"Paying $45/month to be iffy if I'm able to start my car with an extremely slow app. Now it literally isn’t letting me press the button.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7487798925","version":"5.3.0","date":"2021-06-21T01:02:05.000Z","authorName":"tweetyannbird","rating":1,"title":"Locate my vehicle","body":"This app isn’t working please work on this ASAP","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7487359576","version":"5.3.0","date":"2021-06-20T21:31:02.000Z","authorName":"TexasReader61","rating":5,"title":"No longer working","body":"I thought that it wasn’t working due to latest software update on my iPhone. \nso I gave one star. \nHowever, my complaint was responded to and turns out all I had to do was delete and re-download the app \nIt works now. \nI think. \nAt least I can access it. \nI’ll find out soon enough how well it works","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7487284003","version":"5.3.0","date":"2021-06-20T20:56:07.000Z","authorName":"jg0382","rating":3,"title":"REALLY tired of reloading app :/","body":"Getting really frustrated with this app. I loved it at first, but the last 3 weeks I have had to delete and reload the app for remote start to work for 2 days then stop. I would LOVE if you guys could fix this so I don’t have to constantly delete and reload just get my car cooled down before getting into it. C’mon guys, you can do it!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7487249503","version":"5.3.0","date":"2021-06-20T20:40:23.000Z","authorName":"Deepcobra17","rating":1,"title":"New update killed the app","body":"After the June 2021 update I can no longer start my truck. It just says “off” and won’t let me click it. Looking at other recent reviews, it looks like the new update screwed everyone over. No need for me to keep paying a monthly subscription for something that doesn’t work!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7487125375","version":"5.3.0","date":"2021-06-20T19:45:56.000Z","authorName":"AMG Mom","rating":3,"title":"Good app when it worked","body":"Great app when it works...which it did for a long time.  Two days ago when I tried to use the app to remote start my vehicle, it gave me system failure responses.  I called the OnStar tech who had me delete the app, she re-linked my service, but unfortunately I am now not given any of the options to start, lock, etc. my vehicle.  She said she would create a ticket, but there should be an easier option around this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7486307912","version":"5.3.0","date":"2021-06-20T14:55:42.000Z","authorName":"chevyeric","rating":1,"title":"Horrible user interface.","body":"Before the “user requested upgrades” the app was more functional. The app now forces you to enable phone level security access in order for the app to remain logged in with your id. I do not want my phone to be a PIA to open or unlock every time the screen times out. These “security” measures make this app completely even a bigger PIA to use. I almost wouldn’t mind just putting my password in the app every time but the app doesn’t even remember my ID so I have to put my ID and password in every time I want to use the app. Not to mention the 4 digit pass code to send the vehicle request from the app to the vehicle. As with every software update people cringe when they see they must update for fear of loosing features they like for mandates passed down by the tech giants. :(","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7485667811","version":"5.3.0","date":"2021-06-20T11:33:28.000Z","authorName":"lizanne6988","rating":1,"title":"App not opening","body":"I had to delete the app but when I tried to reinstall it it won’t open up.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7483782389","version":"5.3.0","date":"2021-06-19T22:47:49.000Z","authorName":"DarleenK8799","rating":1,"title":"When it works, it’s great","body":"I have been in a jam twice now and twice this app has failed me. I left my key fob in my car (on purpose) because I was just a few feet away. The doors locked so I thought “I have this app no big deal”. Nope. App failed to load. Today I was at a soccer game and told my daughter to text me when she got to the car and I’d use the app too open the doors. Nope again. App failed to load. I uninstalled it and reinstalled it and now it just keeps saying it’s unable to load my account details. I’ve used the app a few times without a problem. Most of the time I needed all 5 bars and/or wifi to use this app. It stinks and I’m frustrated and I can’t depend on it AT ALL.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7483544494","version":"5.3.0","date":"2021-06-19T20:56:53.000Z","authorName":"357 MAG","rating":3,"title":"Getting better","body":"Appears to be working better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7482380572","version":"5.3.0","date":"2021-06-19T14:05:50.000Z","authorName":"Jeepsandjets","rating":1,"title":"What crap","body":"Last up grade won’t work on my iPhone 6 thanks bunches. Not compatible with the older iso that my  phone uses. You Can’t tell me this app is so complicated and feature full that it can’t run like it use to on a older iso.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7480667034","version":"5.3.0","date":"2021-06-19T03:23:41.000Z","authorName":"mcazmi","rating":3,"title":"App keeps getting worse","body":"With the update I can no longer see my electric vehicle’s charge level.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7480078296","version":"5.3.0","date":"2021-06-18T23:20:14.000Z","authorName":"g all fds","rating":2,"title":"App update","body":"The new update made it worse. The old version was good and didn’t lag. I unlocked my doors at 10am. It’s 7:15 pm. It’s still says it’s unlocking. The old version may not have looked as nice but it worked better. If I get locked out of my car I don’t care how the app looks. I just want to get in. The new version may or may not work. It’s too temperamental.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7479922201","version":"5.3.0","date":"2021-06-18T22:07:31.000Z","authorName":"hehxjxjdjcjcuuc","rating":1,"title":"What Happened","body":"I enjoyed the old app. Now the app will not keep me signed on. I have Face ID enabled but still have to go through full log in every use. Plus it doesn’t ever open on the first try. I have deleted and reinstalled several times. I wish it would work as well as the last one.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7479750024","version":"5.3.0","date":"2021-06-18T20:49:55.000Z","authorName":"USMC7196","rating":1,"title":"My Chevrolet app is not working","body":"As of the last update when I open the app it says my vehicle is unlocked and the lock button is grayed out. Neither the lock or unlock button is functional.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7479167018","version":"5.3.0","date":"2021-06-18T16:59:26.000Z","authorName":"yajeohat","rating":1,"title":"MD","body":"The “My Chrevolet “ will not download onto my iPhone 6s. June 18, 2021","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7478617857","version":"5.3.0","date":"2021-06-18T14:07:53.000Z","authorName":"steve font","rating":1,"title":"Piece of GARBAGE","body":"Just goes to blank screen. What a waste of time. Don’t bother - this thing is pure trash. I would give it negative 5.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7478174219","version":"5.3.0","date":"2021-06-18T11:50:59.000Z","authorName":"Laine76","rating":3,"title":"It currently loading on iOS","body":"I’m having issues with getting the app to load on my new phone. I’m getting a blank screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7477605925","version":"5.3.0","date":"2021-06-18T08:07:03.000Z","authorName":"Scroopz","rating":1,"title":"App is pointless now.","body":"Would use the app to unlock my car doors. Due to me have children they would tend to close the doors with the keys inside and all I would have to do is unlock from my phone. The new update just made the app pointless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7477059100","version":"5.3.0","date":"2021-06-18T04:01:44.000Z","authorName":"KenDurham","rating":1,"title":"Spark EV","body":"Apparently Chevy has forgotten that the Spark EV is a thing and broke compatibility with it!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7476648946","version":"5.3.0","date":"2021-06-18T01:03:38.000Z","authorName":"Asady23","rating":1,"title":"Pretty Awful Update","body":"I’d rather have the old app. This one glitches more and doesn’t unlock or lock the vehicle. I’ve sat outside my truck for 30+ minutes a few times since the app waiting for it to unlock, can’t say it’s the service because it’s the actual functionality of the unlock and lock buttons on the app. Just bad","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7476384863","version":"5.3.0","date":"2021-06-17T23:01:30.000Z","authorName":"kjbilly","rating":3,"title":"Great Day to leave your belongings in the car","body":"Whenever I’m going to be around a lot of strangers, I like to leave my wallet and KEYS in the car. Sometimes the app works instantly but most times, it takes quite a while for commands to follow through","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7476382150","version":"5.3.0","date":"2021-06-17T23:00:15.000Z","authorName":"userstv8552","rating":1,"title":"Doesn’t work","body":"New app doesn’t start car. Freezes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7475958688","version":"5.3.0","date":"2021-06-17T20:01:04.000Z","authorName":"Debjean9598","rating":1,"title":"iWatch","body":"The app does NOT work on the iWatch. Which is very frustrating when you are locked out of home and car in 100°+ weather.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7475491968","version":"5.3.0","date":"2021-06-17T17:06:11.000Z","authorName":"delta13bravo","rating":4,"title":"So close to perfect!","body":"What a refresh! The new app is really sharp looking and a welcome facelift to the old, outdated app. The app is moving in the right direction. \n\n3 things I would add:\nI would love to see some options like closing the windows and sunroof. Perhaps the ability to adjust the climate controls. I would like to also see the option to turn off the pin requirements. \n\nThis would really round out the options and make this a world class app like other manufacturers offer!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7475266069","version":"5.3.0","date":"2021-06-17T15:49:52.000Z","authorName":"CorreAktor","rating":1,"title":"App Hangs every day","body":"Every day the app hangs with a black screen. It makes the Apple Watch part useless, as you have to re-login to the app on the phone after restarting the app. And when it crashes it won’t keep the login information so you have to re-login fully every day.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7474369173","version":"5.3.0","date":"2021-06-17T11:09:17.000Z","authorName":"nmsurfscreen","rating":1,"title":"Stopped working with update June 2021","body":"Can no longer start or lock/unlock traverse 2016","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7473369270","version":"5.3.0","date":"2021-06-17T03:58:07.000Z","authorName":"Bryeart","rating":1,"title":"Unlock suddenly greyed out","body":"I cannot choose unlock since last update… the button is greyed out and it says locked at all times… remote start and horn stuff still work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7473136696","version":"5.3.0","date":"2021-06-17T02:19:29.000Z","authorName":"Bass Playin' Trucker","rating":4,"title":"Lock/unlock buttons freeze","body":"Sometimes the lock & unlock buttons get frozen & I can’t use those functions after one use. I found that if I tap on my vehicle’s nickname, then tap my vehicle under the “My Vehicles” list, it fixes the problem & the buttons are returned to normal. The rest of the app works OK for me.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7472881355","version":"5.3.0","date":"2021-06-17T00:29:08.000Z","authorName":"dbriggerman","rating":1,"title":"App doesn’t work","body":"There was an update 3 days ago and the app still doesn’t work. It opens and then immediately goes to a grey screen and won’t change from there","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7472831924","version":"5.3.0","date":"2021-06-17T00:06:25.000Z","authorName":"Kayp1986","rating":1,"title":"Complete waste","body":"My app went completely black when I was trying to unlock my truck, after my son locked the keys inside. The one time I need the app to work the stupid thing goes dark. Unbelievable. They are trying to do so many fancy things they take away the main reason why people use it in the first place, the remote commands. Looks like it’s back to carrying a spare in my wallet.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7472823791","version":"5.3.0","date":"2021-06-17T00:02:40.000Z","authorName":"A_user269","rating":2,"title":"Won’t start the engine anymore","body":"Can no longer start the engine after an app update. The start button has Off on it. What happened?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7472390463","version":"5.3.0","date":"2021-06-16T20:42:11.000Z","authorName":"probablytaken","rating":1,"title":"Doesn’t work at all","body":"Everything used to run fine but now when I enter the app it shows the Chevy logo, fades to a grey screen, and does nothing else. Even worse apparently I won’t even be able to look at my points on the website anymore as they will become exclusive to this totally broken app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7472020192","version":"5.3.0","date":"2021-06-16T18:14:54.000Z","authorName":"BLhckyfn","rating":1,"title":"Doesn’t work well","body":"Worked for a few days, then it wouldn’t start my truck any longer.  Now the app won’t even open (the Chevrolet logo flashes on the screen and then it goes black).  Needs some work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7471869047","version":"5.3.0","date":"2021-06-16T17:19:17.000Z","authorName":"glockman03","rating":1,"title":"Used to be great and now…👎👎👎","body":"This app was working just fine (don’t fix it if it isn’t broken)…until the latest update.  Everything was seamless and easy to use or find.  Now I’m confused where anything is…using this app was fun and now it’s a challenge.  I definitely don’t like it….GREAT job whoever redesigned it.  \n👎🙄🙄🙄👎","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7470605820","version":"5.3.0","date":"2021-06-16T10:31:06.000Z","authorName":"Nataliep1003","rating":1,"title":"Bring the old app back","body":"There was nothing wrong with he old app where you tap to start. Holding the makes this app worse and I can see in the reviews that many agree.  Sometimes it’s a fight getting the start button to “send” and I wind up having to get close enough to use the fob. If it’s not broke, don’t fix it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7469953491","version":"5.3.0","date":"2021-06-16T05:51:22.000Z","authorName":"Bill Merchant","rating":2,"title":"Go back to the drawing board","body":"This “update” breaks everything and simply doesn’t work. Welcome to the opening grey screen which never changes. The previous version demands that you update, but the update, which doesn’t automatically happen as with other apps, DOES NOT WORK.\n\nUPDATE: The app now works. Lots of wasted space on the uninspired start screen, but maybe that’s a Chevy for you. It’s like a PC/Windows update.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7469647338","version":"5.3.0","date":"2021-06-16T03:32:44.000Z","authorName":"Aph0tic","rating":5,"title":"Says update required. Edit: issue resolved","body":"Even after installing the latest version. Never mind, it’s fixed now","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7469624324","version":"5.3.0","date":"2021-06-16T03:22:35.000Z","authorName":"mike 517","rating":5,"title":"Was good","body":"Since the update it’s not working\nGot a response and was told how to fix it working great now thank you","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7469482153","version":"5.3.0","date":"2021-06-16T02:21:22.000Z","authorName":"Tazzbjs","rating":5,"title":"App is not working","body":"Have had the app for over a year without issue until now. The app is saying update required or to reload the app. There is no update available and I have reloaded the app and we are getting the same error. This is happening on my phone and my wife’s.\n\nIssue has been resolved. We are happy with the app and it works as intended now.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7469469709","version":"5.3.0","date":"2021-06-16T02:16:02.000Z","authorName":"Ctaylor1976","rating":5,"title":"New update","body":"Great","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7468671063","version":"5.3.0","date":"2021-06-15T20:20:22.000Z","authorName":"mommawombat","rating":1,"title":"Failure","body":"One time I actually need in a Texas heat wave. I get a black screen","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7468048613","version":"5.3.0","date":"2021-06-15T16:32:31.000Z","authorName":"MizNessa","rating":1,"title":"It’s the worst app!","body":"This app NEVER works for me, it doesn’t even load!!! If I could give it negative stars I’d give it -5","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7467750307","version":"5.3.0","date":"2021-06-15T14:58:07.000Z","authorName":"Calcaver2","rating":1,"title":"Used to work, now all I see is a logo","body":"The app used to work, although slow at times to connect to the car.\n\nNow after a long time to start the app, I just see a Chevrolet logo.  No menus, options, or other info.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7467600247","version":"5.3.0","date":"2021-06-15T14:13:23.000Z","authorName":"CM Dux","rating":1,"title":"Fire The App developer immediately","body":"Who ever thought adding the feature that requires holding start, lock and unlock needs to be dismissed from the app development team immediately. I mean c’mon people that is the dumbest thing anyone could dream up. Even worse it made it to the last update. Take a lap developers. MAJOR FAIL. If someone would have brought that up in a meeting and said it was a good idea I would have laughed them outta that meeting. 1. Who wants to hold the function..... no one 2. Who wants to hold the function in the rain, walking to the vehicle, hands and arms full of stuff etc. NOT A SINGLE FRIGGIN PERSON ON PLANET EARTH I will say that the new screen is much nicer but the rest is garbage. PURE GARBAGE","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7467003180","version":"5.3.0","date":"2021-06-15T11:00:48.000Z","authorName":"Kronosis8321","rating":2,"title":"Requires more work","body":"Latest update does not allow for remote starting of my 2021 Silverado. Always shows truck is unlocked. Was fine last month, now useless when it’s 100+ in TX.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7466061624","version":"5.3.0","date":"2021-06-15T04:12:41.000Z","authorName":"shippertown","rating":2,"title":"Tire presser update","body":"After updating the latest update, I noticed the tire pressure readings were not inline with the actual car readings.   I’ve tried to delete the app and reinstalling with no luck on getting true readings.  Any suggestions?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7465791908","version":"5.3.0","date":"2021-06-15T02:14:52.000Z","authorName":"Da Mad Scrbbler","rating":1,"title":"What Happened","body":"The App used to be amazing now it doesn’t do anything and just hangs up. On the off chance it does open, the actions take FOREVER to run. Please bring back the old version!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7465179263","version":"5.3.0","date":"2021-06-14T21:39:19.000Z","authorName":"OldSoldier1","rating":4,"title":"Response slower than versions +","body":"Response to location requests have become significantly longer  than previous versions and the direction of travel indicator is noticeably missing as well.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7465105038","version":"5.3.0","date":"2021-06-14T21:06:37.000Z","authorName":"TEXZWILDMAN","rating":2,"title":"Keeps logging me out","body":"App was fine till last update. Keeps logging me out and my I watch keeps telling me to log back in I’ve deleted the app reinstalled it said it needed an update finally started working but it keeps logging me out on the phone and my watch. Please help","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7465101397","version":"5.3.0","date":"2021-06-14T21:04:58.000Z","authorName":"hfakhn","rating":1,"title":"Crashes","body":"This app doesn’t stay open long enough to even check the charge status. It crashes and shuts down immediately and all the time. Can’t use it for anything. This must be the worst app ever.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7465077310","version":"5.3.0","date":"2021-06-14T20:54:34.000Z","authorName":"Air 12345","rating":1,"title":"This app is still useless","body":"This app keeps gong downhill. Each upgrade is another disappointment. When I first bought my car in 2017 the app was not bad. It is now not even worth having on my phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7465068816","version":"5.3.0","date":"2021-06-14T20:50:48.000Z","authorName":"camero9700","rating":1,"title":"App use to work.  Not anymore","body":"Love the black screen with no log in.   Can’t do anything so app should be pulled off the market.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7464543723","version":"5.3.0","date":"2021-06-14T17:23:49.000Z","authorName":"ipatgo","rating":1,"title":"I want to love this app but…..","body":"I used to use this app a lot - Mostly to check on the diagnostics of my vehicle. I’d not want to know that my car is okay I want to see the diagnostics. I want to quickly see the mileage, the oil, the tire pressure. The new update is horrible. Oh yeah it looks cool. But finding things in it is a chore and clumsy. The locate vehicle option is slooooowwwww. Come on. Find someone who knows how to make an app useful.\nUpdate: the developer responded and obviously didn’t bother to actually read my review. 🤦‍♀️","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7464140734","version":"5.3.0","date":"2021-06-14T15:08:45.000Z","authorName":"randyin nc","rating":1,"title":"Chevrolet app update","body":"Cannot get nothing on the app. Will not come up","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7463975292","version":"5.3.0","date":"2021-06-14T14:17:36.000Z","authorName":"Pigprnn075","rating":1,"title":"Doesn’t work for nothing…","body":"App doesn’t update diagnostics, even when going into the app and manually refreshing. Constantly showing an error for something plugged into diagnostic port when there isn’t. Also cannot use the app on Apple Watch, keeps saying to log into the app on the phone, which I am already logged into. When I try to use the app on my watch, it logs me out of the app on my phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7463832026","version":"5.3.0","date":"2021-06-14T13:33:30.000Z","authorName":"Mollierobin","rating":1,"title":"My app will not open!!!!","body":"My app will not open, I only have a gray screen when I try to use the app since the last update how do I fix this, I used to love this app and now I cannot use it any longer!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462511564","version":"5.3.0","date":"2021-06-14T05:00:19.000Z","authorName":"Worldair","rating":1,"title":"My Chevrolet app version 5.3.0 fails to open with iOS 14.6","body":"My Chevrolet app version 5.3.0 fails to open on iPhone running iOS 14.6 (the latest version of iOS per 6/13/21).\n\nThe app in version 5.3.9 opens to a blank screen and goes no further.\nPerhaps there is an incompatibility issue with iOS 14.6, or the app has a serious problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462441662","version":"5.3.0","date":"2021-06-14T04:30:45.000Z","authorName":"talaub","rating":1,"title":"Nice update…not","body":"Now doesn’t work at all.  Hate the new look.  Seems slower.  After latest update the app doesn’t work at all.  Uninstalled / reinstalled.   Still can’t log in.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462105767","version":"5.3.0","date":"2021-06-14T02:13:54.000Z","authorName":"Satek06","rating":5,"title":"Overall good app","body":"Great app, like how I can start, lock and check status of my vehicle. Today I attempted to start my vehicle and upon opening the app I was instructed to log in again then met with an update required message. The app is up to date so I uninstalled and reinstalled and received the same message. Hopefully this gets fixed and I can use the app again.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462093013","version":"5.3.0","date":"2021-06-14T02:08:47.000Z","authorName":"Crash2293","rating":1,"title":"Help","body":"All I get is log off or retry, Deleted app several times and nothing. This goes for the GMC app as well. Is anyone else having the same problem? Forget about the so called help line.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462063289","version":"5.3.0","date":"2021-06-14T01:56:59.000Z","authorName":"Nunya123452","rating":1,"title":"Worked for a month","body":"Had the car a month an now the app is saying I need to upgrade it. Deleted an reloaded app same error message. Now, it’s saying to contact support. Back to the book Manuel","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462046381","version":"5.3.0","date":"2021-06-14T01:50:06.000Z","authorName":"Foxxy's","rating":1,"title":"New app is not opening","body":"New app is not working!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462031191","version":"5.3.0","date":"2021-06-14T01:44:04.000Z","authorName":"Feety1960","rating":2,"title":"Can’t sign in after updating","body":"I opened my doors using app. After that got message that I need to update app or change password. So I end up doing both. Now I cannot access app.  First time in 3 years I had trouble. Don’t know how to fix and leaving on a trip soon.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462027733","version":"5.3.0","date":"2021-06-14T01:42:40.000Z","authorName":"GorditaPR","rating":1,"title":"Does not work after update","body":"I’ve been using this app without any problems until your latest update. Will not let me log in, I followed the instructions of deleting and reinstalling the app, even changed my password, deleting again and reinstalling and completely shut down my phone before trying to sign in and all I keep getting is that the app needs updating. I tried customer support and couldn’t get any where close to finding where to contact anyone. Why would you make it basically impossible to find help for the app in customer support? Here I am leaving this review in hopes to get someone to contact me and help me.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462021988","version":"5.3.0","date":"2021-06-14T01:40:21.000Z","authorName":"gd_nc","rating":1,"title":"Suddenly stopped working","body":"This app worked great on my iPhone for the first couple of months then it completely quit and gives me an error saying the “version is out of date” or “can’t receive account details” every time I try to use it.  I’ve reinstalled it a couple of times nothing seems to help.  I’m using an iPhone 12 Pro on the latest version of iOS.  I’m at a loss.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7462001338","version":"5.3.0","date":"2021-06-14T01:32:04.000Z","authorName":"lilyankeefan","rating":1,"title":"Not working!!!!","body":"Hasn’t been working for few months now!!! Every time I open app just goes to a blank screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461991924","version":"5.3.0","date":"2021-06-14T01:28:14.000Z","authorName":"MrCarlos","rating":1,"title":"Use to be a good app","body":"Having so many problems with this app. It use to work very well. Now it kept telling me I was not on the internet when I was. I logged off to retry and now I am not able to login. I enter my credentials and it continues to say to be sure I have the latest update. There are no options to update the app on the app store. Also says to contact help for the app. There is no clear way to do that either. Extremely frustrating. The app had always worked well to check the diagnostics in my vehicle but not it is not working at all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461991800","version":"5.3.0","date":"2021-06-14T01:28:11.000Z","authorName":"JM198341","rating":1,"title":"Location","body":"Having issues with the app, it glitches way too much. Will not allow me to log in tried refreshing the app, deleting and downloading it again. Says that an error occurred and to check for an app update when I already have the most updated version.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461991171","version":"5.3.0","date":"2021-06-14T01:27:55.000Z","authorName":"Midnight_Rider","rating":3,"title":"Updated & half broken!","body":"Wow we updated to a pretty app but most is now BROKEN! Now you have to hold buttons instead of just touching! Turn on face recognition just to have it NOT work the next time! Watch app no longer works! I mean what good is it when you have to log into your phone just so it works?!?!? May as well use phone in the first place. Vehicle status doesn’t work most of the time. One subscreen comes up blank every time. Not even sure what is suppose to do. Revert back to old app until this one is ready PLEASE!\n\nUPDATE!  Sun Jun 13th and NOW it won’t even work!  Nice update today!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461981909","version":"5.3.0","date":"2021-06-14T01:24:07.000Z","authorName":"Wolfgang Von Colt","rating":1,"title":"Unable to login","body":"Recent update will not allow login… says app update required, even though it was just updated.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461976924","version":"5.3.0","date":"2021-06-14T01:22:07.000Z","authorName":"FightingIrishEngineer","rating":1,"title":"New version doesn’t work","body":"After the latest update, upon entering my credentials I’m told to upgrade to the latest version or uninstall / reinstall.  I’ve tried the latter but to no avail.  It also tells me to contact “Help” but that doesn’t seem to be an option anywhere.  Is leaving a review considered “Help?”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461972820","version":"5.3.0","date":"2021-06-14T01:20:26.000Z","authorName":"chornsby11","rating":1,"title":"Update doesn't work","body":"Ever since the recent app update, I am unable to login. It keeps telling me to make sure my app version is up to date or reinstalling the app may help. I’ve deleted and reinstalled the app and still getting the same error message. \nI’ve been using this app for years and have never had this issue.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461971829","version":"5.3.0","date":"2021-06-14T01:20:01.000Z","authorName":"Hilltop1976","rating":1,"title":"Poor","body":"Keep crashing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461969023","version":"5.3.0","date":"2021-06-14T01:18:53.000Z","authorName":"Icebreaker9","rating":1,"title":"Crashing","body":"Newest update is not allowing access pass login. I use this app a lot so please fix ASAP.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461960241","version":"5.3.0","date":"2021-06-14T01:15:19.000Z","authorName":"Jason_Ky","rating":1,"title":"Straight trash","body":"Can no longer sign in. Keeps saying update app. But the app is already updated. No longer useable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461957699","version":"5.3.0","date":"2021-06-14T01:14:12.000Z","authorName":"juliecraftsvt","rating":1,"title":"Recent update and now I can’t get in","body":"This is a paid app, and not a cheap paid app. When it works it works great, but there was a recent update and now I can’t get into my account. I’ve tried turning my phone off and on again, I’ve tried deleting the app and reinstalling. Nothing is working. Very frustrated.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461955312","version":"5.3.0","date":"2021-06-14T01:13:12.000Z","authorName":"Johnw_69","rating":5,"title":"Great when it works… But when it doesn’t OH BOY!!!","body":"I needed my glasses from the truck, went to retrieve them opened the app and it wouldn’t let me sign in (the password is stored in my facial recognition) after several attempts was instructed to uninstall and reinstall the app because of needed update, what a wast of time, would have been easier to just unlock it with the key… and the app still is not working after all of that 🤬","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461948156","version":"5.3.0","date":"2021-06-14T01:10:24.000Z","authorName":"iridelow1998","rating":1,"title":"No longer works since update","body":"App doesn’t work on iOS since latest update.  App will open but won’t log in.  Using on 12 pro max.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461947063","version":"5.3.0","date":"2021-06-14T01:09:55.000Z","authorName":"vipersniper82","rating":1,"title":"App doesn’t work after “update”","body":"The app worked great u til the recent updates. As of now the app is updated and will not even allow me to log in. It keeps saying update after I updated it lol.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461931957","version":"5.3.0","date":"2021-06-14T01:03:41.000Z","authorName":"pstuckel","rating":1,"title":"Since the new update","body":"Since the last update I can’t get into my account. It keeps telling me to update it or take it off and re download it and I have done it twice.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461922993","version":"5.3.0","date":"2021-06-14T01:00:00.000Z","authorName":"Vex Xiang","rating":1,"title":"Piece of garbage","body":"Not functional, barely useful, the latest update was a joke. Uninstalled. It’s laughable that they want people to pay for stuff like this. Make an app worth a dime and then we will talk. Otherwise why bother. Hire someone from Tesla to teach you how car apps are supposed to work, or just stop trying.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461906750","version":"5.3.0","date":"2021-06-14T00:53:11.000Z","authorName":"Slim stevo","rating":5,"title":"App not working","body":"I keep getting a message saying the app needs an update, but the app says its up to date.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461902598","version":"5.3.0","date":"2021-06-14T00:51:26.000Z","authorName":"🐕🐾🦔🐾🦦","rating":1,"title":"Too many features no longer work","body":"“Vehicle Status” hasn’t updated in six days. Also, I am no longer able to book service appointments with my dealership through the app. Another issue: My car was serviced for a recall, but the app still shows that the recall hasn’t been taken care of. The older version of the My Chevrolet app worked for me. The current app does not work very well.\n\nUpdate:\n\nNow, I am unable to sign in. The app tells me to update, but no update is available. I’ve reinstalled the app twice. Nothing. \n\niPhone 11","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461887800","version":"5.3.0","date":"2021-06-14T00:45:18.000Z","authorName":"I_M_Drum_Legend","rating":1,"title":"Cool Concept….. If it worked","body":"App hardly ever works. Was considering subscribing for the premium OnStar, but not unless GM fixes their app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461886355","version":"5.3.0","date":"2021-06-14T00:44:41.000Z","authorName":"Lo11ygagger","rating":2,"title":"Stopped working","body":"App worked great for a couple months. For whatever reason the app now will not allow me to log in. Says that I need to update or remove app and reinstall. Have tried 5 times. Then tried to reset my password….nothing. \nGoing to have to call onstar tomorrow and find out what is wrong but the fact that I get charged every month for the service and don’t get to use it when I need it is not exactly leaving me satisfied.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461883603","version":"5.3.0","date":"2021-06-14T00:43:28.000Z","authorName":"SSGUNNER2020","rating":1,"title":"Don’t work","body":"Latest update installed and says I need to install or delete.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461861513","version":"5.3.0","date":"2021-06-14T00:34:03.000Z","authorName":"Pretty-Bowleggs","rating":1,"title":"Update","body":"The app was pretty good prior to the new update. Now it keeps saying I need to update but there aren’t anymore updates needed on the app I uninstalled and it reinstalled it and I’m still not able to login now and keep getting the same message about updating the app‼️ smh","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461857112","version":"5.3.0","date":"2021-06-14T00:32:07.000Z","authorName":"Cheeesseee","rating":1,"title":"Update required but no update available","body":"App says need to update or reinstall.  No update available so I reinstalled and get the same error.  Also haven’t successfully been able to start my new car with the “new” app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461851138","version":"5.3.0","date":"2021-06-14T00:29:39.000Z","authorName":"weathernow45","rating":1,"title":"Cannot login","body":"I can no longer access my Chevy app. After the update. I try to log in and I get the message. Try updating your app first. Please fix this!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461847009","version":"5.3.0","date":"2021-06-14T00:27:55.000Z","authorName":"KrissyRoss","rating":1,"title":"No Update Available","body":"Every time I log in, it keeps saying “update required” so I keep deleting and reinstalling and it still says “update required”. This needed fixed ASAP.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461840346","version":"5.3.0","date":"2021-06-14T00:24:57.000Z","authorName":"Joenova67","rating":5,"title":"My Chevy App","body":"Now I can’t sign in because you says update I did it and it still won’t do it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461823188","version":"5.3.0","date":"2021-06-14T00:17:35.000Z","authorName":"Qvita","rating":1,"title":"Updated App and can’t sign in","body":"I’ve tried deleting the app and reinstalling and still can’t log into it. Very frustrating. It worked perfectly before the update now it’s useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461810477","version":"5.3.0","date":"2021-06-14T00:12:06.000Z","authorName":"HansPeter91","rating":1,"title":"App stopped working","body":"App stopped working. Even though I am on latest version, it says update is needed and then crashes. Deleted app and reinstalled it but no luck. It was nice when it worked.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461794101","version":"5.3.0","date":"2021-06-14T00:04:57.000Z","authorName":"Jlorasch385","rating":3,"title":"Can’t sign in after update","body":"Just tried to use the app and said update needed so I checked and it did need an update. So after update I tried to use the app and said the same thing, “ must update date to use app” I even deleted the app and data with it. Same thing. I used to use the app to start my car so it can cool the inside of the car. Please fix this, very frustrating when trying to use the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461789511","version":"5.3.0","date":"2021-06-14T00:02:56.000Z","authorName":"daniiiiiielle04","rating":1,"title":"app never works","body":"this app never works or loads","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461785182","version":"5.3.0","date":"2021-06-14T00:00:59.000Z","authorName":"Adam 1638101","rating":1,"title":"Unreliable","body":"Seems like half the time I attempt to remote start it fails and it mentions the servers are down. As of now the app won’t even let me log in, saying update required. I have updated and reinstalled already. I don’t see the point in paying a monthly subscription for a service when I cannot even count on it to work consistently.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461774168","version":"5.3.0","date":"2021-06-13T23:55:59.000Z","authorName":"sureihaveallday","rating":1,"title":"Worst app in the history of the world","body":"Well once again it doesn’t work. Told me to update or reinstall. I did. Doesn’t work, tells me to update or reinstall. I rebooted the iPhone. No help. I pray the cars are better than the apps.\nPaying for stuff I can’t use.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461768410","version":"5.3.0","date":"2021-06-13T23:53:30.000Z","authorName":"daisybelle52","rating":1,"title":"My app is a blank black screen. What happened??","body":"M when I try to open my app, it’s just a bank black screen. I’ve updated it and still nothing. Help!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461763054","version":"5.3.0","date":"2021-06-13T23:51:07.000Z","authorName":"Jim46788544456","rating":1,"title":"\"Update Required\"","body":"...endless loop. The latest version is installed and it will not log in.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461758501","version":"5.3.0","date":"2021-06-13T23:48:59.000Z","authorName":"amanda_dfit","rating":1,"title":"App isn’t working","body":"The latest update to the app worked for about 3 days for me and now I’m kicked out. I’ve uninstalled and reinstalled and trying to find the right contact info for help is not easy","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461709640","version":"5.3.0","date":"2021-06-13T23:26:32.000Z","authorName":"Navydavy1","rating":1,"title":"Always Issues -weak customer service","body":"I think I’m on the 3rd version since I started paying for the service.  For a long time the location features didn’t work, customer service hours are ridiculously short, and wait times ridiculously long.  Newest version has location, though it isn’t easy to find - not a very intuitive app, but now it says service is temporarily down.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461597638","version":"5.3.0","date":"2021-06-13T22:34:43.000Z","authorName":"Chacharooni","rating":1,"title":"App down when I needed it most","body":"Keys were locked in the trunk and I’m 70 miles from home.  Tried to use the app to unlock my door and all I got was a blank screen after the Chevy logo.  Made sure both my phone and app were updated to the latest version, tried again and got the same thing.  Had to call AAA for an issue that should’ve been easily solved using the app.  Thanks.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7461308404","version":"5.3.0","date":"2021-06-13T20:24:34.000Z","authorName":"Bajaflyer","rating":1,"title":"Black blank screen","body":"Nice. At least it doesnt encourage me to see if it works and waste more time.  Hasnt worked for over a year. The black screen is a recent feature. Not exactly an upgrade.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7460809974","version":"5.3.0","date":"2021-06-13T17:11:12.000Z","authorName":"rgframe","rating":1,"title":"Horrible update part 2","body":"I recently reviewed this app, I had loved the previous version, but the new updated version is terrible. The company replied to my bad review advising me to delete the app and then reinstall it. I have now done that four times. The app now allows fingerprint recognition, but I still can’t use it to start, lock or unlock the car. It tells you to hold the button, but nothing happens. I’ve held those buttons for a long time and nothing!! Bring back the old version!! 👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7460559445","version":"5.3.0","date":"2021-06-13T15:47:35.000Z","authorName":"Coverdog","rating":1,"title":"Crashed at opening it up","body":"Well it used to work fine until I updated it today. Now the emblem comes up and then just a black screen, nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7460320316","version":"5.3.0","date":"2021-06-13T14:35:53.000Z","authorName":"MsLCC","rating":1,"title":"Disappointing","body":"This used to be really helpful when it tied better to OnStar and gave info about your vehicle.  Now it’s a sales gimmick","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7460068686","version":"5.3.0","date":"2021-06-13T13:23:14.000Z","authorName":"Noximoro","rating":2,"title":"Inconsistent, frequently unable to connect with Bolt","body":"When this updated app works it provides us with lots of useful information. However, recently on a semi regular basis, it logs us out and we have to sign back in with our email and password. \nAnd on a much more regular basis since the big update, it reports that it is unable to connect to our 2017 Chevrolet Bolt EV and says to contact On Star support for assistance. When that happens, we get no current information regarding the status of the car. This is very frustrating, especially when we are using the app to monitor the charging status of the Bolt.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7460040806","version":"5.3.0","date":"2021-06-13T13:15:01.000Z","authorName":"Bowlerboii","rating":5,"title":"Love this app!","body":"It’s so convenient to start and unlock my car from my phone or watch. I like the new user interface too, it’s easier to use and the start button is much bigger and centered. I wish we didn’t have to hold the buttons to activate them though, I miss just tapping the start button. I hope Chevy adds widgets soon so that you can see your cars gas range, oil life, and the start/unlock features from the iPhone Home Screen though!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7459884940","version":"5.3.0","date":"2021-06-13T12:27:06.000Z","authorName":"cr4nk13stN0t3","rating":1,"title":"No longer works","body":"Doesn’t load. I just get a black screen. I am tired of companies releasing untested crap expecting the end user to test it for them. I don’t need to sit through long phone calls or participate in never ending email exchanges. Get your act together and test your app.  Ok, uninstalled and installed fixed the issue.  Why was there no compatibility testing?  Why wasn’t there an email sent to users to warn them?  Just lazy…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7457904499","version":"5.3.0","date":"2021-06-12T23:37:31.000Z","authorName":"Rowdy5118","rating":1,"title":"App doesn’t work...3rd time submitting review.","body":"Have uninstalled, reinstalled, and done it over and over again. The app black screens from the time you open it until you get tired of waiting and close it. \n\nI locked my keys in the truck on a kayaking trip, to unlock with the app when I returned. App didn’t work and left me stranded for 4 hours until someone could bring me my spare keys. \n\nThere was an update today, I got excited! Still don’t work!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7457603617","version":"5.3.0","date":"2021-06-12T21:18:19.000Z","authorName":"brciwi","rating":1,"title":"Updated it and now it doesn’t work","body":"Updated app last week and now it opens to a blank black screen no options for login or fob or anything.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7457524494","version":"5.3.0","date":"2021-06-12T20:43:09.000Z","authorName":"eagle5757","rating":1,"title":"Not working","body":"I up dated the app and now I get only a black screen","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7457286712","version":"5.3.0","date":"2021-06-12T19:03:57.000Z","authorName":"BrianInHouston","rating":2,"title":"New update is way too buggy","body":"I want to love this app and I use it several days every week. The fact is that it has several issues. The keep me signed in option does not work, I am constantly logged out on my Apple Watch and then check the iPhone app to find that it’s logged me out again. I deleted and downloaded the app again hoping that would fix the issue but it persists today. The app always forgets my PIN number and then I have to add it and reenable FaceID every day. Very disappointed but when you fix I’ll be happy to update my rating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7457181975","version":"5.3.0","date":"2021-06-12T18:22:34.000Z","authorName":"yudong009","rating":1,"title":"Exits on opening","body":"At the page about push notification, I click OK which is the only button, then the app exits. After that it just immediately exits when I tap the app icon to open it. Please fix","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7456962043","version":"5.3.0","date":"2021-06-12T17:01:46.000Z","authorName":"cesssssaaaaar","rating":5,"title":"Not to great","body":"Not liking this version , it doesn’t seem to work for me not sure why. \nAll I’m trying to do is locate my vehicle but it’s giving me an error message. I’ve tried contacting onstar and even they aren’t helping.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7456624570","version":"5.3.0","date":"2021-06-12T15:13:30.000Z","authorName":"rec2772","rating":4,"title":"Okay app.","body":"Okay app. Just wish the app would give me the ability to start my car up from the app. I have a 2021 Chevrolet Equinox that didn’t come with the remote starter the dealership had the factory starter put in two days later. But for some reason I still can’t start it from the remote. Is this even possible?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7454578873","version":"5.3.0","date":"2021-06-12T03:12:17.000Z","authorName":"Resacups0508","rating":3,"title":"iPhone 12 Pro Max not supported","body":"I loved the app on my iPhone 11. Upgraded my phone and now when I open the app it’s just a straight black screen! When will you update for iPhone 12?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7454171537","version":"5.3.0","date":"2021-06-12T00:35:08.000Z","authorName":"virginia prrez","rating":1,"title":"0 rated","body":"My app isn’t working and I don’t know who to report it to.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7453839592","version":"5.3.0","date":"2021-06-11T22:11:18.000Z","authorName":"I<3chapstick","rating":1,"title":"Gray screen","body":"Every time I try to go into the app, I get a blank screen. Please fix this so I can actually use the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7453608802","version":"5.3.0","date":"2021-06-11T20:31:35.000Z","authorName":"Shannon222","rating":1,"title":"Blank Screen","body":"For the last 2 weeks the app has not been working properly on my iPhone 11. Up until now it was fine. A tad buggy after the redesign and now nothing. Okay if it’s free, but this service is not free and it’s not working. I can figure out any other place to let someone know. At this point we’d need to cancel the service since we can’t use it. We have 3 vehicles with 3 of us using the app for various functions. Ugh. Very frustrating when it doesn’t work and there’s no help. Not working on my husbands iPhone either. I don’t know what happened. Was hoping it would update and work again. I’m all up to date and all that too. The app loads starting with the Chevy logo and then goes to a backlit screen and never recovers from there.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7453085343","version":"5.3.0","date":"2021-06-11T17:10:56.000Z","authorName":"Andrew___20","rating":3,"title":"🙎🏽‍♂️","body":"I have both the app installed in my phone and Apple Watch. The only issue I have is that in my watch it tells me to login on the phone to be able to access the controls on my watch. I have the Face ID on the app and to stay logged in but even with that, I have to constantly login on my phone in order to use my watch. This needs to get fixed as it defeats the whole purpose of using it on the watch","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7452785785","version":"5.3.0","date":"2021-06-11T15:32:50.000Z","authorName":"marc's bolt","rating":1,"title":"Keeps disconnecting","body":"The app continuously loses contact with my bolt.  iPhone 6s. It wants me to go turn on the car and reconnect.  Once I’m in the car I don’t need the app.  It rarely connects  when I’m not at home.  I’ve tried using key pass, it keeps dropping that also and you have to go inside the car to reconnect  key pass.\n\nIf there is some way to keep the app connected to my car, haven’t figured that out yet!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7452379548","version":"5.3.0","date":"2021-06-11T13:34:22.000Z","authorName":"2020 retired gm employee","rating":1,"title":"🤷🏼‍♂️","body":"All I get is a gray colored screen. This is after the update. Before that it wouldn’t even open.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7452162744","version":"5.3.0","date":"2021-06-11T12:28:12.000Z","authorName":"Nelsonmnh","rating":4,"title":"Hold...keep holding...hold much better now.","body":"Good lord. The redesign is very nice looking. But the functionality is the worst. The old design you tapped on the function, confirmed and the signal was sent. Now you have to hold the function (say the start button) until the signal is sent. You do not have to hold the start function as long. Standing next to the car I had to hold the start button for what seemed 10 seconds. This defeats the purpose. iPhone 12 Pro.\nUpdate: the most recent update has greatly improved the response time and lag that was obvious in the first release of the redesign.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7451312223","version":"5.3.0","date":"2021-06-11T06:50:44.000Z","authorName":"JosephRoberto","rating":3,"title":"Great for basic tasks, still has a lot of work","body":"The most recent UI update is great and has really  brought it into modern design. That diagnostic features a cool. And haptic feedback and animations are intentional and intuitive. The additions of the following would make it flawless!!! A graphic of your car on the dashboard. Faster startup and authentication with biometrics. Display the current status: whether it’s currently locked or unlocked, what is on and what is off, if it’s currently in motion or not, doors and windows open or closed, which seats are buckled, has the car alarm been triggered. Car alarm notifications. Ability to see and change current climate settings if remote started: temp, fan speed, heated seats, heated steering wheel, A/C, heat, direction of air, defrosters, wipers. What is there is well refined, useful, and reliable. But the potential this app has can set this app apart from the rest if further developed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7450103930","version":"5.3.0","date":"2021-06-10T21:53:47.000Z","authorName":"Lawfully Yours","rating":1,"title":"Not working","body":"My app worked wonderful 6 months ago. \n\nNow it won’t even open. There’s no new updates and I’d like to access info for diagnostic information and update subscription.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7449807029","version":"5.3.0","date":"2021-06-10T19:43:58.000Z","authorName":"*Big_D124*","rating":2,"title":"New update","body":"The app worked great and it’s very convenient.  I never had problems with the app until recently after The newest update. Sometimes When I open the app it acts like it’s froze up and I have to sign out and sign back in to get it to work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7449667952","version":"5.3.0","date":"2021-06-10T18:47:41.000Z","authorName":"Jimmie8888","rating":1,"title":"Good for a few years then trash","body":"Don’t purchase a GM vehicle thinking this app will work forever! Onstar quickly shuts that down and wants you to pay $15 a month to keep it… an app. Ford has an app that does the same thing except they don’t take features like that away like remote start.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7448940201","version":"5.3.0","date":"2021-06-10T14:39:42.000Z","authorName":"TenderRatGooch","rating":5,"title":"Helpful customer support","body":"Works as it should, customer support reached out within a day and got me back in action","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7446960099","version":"5.3.0","date":"2021-06-10T02:28:03.000Z","authorName":"prague--","rating":1,"title":"Not able to use the app at all!","body":"I am really having a hard time using this app. When I logged in with my account, the app asked me if I want to enable FaceID, I tried to click both yes and no. Then another page pops up. (Offers, Promotions, and Service Visit Notifications.) It asked me if I want to turn the notification up, do I allow the app to use my location and my permission to track my activities. No matter what my answers are, the app will crash and shut down. I also tried to uninstall then redownload the app, but it never worked. Someone please help me with this. I got my car for a while but have never used this app. It worked great when I had my C7 grand sport.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7446545968","version":"5.3.0","date":"2021-06-09T23:36:39.000Z","authorName":"Like_island","rating":1,"title":"Super Annoying App","body":"It’s slow and takes too long to start up, then when it does it logs you out half the time. When you finally get in, the new “tap and hold” functionality only works 1 out of every 3 attempts. The app has never been very good or fast, the new version may look a little more modern, but it’s a step backward in usability, which is really saying a lot considering it wasn’t great before. The only reason it even gets 1 star is because eventually it does lock/unlock/start my car, it just takes way too long and is a pain to get there. I would be embarrassed if this app were a representative of my company.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7446390489","version":"5.3.0","date":"2021-06-09T22:26:39.000Z","authorName":"JDS210.1985","rating":2,"title":"Needs new developers","body":"This app constantly freezes. Constantly makes you sign in again. I like the new upgrade they did to navigate through the app but that’s only helpful when you finally are able to get in the app. Also the app signs you out of the Apple Watch all the time which ruins such a great feature. The only reason I’m giving this rating 2 stars instead of 1 star is because the app is very user friendly when it actually works and lets you login. Awesome features but a very poor engine that runs this app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7446051366","version":"5.3.0","date":"2021-06-09T19:58:18.000Z","authorName":"Mamaluandbill","rating":1,"title":"Black screen","body":"Why does the screen on my phone just go black.  I always was able\nTo use the app and for the last few weeks nothing happens but the black window.  Frustrating!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7445843073","version":"5.3.0","date":"2021-06-09T18:38:09.000Z","authorName":"DoorNumber2","rating":1,"title":"Doesn’t do much now without paid plan","body":"Most functionality now appears to be only available with a $15/mo “remote access” plan from OnStar.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7445809102","version":"5.3.0","date":"2021-06-09T18:25:20.000Z","authorName":"Blenderbomb","rating":1,"title":"Broken","body":"App is broken. Opens to blank screen","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7445225784","version":"5.3.0","date":"2021-06-09T15:08:11.000Z","authorName":"EVanderhollyfield","rating":1,"title":"Disappointed","body":"Since the “new” version the app crashes, crashes, crashes. V5.3.0 still crashes. I’ve spent weeks chatting, emailing, even sending video, on the phone, on the blue button talking with advisors and. App still crashes, won’t update vehicle status before crashing. BTW, deleting and reinstalling doesn’t work. I’ve lost track of how many times I’ve done that. In fact advisors have stopped calling me back. Guess they’ve given up? Should I?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7444568996","version":"5.3.0","date":"2021-06-09T11:49:26.000Z","authorName":"td1227","rating":2,"title":"Frustrating","body":"The “energy” part of the app continually freezes and I am not able to use it, which is an issue because I have an electric car.  Uninstalling and reinstalling the app sometimes helps, but only for a short time.  Please fix this issue!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7444493305","version":"5.3.0","date":"2021-06-09T11:23:56.000Z","authorName":"Srq92","rating":2,"title":"Was great when it worked","body":"This app was great when it worked. For the last month or so it won’t even open for me. Just displays a blank gray screen with no options.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7442740314","version":"5.3.0","date":"2021-06-08T23:17:57.000Z","authorName":"jrczx6r","rating":1,"title":"What app?","body":"This app doesn’t work!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7442456808","version":"5.3.0","date":"2021-06-08T21:12:50.000Z","authorName":"gnickle11","rating":1,"title":"App hardly ever works.","body":"It’s kinda disappointing because the app is handy at times.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7442395336","version":"5.3.0","date":"2021-06-08T20:46:44.000Z","authorName":"Danawitha17 silverado","rating":1,"title":"Remote app","body":"Not very satisfied with the update I cannot even get it to open on my phone screen and half the time my vehicle will not start","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7440919664","version":"5.3.0","date":"2021-06-08T12:44:15.000Z","authorName":"vix-16","rating":1,"title":"Older version better","body":"I wish I never updated this app. Have to constantly log in. The old app gave more info.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7440897629","version":"5.3.0","date":"2021-06-08T12:37:39.000Z","authorName":"jw1076","rating":4,"title":"Helps you when you need it","body":"App has been great had for years now but the latest update it won’t open any more please help this is a great app ( iPhone user on 14.0 )","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7439914523","version":"5.3.0","date":"2021-06-08T06:21:52.000Z","authorName":"Didder03","rating":4,"title":"Needs fixing","body":"The app works ok as far as I can tell. I’ve only explored through the app just to see what it has and to see how things work through the app. Except I have one main issue which is the reason I rated this app ⭐️⭐️⭐️⭐️. I tried using the vehicle Locate, but for some reason it doesn’t work correctly even if I’m in my vehicle at the time. So I deleted the app twice and it still doesn’t give me the correct place my vehicle is at. I’ve tried it with my vehicle on and with it off. After I go into vehicle locate it shows a little map area that your vehicle is in which that part is showing it correctly, but it doesn’t give you the precise location to where your vehicle is at. It just gives me the area closely around my address, but when you hit the find vehicle it says that my vehicle is in a town not even near me. Like right now it is showing that my vehicle is in Blanco, TX which is actually 1hr 15min away. My vehicle is in my driveway no where near Blanco. Last time it showed that it was even further away out even more hours away. So I called customer service and they told me to try deleting the app and re down loading it and if that didn’t work to call Onstar.  So I deleted it twice and it didn’t work. Then after that didn’t work I called Onstar and told them the issue I was having with the Chevrolet App and what the customer service told me. They checked out my vehicle location from their computer and it showed them where my vehicle was located and it was at the correct address. They also saw that I have the Onstar Guardian app and the location to my vehicle was also at the correct address. They said that I would need to contact Chevrolet customer service and let them know that the issue is coming from their end and that they would need to fix it. So how can this be fixed, cause I’m pretty sure that I can’t be the only one with this issue? If this can be fix then I’ll change it to ⭐️⭐️⭐️⭐️⭐️","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7439210304","version":"5.3.0","date":"2021-06-08T01:30:30.000Z","authorName":"Wanrulz","rating":2,"title":"Not working","body":"This app hasn’t worked in over a week. I enter the app and the screen stays grey. Just updated and it didn’t help","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7438751539","version":"5.3.0","date":"2021-06-07T22:10:18.000Z","authorName":"Sliverslinger2","rating":4,"title":"2017 Silverado","body":"I like the app it has a load of information and you can access the owners manual.\nI updated the app and now it won’t open , all I get is a blank screen. ?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7438551629","version":"5.3.0","date":"2021-06-07T20:43:54.000Z","authorName":"rsmithwyo","rating":3,"title":"Still has location issue","body":"The overall app is good, but since the overhaul the Location feature in \"set up alerts\" does not function properly.  The app will not allow you to delete locations or turn on/off alerts for specific locations as it did in the past","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7435711597","version":"5.2.0","date":"2021-06-07T03:44:16.000Z","authorName":"Julannehinojosa10","rating":1,"title":"Can’t access app","body":"It’s been months that I can’t open the app or use the features. Please fix please.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7435417738","version":"5.2.0","date":"2021-06-07T01:42:17.000Z","authorName":"user157844","rating":1,"title":"Apple Watch will not work","body":"I can’t get the Apple Watch to send commands to my car, forces my to log out and log back in on the phone just to get the app to work right again. I’ve tried to uninstall everything and it still won’t work right. Also the press and hold to make anything work with the commands in the app is dumb, I like the instant touch, don’t care for the press and hold garbage, I hate this update and probably will cancel my subscription because the app is clunky and buggy","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7435256936","version":"5.2.0","date":"2021-06-07T00:33:52.000Z","authorName":"TML1017","rating":1,"title":"Worthless","body":"App works 1 out of every 50 times I try to use it.  Always get an error message can’t connect to server and I need to try later.  What good is that ?? Brand new 21 Chevy truck and paid for on star for this feature.  I’ll be cancelling","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7435199862","version":"5.2.0","date":"2021-06-07T00:08:13.000Z","authorName":"Debug37617","rating":1,"title":"Not Working on iPhone 11","body":"Just shows a black screen after logo and phone gets hot.   Please Fix.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7434703007","version":"5.2.0","date":"2021-06-06T20:23:25.000Z","authorName":"Cmclimer","rating":1,"title":"Won’t allow me to login or set up pin code","body":"Says pin code I’m trying to use isn’t valid even though it is and then locks me out for 10 minutes because of too many invalid attempts. This app is glitchy and terrible. Might as well just use the key fob as it’s more reliable than this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7434317957","version":"5.2.0","date":"2021-06-06T17:52:26.000Z","authorName":"derickmilsom","rating":2,"title":"What is going on with the buttons?!","body":"The whole redesign looks and feels like a winamp plugin. Bad. Clean and sloppy at the same time. \n\n“Hold to function” buttons are a messy mess. Try starting your car with some sweat on you while outside in the sunshine…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7432285411","version":"5.2.0","date":"2021-06-06T06:38:25.000Z","authorName":"Tjf68","rating":5,"title":"Great app and works very well….but….","body":"There is a bug in the latest version. I got a flat the other day - (picked up a screw which caused a slow leak) app alerted me later that the passenger rear tire was flat 5psi. Looked on the truck and it was in fact the driver side rear tire that was flat. Passenger side was fine .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7432012257","version":"5.2.0","date":"2021-06-06T04:49:00.000Z","authorName":"EtherDadMN","rating":1,"title":"Getting worse with every update.","body":"We have two Bolt EVs and this app is terrible. 5.2 being the worse. Constantly freezes, loose sign in and have to sign back in, Keypass has never worked, says it can’t connect, restart car. Takes 30s to 1 min to update, if it does actually work. Seriously, if GM can’t put the effort needed into making a reliable remote app, why should I trust software fixes for potential battery fires in the current recall? There was already another fire on 5/1/21 for a vehicle with the interim fix.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7431297999","version":"5.2.0","date":"2021-06-06T00:12:04.000Z","authorName":"jbc100889","rating":1,"title":"Wait a minute","body":"Been using this app for light years… across multiple phones NEVER had an issue until now. What’s up???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7430607866","version":"5.2.0","date":"2021-06-05T19:10:54.000Z","authorName":"BabyBadger03","rating":1,"title":"Doesn’t Work","body":"Not sure when it started happening, but lately when I open the app, I’m see the splash screen then brought to a blank grey screen and nothing happens. Waited 5 minutes for anything to happen and nothing. Please fix!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7430560222","version":"5.2.0","date":"2021-06-05T18:52:00.000Z","authorName":"Mtbgeek1","rating":3,"title":"Not as good as the previous version","body":"This new app is lacking features or I don’t know how to find them. A lot of blank pages open up when I search for them.\n\nEdit:  I see added the features back to the app. I don’t understand why it logs me out daily when I have the slider set to remember me?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7430320441","version":"5.2.0","date":"2021-06-05T17:23:38.000Z","authorName":"LubbockEMT","rating":1,"title":"It’s not working currently","body":"The app will NOT load at all iPhone 12 Pro\nThis App does NOT work on iPhone 12 Pro!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7429144417","version":"5.2.0","date":"2021-06-05T11:32:02.000Z","authorName":"Will not take any nickname","rating":1,"title":"Updated and out","body":"Installed on iPhone 6 worked great until it got updated. Now will not load.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7428141527","version":"5.2.0","date":"2021-06-05T05:22:39.000Z","authorName":"ShantyFan#1","rating":1,"title":"I can no longer open and close my Chevy","body":"I used this app to remote start my car and open and close my door but now it’s a blank please fix. I need this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7427822656","version":"5.2.0","date":"2021-06-05T03:17:50.000Z","authorName":"Matador592","rating":1,"title":"???","body":"I’ve updated the app and now it won’t move past the initial  logo screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7427753592","version":"5.2.0","date":"2021-06-05T02:51:44.000Z","authorName":"Dexter Davenport","rating":1,"title":"Blank screen","body":"I load it and get a blank screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7427511012","version":"5.2.0","date":"2021-06-05T01:20:01.000Z","authorName":"beckyb732","rating":2,"title":"Key fab","body":"I can’t access the “fab” on my app like I could before It updated. Is that feature no longer available??","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7426895167","version":"5.2.0","date":"2021-06-04T20:59:33.000Z","authorName":"Jennifter","rating":5,"title":"Help needed!","body":"So I notice for a year now that the app works when it wants to on my Apple Watch. When it’s acting up it tells me “Log in and select a vehicle in myChevrolet on your phone” and when I do it only works for a little then it starts to act up again. It would be nice if you can fix it bc I use this app a lot.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7426226253","version":"5.2.0","date":"2021-06-04T16:43:17.000Z","authorName":"Geminiwi01","rating":1,"title":"Chevy app update disappoints","body":"I have been a loyal Chevy customer since 2015!  My first Chevy traverse was offered with a free trial of On Star for 3 month and then offered with free remote access for 5 years.  Unfortunately, those services do not transfer over to a new purchase and this deal is no longer offered, therefore I opted to stay with the basic features offered in the app.  \nNow I feel like there are more issues/bugs with the new MyChevy app than there ever has been!  The interface blows!  I have lost my vehicle status and cannot locate this info on the app anywhere!  I have tried to delete and reinstall the app to obtain this information back on the home page and still no resolution.  The app is slow and is very disappointing to how the functionality flow was with the older app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7426136339","version":"5.2.0","date":"2021-06-04T16:13:45.000Z","authorName":"xxjoefro","rating":1,"title":"Money grab","body":"I’ve had remote start for five years for free with this app. Now they are trying to charge $15 a month just to remote start. I paid for the remote start package, not sure why they are charging for it now. What a rip off and a bait and switch.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7425909176","version":"5.2.0","date":"2021-06-04T15:04:49.000Z","authorName":"Annoyed_Forq","rating":1,"title":"Incredible how Useless this app is","body":"I can’t believe OnStar has the audacity to still charge everyone for monthly access to this app when it hasn’t worked all year.\nCalls to their support team just have you update the app and then blame your device for it not working. I’ve tried this app on multiple phones and it doesn’t ever load. \nTruly useless and a waste of money.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7425385585","version":"5.2.0","date":"2021-06-04T12:36:45.000Z","authorName":"j szmania","rating":1,"title":"Chevy app","body":"It won’t open for several days. No support to correct. If I delete app and reinstall it wipes all my data.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7423472367","version":"5.2.0","date":"2021-06-04T00:08:42.000Z","authorName":"YC_88_","rating":1,"title":"Keeps crashing for iPhone 8 on iOS 14.6","body":"I have an iPhone 8 running iOS 14.6. But I haven’t gotten the app to work for months now. It keeps crashing whenever I open it. I’ve tried deleting and reinstalling but it has not helped. I have also tried deleting passwords or anything else. This app works great on my daughters iPhone 12. Please ensure backwards compatibility! Thank you we love the Bolt!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7423308186","version":"5.2.0","date":"2021-06-03T23:03:03.000Z","authorName":"Jerich19","rating":2,"title":"It takes lot of time before apps open and provide data.","body":"After the update, it takes time before it can connect to the car and provide data and\nInformation. Hope that they can update it for faster connections with the car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7422965871","version":"5.2.0","date":"2021-06-03T20:37:15.000Z","authorName":"JBLO$","rating":5,"title":"Question","body":"My Chevrolet worked great until the last update. Now when I try to open it, the screen goes gray & won’t open.   I miss the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7422928209","version":"5.2.0","date":"2021-06-03T20:21:39.000Z","authorName":"Hec54321","rating":3,"title":"Unresponsive","body":"For a yet unknown reason the app would not open and is unresponsive. Of course it did this at a time when I really needed it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7422905682","version":"5.2.0","date":"2021-06-03T20:12:26.000Z","authorName":"Previously loved","rating":1,"title":"Won’t load","body":"Used to love the app. Now it won’t even open, just a black screen.\n\nUpdate still only brings up a blank screen. Please fix this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7422272225","version":"5.2.0","date":"2021-06-03T16:20:23.000Z","authorName":"Melanie Heart","rating":1,"title":"It used to work....","body":"This app is broken 😞 every time I open it now ... I get a black screen or dim screen. Not sure why! It used to work... now it just doesn’t. Also the app and Chevrolet places are not on one accord ... I put in for an oil change using the app and they said they didn’t have an appointment for me on more than one occasion once I arrived for my appointment.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7421400562","version":"5.2.0","date":"2021-06-03T12:03:55.000Z","authorName":"sgat22","rating":3,"title":"It used to be great","body":"I used to love this app. However I have not been able to open it. I open the app and it is just black.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7420605025","version":"5.2.0","date":"2021-06-03T07:06:25.000Z","authorName":"dantrrthepirate","rating":1,"title":"Won’t sign in.","body":"Attempting to sign in on both iPhone 12 and X just sends me back to the homescreen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7419468651","version":"5.2.0","date":"2021-06-02T23:20:19.000Z","authorName":"rzfstg","rating":1,"title":"Will not open","body":"I am unable to open this app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7419071961","version":"5.2.0","date":"2021-06-02T20:38:34.000Z","authorName":"eastsonlee","rating":1,"title":"App stopped working after update","body":"The latest version cannot open on iPhone. It’s showing a dark screen. We cannot use the app anymore. Can someone please investigate and fix the bug?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7418563688","version":"5.2.0","date":"2021-06-02T17:29:59.000Z","authorName":"DaveH57","rating":1,"title":"App is terribly glitchy and unreliable","body":"App consistently locks up and requires force quit, logout, and log back in to get it to work properly for maybe a half day. Worst app of the hundreds I have on my phone. Support folks only read script that tells them to have you delete and reinstall app. Don’t have to do that with any other app on my phone. OnStar connectivity stinks as well. If Chevy really cars have someone who can really address the issues contact me instead of level 1 script readers.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7418293058","version":"5.2.0","date":"2021-06-02T15:58:15.000Z","authorName":"hi butter","rating":2,"title":"Should be able to interface with Onstar diagnostics","body":"The Verizon Hum app will immediately tell you if you get an engine diagnostic issue.  Only telling me my oil and tire pressure is not enough for the amount you are wanting each month.\nProbably will cancel and go back to Hum.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7415679361","version":"5.2.0","date":"2021-06-02T00:18:25.000Z","authorName":"Shanwow13","rating":1,"title":"New App not working","body":"This new app is not working. I get unable to connect or remote server not responding. Please fix ASAP.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7414920201","version":"5.2.0","date":"2021-06-01T18:58:40.000Z","authorName":"socalal88","rating":1,"title":"Alan","body":"Mobile app is not working properly, shows black screen","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7413468122","version":"5.2.0","date":"2021-06-01T11:28:01.000Z","authorName":"kbryant1414","rating":1,"title":"Should Be Free Like another Car Manufacturers","body":"You pay insane prices for a car then download an app just to find out that after a month “free trial” you have to pay a monthly fee for it. My other car works flawlessly and their app came as part of the purchase… all the same features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7413406224","version":"5.2.0","date":"2021-06-01T11:08:08.000Z","authorName":"Robdays","rating":2,"title":"Unlock Glitch","body":"Latest app leaves the unlock constantly spinning as if it were activated. This issue does not resolve, therefore leaving me unable to unlock my vehicle from the app. Needs to be addressed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7411345951","version":"5.2.0","date":"2021-05-31T22:30:52.000Z","authorName":"Pandabearmac","rating":1,"title":"Please fix it 😩","body":"This app used to be so convenient and helpful in my life and now it doesn’t work at all. Am I missing something? I had to wait for a pop a lock last week because this app doesn’t work anymore. Y’all have spoiled me now. I need my Chevrolet app back up and running 😩 Please fix this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7411050142","version":"5.2.0","date":"2021-05-31T20:21:24.000Z","authorName":"tgt67","rating":3,"title":"Won’t open","body":"I’m unable to use the app on my iPhone 12 Pro Max . I tap on the app and all I get is a black screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7410810282","version":"5.2.0","date":"2021-05-31T18:48:04.000Z","authorName":"Nia_1","rating":1,"title":"Blank screen","body":"Never gets past a blank screen on startup","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7407523559","version":"5.2.0","date":"2021-05-30T21:42:08.000Z","authorName":"K2csr06","rating":1,"title":"Update ruined app","body":"The new update logs you out of your app. You have to continue to log in every time even if you click stay logged in. They say it’s a security issue which is crap. I emailed support and they want a lot of personal info to look into it, which I’m not doing. I will just cancel my app fee after this month and continue to use my vehicle remote fob instead of their app. “I logged into my app at 10am, tried using my watch to start my car and it didn’t start. At 4pm, tried to use the app again and it states error, log in… I shouldn’t have to log in every single time. It defeats the purpose of me wanting to use my watch to start my vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7407333388","version":"5.2.0","date":"2021-05-30T20:17:52.000Z","authorName":"ScottyPhresh","rating":1,"title":"Black screen doesn’t open","body":"Doesn’t work at all","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7407196992","version":"5.2.0","date":"2021-05-30T19:21:34.000Z","authorName":"G'Sonn","rating":2,"title":"Recent Updste","body":"Recent ‘update’ was a serious downgrade. Have used this app and it’s predecessors since 2011 on 2 Volts. Not happy with this newest version.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7406349520","version":"5.2.0","date":"2021-05-30T14:31:11.000Z","authorName":"Cee-TV","rating":1,"title":"Black Screen","body":"Not working, I continually gat a black screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7405749999","version":"5.2.0","date":"2021-05-30T11:22:19.000Z","authorName":"Aricela's mommy","rating":5,"title":"Not working","body":"I loved the app until I updated my phone and now the app doesn’t work and stays blank the whole time and never loads up.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7404473552","version":"5.2.0","date":"2021-05-30T03:06:51.000Z","authorName":"Java218","rating":1,"title":"Not working after updating","body":"The previous version(4.X) was working fine, then after upgrading to 5.x three months ago, it can never run on my phone ( iPhone Xs, latest IOS), just flash and quit when I click the car in “my garage”. Please help me solve this . Thank you","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7403955477","version":"5.2.0","date":"2021-05-29T23:41:02.000Z","authorName":"j2theimi","rating":2,"title":"Very Frustrating","body":"I have downloaded this app on both Apple and Android devices.  I log in just fine with the username and password, but when it asks for the 4 digit pin, after I enter it, it keeps asking for it like its wrong.  When I go through the process to change the pin, get to the 2nd pin entry for verification and it does the same thing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7403519595","version":"5.2.0","date":"2021-05-29T20:25:44.000Z","authorName":"Kittydog313","rating":1,"title":"Won’t open","body":"I can’t get the open to open. All I get is a black screen. Completely unusable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7402445213","version":"5.2.0","date":"2021-05-29T14:20:30.000Z","authorName":"drummey6","rating":2,"title":"Not working","body":"My app is just coming up with a black screen, nothing else shows on the screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7400996778","version":"5.2.0","date":"2021-05-29T06:00:45.000Z","authorName":"Subarural","rating":4,"title":"Many improvements, still some hang ups.","body":"Quite an improvement overall 2017 to 2021.\nOne iOS issue in iPhone 8 I have is on the ‘Radius’ and ‘Return Range’ screens where I can swipe through three info pages but cannot exit that “Tab”. The button at bottom is semi off screen and does nothing with a tap.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7400373243","version":"5.2.0","date":"2021-05-29T01:55:22.000Z","authorName":"ms2185","rating":1,"title":"Useless","body":"App worked on my 2017 Cruze fine. Now the app is absolutely useless with my 2021 Colorado. Can’t lock or unlock the doors   Unbelievably disappointment.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7400000134","version":"5.2.0","date":"2021-05-28T23:27:52.000Z","authorName":"tmz714","rating":1,"title":"🤦🏽‍♀️🤦🏽‍♀️","body":"App keeps freezing up","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7399840472","version":"5.2.0","date":"2021-05-28T22:22:59.000Z","authorName":"California Michael","rating":1,"title":"Unable to use on 2017 Volt","body":"Unable to activate on my Volt","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7397641428","version":"5.2.0","date":"2021-05-28T10:01:43.000Z","authorName":"jptiv","rating":5,"title":"Works great!","body":"I had a two star review but they responded to my problem and their tip worked, coincidentally I tried it after I commented and forgot to fix the rating. Lol thanks again!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7396813817","version":"5.2.0","date":"2021-05-28T04:07:12.000Z","authorName":"jseversonII","rating":1,"title":"Blank screen","body":"Worked well enough till about a week or so ago. Will open has the Chevy logo then a blank black screen and won’t load any further than that.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7396544445","version":"5.2.0","date":"2021-05-28T02:12:21.000Z","authorName":"jennifer muth","rating":1,"title":"App is not working","body":"I tried to pull up my app and it’s not working, the actual phone won’t let me delete it, just removed the icon so I can delete and retry can someone help","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7396258432","version":"5.2.0","date":"2021-05-28T00:13:36.000Z","authorName":"NoTexCub","rating":1,"title":"App is now useless","body":"Vehicle status doesn’t show real-time. I could care less on what it was hours ago. What is it now. I’ve waited up to 24 hours before it changed. You could have a flat tire and never know it by the app because it doesn’t update. I need real-time info not old.\nUPDATE:  App is still not updating because it will not connect to my vehicle. After a couple of emails and talking with OnStar still not fix. Will be canceling my subscription. I’ve not paying for a service I’m not getting.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7395936014","version":"5.2.0","date":"2021-05-27T21:57:10.000Z","authorName":"kita 2016 chevy malbui","rating":1,"title":"Do not like","body":"Since this update this app has not been working for me. It is not showing up the the preview picture. I like the old app better never had a problem. I can’t even lock and unlock my car cause the display is not showing up. Disappointed","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7395065057","version":"5.2.0","date":"2021-05-27T16:25:07.000Z","authorName":"Afternoonsummer","rating":1,"title":"App functions limited. Worthless app","body":"Cant check battery information on Chevy Spark. It’s not a good app for anything else tbh.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7394721981","version":"5.2.0","date":"2021-05-27T14:38:25.000Z","authorName":"tlmahaffy","rating":2,"title":"No Improvement","body":"Need to go back to prior version. Lost access to viewing location, fuel and driving information. I am starting to think this update caused my loss of remote use from my Apple Watch.\n5/27/21 deleting and reinstalling to see if I can get updated smart driver information.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7394134155","version":"5.2.0","date":"2021-05-27T11:42:55.000Z","authorName":"DE9987","rating":1,"title":"Won’t loan after update","body":"This app is trash. I pay monthly for the services of the app like remote start yet I can never get past the loading screen. I have the most recent update and an iPhone 12 Pro Max so there’s no reason I shouldn’t be able to use the app. I’m basically paying monthly for no reason since the app won’t even load anymore! And prior to this problem, every time I would try to start my car I would hold on “start” a thousand times before it even sent over the message to my car which was nearby. They should’ve never changed it to holding the start button and left it to just pressing it once which never failed. It is much easier to use my keys at this point but during the winter this app will become beyond frustrating. I’m considering canceling my membership and deleting this app since it does nothing but waste space on my phone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7392981534","version":"5.2.0","date":"2021-05-27T04:03:05.000Z","authorName":"SK531","rating":4,"title":"QoL improvement suggestions","body":"- Add the option to link Owner Center account to the Onstar account from within the app. \n  >  Most people don’t know that this is even a thing until it’s their first time setting it up and see the “Get Connected: Press the Blue Onstar Button to speak to an Advisor now!”. You can create an Owner Center account from so hon the app, you should be able to link it too.\n\n- Ability to update/change PIN within the app.\n  >  You used to be able to do it with the old layout. It’s be more convenient than needing to login to the Owner Center. Where’d that option go?\n\n- Make it so “Keep Me Signed In” option is available/possible without needing a Security PIN/Password/TouchID/FaceID on my phone, itself.\n  >  A lot of people, myself included, don’t have a password for our phones. It asks for the OnStar PIN anyways when sending Unlock/RemoteStart anyways. Why the extra steps without making it possible to opt out?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7392833365","version":"5.2.0","date":"2021-05-27T03:03:11.000Z","authorName":"Radar O'Reiley","rating":1,"title":"Drove My Chevy To The Levy, But The App Was…","body":"Updated this app recently and now it fails to open on my iPhone 11 Pro Max. I press the app, it goes dark brown over the entire screen and does nothing. GM makes wonderful vehicles but they get a big fat F for software apps (MyVolt is also one of the failures too.)\n\nThe previous apps I’ve used with my GM vehicles going back to 2012 worked well, but this latest GM app stands for Generally Miserable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7392772195","version":"5.2.0","date":"2021-05-27T02:38:58.000Z","authorName":"ShMegs8","rating":3,"title":"Getting frustrated","body":"I downloaded and used this app for a year or so. I just re downloaded it but won’t open. Why? 🥺","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7392612061","version":"5.2.0","date":"2021-05-27T01:35:43.000Z","authorName":"Oren Kieth","rating":1,"title":"Bug alert","body":"What happened to the start button? I had it now it’s gone.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7392563222","version":"5.2.0","date":"2021-05-27T01:15:38.000Z","authorName":"tenshiblue","rating":1,"title":"App opens up to a black screen","body":"I have tried opening the app for the past 2 days and each time I open it, all that shows up is a blank black screen.  Can you please fix this issue?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7392159394","version":"5.2.0","date":"2021-05-26T22:26:18.000Z","authorName":"Jay47!!!!!","rating":2,"title":"Update left out remote start??","body":"I’m not sure how long ago the update was but the remote start button that was in the middle of the newest update is missing and I can’t find it anywhere in the app!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7390876883","version":"5.2.0","date":"2021-05-26T14:55:54.000Z","authorName":"BernK22","rating":1,"title":"Blank screen! Can’t get into my app!!!","body":"Went to use the unlock door feature from my app and it loads the Chevy screen then goes black. Have tried numerous times to reach on star from my vehicle and on cell and waited over an hour on hold!!!! And this is an emergency service I pay for?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7390379474","version":"5.2.0","date":"2021-05-26T12:31:01.000Z","authorName":"Nikko1211","rating":4,"title":"Location Alerts not working","body":"The set up alert location feature on app does not work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7389152120","version":"5.2.0","date":"2021-05-26T04:40:33.000Z","authorName":"LuFromTheU","rating":1,"title":"App opens to a black screen (dead end)","body":"I’m running iOS 14.6 on an iPhone 11.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7389058141","version":"5.2.0","date":"2021-05-26T04:01:03.000Z","authorName":"Capital choke","rating":2,"title":"This update was a total downgrade","body":"For a monthly paid app; this is offensive how often it crashes, the amount of times the server times out when you are standing in the rain or snow waiting for the doors to unlock. It is not stable enough to be relied on for everyday use. GM maxes good vehicles but is terrible with apps and mobile computing (very lose term). \n\nOh, forget about using the auto start because the developers want you to hold the start button (with no feedback) till a vehicle you most likely cannot visually see, starts. \n\nAt least the old app worked some of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7388829860","version":"5.2.0","date":"2021-05-26T02:28:23.000Z","authorName":"rz856","rating":1,"title":"Crap","body":"This app is broken!  Does not load!  Does not work on my iPhone 11Pro","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7388589955","version":"5.2.0","date":"2021-05-26T00:53:31.000Z","authorName":"Hicapted","rating":1,"title":"Problems???","body":"What’s up with your app? And my Colorado?\nI loved everything up until about a week ago. Suddenly my truck keeps asking me to ‘enter password’ on my screen.\n\nWhy? What did you guys do? I haven’t done anything to my iPhone differently to initiate this. \n\nSo I have tried to address this through MyChevrolet mobile app … but can’t!?! I open the app and it goes to a blank black screen. I’ve tried to reload the app. But that doesn’t  work either.\n\nThe pop up window on my trucks screen is annoying and it occurs about once every 5 minutes or so. If I ignore it while driving, it disappears eventually. So winder why it even pops up? So far it doesn’t seem to impact any functionality. But if I can’t resolve through my app which doesn’t look good right now, I’ll consider calling tech support. God forbid I have to take my truck in to a dealer!?!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7388506472","version":"5.2.0","date":"2021-05-26T00:19:20.000Z","authorName":"jfran454","rating":1,"title":"Not working","body":"Since the last update, I have been unable to use the app for my 2016 Silverado and do not get vehicle status and unable to use any of the fob functions, as they do not appear. Just a blank screen where that used to be. I have never had a problem u til the recent update and paying money for something that doesn’t work. Please fix!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7387185335","version":"5.2.0","date":"2021-05-25T16:12:29.000Z","authorName":"Chilelli","rating":1,"title":"Doesn’t work","body":"This app doesn’t work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7387148776","version":"5.2.0","date":"2021-05-25T16:01:13.000Z","authorName":"tapple_me 100","rating":1,"title":"Frustrating","body":"It was doing the circle death  when I needed it most and I had cell service","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7386321481","version":"5.2.0","date":"2021-05-25T12:13:56.000Z","authorName":"RSTcrapap","rating":1,"title":"Icon broken","body":"Just goes to a black screen??","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7386168692","version":"5.2.0","date":"2021-05-25T11:28:48.000Z","authorName":"mnbcxzaghoyr","rating":1,"title":"Login Problems are often and difficult to resolve","body":"I really use the app because it’s a good tool when and if it’s working. But every few weeks I have to contact OnStar to re-initialized the app because I can’t log in. Meanwhile, most OnStar agents have no idea what I’m talking about when I explained instructions are to push the Blue Button for OnStar assistance with the apps password issue. So, I lose a lot of valuable time because: 1st I have to be in my car,  and 2nd I have to wait while the OnStar agent figure out what the heck they are suppose to do. It frustrating and Chevrolet need to resolve the iPhone update issue associated with their updates.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7385835924","version":"5.2.0","date":"2021-05-25T09:39:05.000Z","authorName":"gregg118","rating":1,"title":"MyChevrolet app experience","body":"It was doing just fine and worked whenever I needed it. Maybe a few times did it sign me out but now whenever I get on the app it doesn’t do anything but show a white screen with three dots I’m guessing it’s loading or something but it will not work or show anything but that screen and I’m unable to do anything with the app because of that. I’m beginning to become furious and would like to know as of why I cannot do anything now","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7384918292","version":"5.2.0","date":"2021-05-25T03:31:40.000Z","authorName":"BeckbBeck","rating":1,"title":"Version 5.2 does not update MILEAGE when last FUL CHARGE was achieved","body":"Yep, the last versions updated.  This version does NOT. Still read last full charge attained at 16,250 miles when it was last attained yesterday at over 40,000K","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7384461398","version":"5.2.0","date":"2021-05-25T00:39:48.000Z","authorName":"Bill in Akron","rating":1,"title":"March 2021 update is terrible","body":"The app updated itself from the prior version and all I got was a dark gray screen upon launch. I had to delete the app and reinstall, then go through the setup all over again and even delete and re-add my phone to keypass in the car. The new “dark” motif is pretty ugly, but I guess that is what app developers feel is currently the hip look. Past the main screen you wind up in the dregs of the previous version which makes the user interface inconsistent and confusing. Functionality seems broken in in many ways. I could not get the app to connect to the car unless I was close enough to have a Bluetooth connection - which pretty much negates the point of having the app in the first place. Doing anything over 4G from a distance times out. The app says to start the car and then try again. I did, but it made no difference. I could not get the app to manage my OnStar account or the Wi-Fi hotspot. Again, the app just timed out even after multiple tries. This app transitioned from OK but not great to almost pointless after the recent update. Last of all, upon install the app warns it will sell your info for location based advertising, and supposedly that behavior can be turned off in Settings, however I do not see any option for that in Settings. Be prepared for frustration if you try to use this app. ——————- Update April 8, 2021. I called OnStar to verify my car still is connected and my account is active; it is. The representative had me sign out and back in to the app. After several times signing out and back in, the app began connecting to the car via 4G. The app still seems unreliable, not always connecting. I raised my review from one to three stars now that the app works sometimes. The app user interface is inconsistent and buggy, so two stars off for being hard to use and for the privacy issue. GM should probably scrap this app and start over with a clean sheet of paper for a better design from the ground up. ——— Update April 20, 2021. V 5.0.1 app has not been able to connect to my car over 4G in the last six days. This app is a waste of effort trying to use. Reducing rating.——— Update May 24, 2021 V 5.2.0 app.  Problems connecting to car.  Says to go to car, turn on car and try again.  4G signal is strong where car is parked.  If I could go to the car I would not need the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7384262499","version":"5.2.0","date":"2021-05-24T23:23:27.000Z","authorName":"Eandesmon","rating":1,"title":"Blank screen","body":"I bought a Chevy 3 weeks ago and the app has yet to work, just a blank screen, I’ve updated, removed, reinstalled and still nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7384043291","version":"5.2.0","date":"2021-05-24T21:57:22.000Z","authorName":"KemaCole","rating":4,"title":"Not working","body":"When I click on the app only a blank screen shows up.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7383931590","version":"5.2.0","date":"2021-05-24T21:15:12.000Z","authorName":"L J 000","rating":5,"title":"L J","body":"What happened to the keyless entry and start control","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7382814464","version":"5.2.0","date":"2021-05-24T15:14:22.000Z","authorName":"upset chevy owner","rating":1,"title":"Does Not Work","body":"I don’t know why the OnStar app that actually worked was changed to this garbage. After getting a pop up message to upgrade to MyChevrolet, I installed it and seemed to work fine for a very brief amount of time. Then some wonderful Uber programmer decided they wanted to change something with the app and completely butchered it. It will not open anymore at all.\n\nSeriously though: fix it. The other app worked fine but y’all had to mess with something that didn’t need messing with.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7382038627","version":"5.2.0","date":"2021-05-24T11:35:58.000Z","authorName":"Hdjxkakv","rating":1,"title":"I can’t rest my password","body":"The app isn’t working… I wish I could login","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7381404387","version":"5.2.0","date":"2021-05-24T07:51:50.000Z","authorName":"Skyline2020","rating":3,"title":"Where is the mile that was next to better percentage for BOLT EV","body":"After updated this app and the mile is gone and only the percentage left for BOLT EV main Home Screen and Battery Charge Status screen. Please bring back the mile. Thanks!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7380401357","version":"5.2.0","date":"2021-05-24T01:02:15.000Z","authorName":"🚶👊✊✌️👋👌","rating":4,"title":"Need one fix for five stars","body":"I have been unable to reach the developers, hopefully they will respond here.  The app works perfectly with one glitch that is annoying. When using CarPlay via a cable in my 2020 Bolt it behaves as expected and the MyChevrolet app is one of those available in CarPlay. However, when using a device to allow wireless CarPlay (in my case CPlay2air) this app is not available.  Please fix, especially annoying with an EV when some of those features are helpful…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7380277329","version":"5.2.0","date":"2021-05-24T00:13:18.000Z","authorName":"afelikapasifika","rating":1,"title":"My Chevrolet app","body":"I am furious that I can’t call anyone about my app not working. It would not open up. My app stopped working once I upgraded my iPhone from an 8 plus to a 12 pro max. I uninstalled and installed this app multiple times and still it hasn’t worked.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7379503337","version":"5.2.0","date":"2021-05-23T19:25:55.000Z","authorName":"奕谦","rating":3,"title":"It keeps crashing on iPhone","body":"It keeps crashing on iPhone As Max in 2021. Reinstalling the app does not solve the issue. Pls fix this ASAP. Thank you!  [Update］I have filed a bug report with Chevrolet and they are quite responsive. They told me the developers are working on it However there is no estimated release date yet.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7378541163","version":"5.2.0","date":"2021-05-23T14:30:57.000Z","authorName":"kelseyks","rating":3,"title":"Help!","body":"Since the update, my app won’t recognize that I’ve had my oil changed. It is showing oil life at 7 percent and saying I have an issue that needs attention. When I click on the alert that needs attention it takes me to a page to schedule service. What’s up with this and how can I get it fixed?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7376822223","version":"5.2.0","date":"2021-05-23T04:33:12.000Z","authorName":"morriscran3","rating":1,"title":"App doesn’t work on my iPhone or I watch","body":"Because I have the iPhone 12 Pro with the iso 14.4. So I’m wondering when it will be upgraded.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7376790522","version":"5.2.0","date":"2021-05-23T04:20:50.000Z","authorName":"EliasSB","rating":4,"title":"Great App, Location Sync could be faster","body":"Can you start the location sync automatically when starting the app? It often takes 30+ sec. to find the car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7375863924","version":"5.2.0","date":"2021-05-22T22:25:53.000Z","authorName":"pupsrug","rating":1,"title":"New app not working on new iPhone 12 Pro","body":"Disappointed to see the new app doesn’t work with the latest technology. So sad.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7374825218","version":"5.2.0","date":"2021-05-22T16:15:27.000Z","authorName":"spotted and speckled","rating":2,"title":"Designed to sell me something else","body":"I use this app to track family members & access the key fob when one of them locks the keys in the car. Used to be super easy to use, but they redesigned it and now getting service appointments is easy. WHO CARES about that???? I don’t want to have to go through all these steps to track the car when my elderly loved one was lost two weeks ago. Plus the tracking lags behind—tracking on the iPhone is better in real time. Please put the things we care about on the front page, not the stuff the service department wants to sell me.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7374766430","version":"5.2.0","date":"2021-05-22T15:58:21.000Z","authorName":"Omegawb","rating":1,"title":"No longer able to access.","body":"The only thing I did was buy a new phone and now when I open the app, I get a perpetual blank screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7372823384","version":"5.2.0","date":"2021-05-22T05:18:37.000Z","authorName":"19K..","rating":1,"title":"The 1 thing I hate....","body":"I absolutely hate that even though it asks me if I want the app to remember me and if I want it to “log me in” with my fingerprint; it never does it & then it proceeds to ask me the same questions next time. It’s the only app that does this. Even with my bank accounts I am able to simply put my fingerprint on my phone and “BOOM!!” it automatically signs me in.\n\nThis is Chevrolete we are talking about, not Prius.....\nSo why can’t they change that feature instead of me having to type in my password every time it times out???\n\nI’m just speaking for everybody else who sees this issue, besides that. Great app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7372306363","version":"5.2.0","date":"2021-05-22T02:04:40.000Z","authorName":"Vantur","rating":2,"title":"New version 5 and interface no longer shows battery","body":"I have a Chevrolet spark ev.. nee interface lost my ev battery status i can only checknit on the main website. Pls fix it! Its one of the main reasons i haveon-star\nI have uninstalled ut and installed it againsamw problem \nJohn r","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7371927974","version":"5.2.0","date":"2021-05-21T23:44:39.000Z","authorName":"RDD101","rating":1,"title":"Once again","body":"Need to look at my driving history and lo and behold it doesn’t work. This app is getting close to being useless!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7371810443","version":"5.2.0","date":"2021-05-21T23:02:24.000Z","authorName":"Fudge Goddess","rating":1,"title":"Useless!","body":"This app is basically useless. Never sends me text notifications even though that what I’ve set up in settings. Constantly says “updating” and nothing happens.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7371231560","version":"5.2.0","date":"2021-05-21T19:21:00.000Z","authorName":"Carlv-o3","rating":1,"title":"Used to be good","body":"This WAS a fantastic app, but is now basically useless unless you have a paid plan...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7371041121","version":"5.2.0","date":"2021-05-21T18:14:22.000Z","authorName":"TLH7916","rating":4,"title":"Crashing and not working","body":"That two updates have not worked. Turns into a black screen. Nothing comes up. Just updated it again and same thing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7368370914","version":"5.2.0","date":"2021-05-21T03:13:48.000Z","authorName":"marcio azevedo 86","rating":2,"title":"Doesn’t work","body":"This app was the greatest. Until I got an iPhone 12 Pro Max, the app won’t open up. Only thing I see is the loading symbol. Someone please help.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7368144130","version":"5.2.0","date":"2021-05-21T01:48:22.000Z","authorName":"daveofsand","rating":5,"title":"New","body":"Just got setup nice working system","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7367813199","version":"5.2.0","date":"2021-05-21T00:02:34.000Z","authorName":"cmbtbevo","rating":1,"title":"App will not open","body":"After the latest update, the app will not open; all I get is a black screen.  Left it running for 30 minutes and nothing.  Finally deleted it.  Chevrolet doesn’t have any answers either; discovered this as my wife’s Tahoe died and as she was troubleshooting it, her doors locked with her keys, phone & our son inside.  Had to call OnStar to remotely unlock the doors.  They had no idea the app wasn’t working either.  Tahoe is in the shop being diagnosed for electrical issues, though that wouldn’t have anything to do with the app not working.  \n\nHope they decide to do something really soon, before someone actually gets stuck and someone gets hurt because their app doesn’t work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7367084722","version":"5.2.0","date":"2021-05-20T19:54:37.000Z","authorName":"AJ20202024","rating":4,"title":"App Problem","body":"I don’t have OnStar and it won’t let me update my Account info I keep getting a system error.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7367022240","version":"5.2.0","date":"2021-05-20T19:35:00.000Z","authorName":"310Zempel1","rating":3,"title":"The app is not opening","body":"Had little trouble in past, now it won’t open at all","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7366586092","version":"5.2.0","date":"2021-05-20T17:26:15.000Z","authorName":"Italian1superman","rating":1,"title":"Doesn’t load","body":"I have the iPhone 11 and it worked until the new update. It’s just a gray screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7366341367","version":"5.2.0","date":"2021-05-20T16:19:06.000Z","authorName":"Omahafireguys","rating":2,"title":"Bad update","body":"Prior to the “new look” and current versions the app was fast and worked well. Now it’s slow to login and heaven forbid if your finger moves slightly while trying to lock or unlock the vehicle while holding for an eternity for it to send. Make a huge improvement by rolling back to the old version or old version functionality with “new look”.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7365057441","version":"5.2.0","date":"2021-05-20T11:02:38.000Z","authorName":"Kyle Ramirez","rating":1,"title":"Your UX designer is living in 2013","body":"This app went through a visual refresh that seems to have taken the app back in time to when skeuomorphism was a new thing. You want me to hold down on a button to start the vehicle? What a ridiculous waste of time! Whose idea was that! So bad! This is a perfect example of fake solving problems that don't even exist. I guarantee you the person who requested this was more senior level and everyone just had to listen to that person even though it was dumb. Be better.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7364092812","version":"5.2.0","date":"2021-05-20T05:33:42.000Z","authorName":"Bella S.R","rating":1,"title":"Key fob","body":"The app use to be great!! I updated and found the key fob is gone... I depended on the virtual key fob, especially when I’m out with my daughter or I work nights. The fact that I don’t have that anymore is unacceptable. Especially since it’s not on my watch either!! Having that convenience and mind of ease taken away is horrible. So now if I accidentally lock my keys or god forbid my daughter in the car then I will have to waste money and time to get it unlocked  by emergency personnel, triple a, or someone to bring my spare keys. Please fix this issue!! Having that feature on both the phone and watch puts so many individuals and parents minds at ease knowing that they can get to their children or pets in convenient and timely manner.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7362958585","version":"5.2.0","date":"2021-05-19T22:59:54.000Z","authorName":"Dave1731","rating":1,"title":"Needs quick repair","body":"Latest version does not work on my IPhone 11 which is irresponsible.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7362788502","version":"5.2.0","date":"2021-05-19T22:04:38.000Z","authorName":"Icecoldcanada","rating":1,"title":"Waste of time","body":"After the Onstar trial was over the entire app is useless.  Why would I need o star to see vehicle maintenance, mileage or service.  Italked a shame because they made scheduling service easy.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7362327714","version":"5.2.0","date":"2021-05-19T19:44:03.000Z","authorName":"bcishais","rating":1,"title":"Was useful at one point","body":"I used to use this app to start my 2014 Chevrolet Equinox. My phone updated one day and I was no longer able to log in. After attempting several times I was able to log in but the screen stays on the logo. It doesn’t move from their. I can’t access this app and I would like to utilize the remote start feature that my car comes with.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7362189526","version":"5.2.0","date":"2021-05-19T19:03:20.000Z","authorName":"Dsford79","rating":1,"title":"Not working for me","body":"App needs to be updated it wouldn’t get pass my vin# and it keeps starting me over","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7362122845","version":"5.2.0","date":"2021-05-19T18:44:04.000Z","authorName":"Corvette Sting Ray Bob","rating":5,"title":"Problem With The Last Update","body":"After the last update to the app, my Trail Blazer identifies a problem and then tells me a device is plugged into the data port that prevents it from checking system info. I checked the terminal and nothing is plugged in. Couldn’t find any other way to report a problem with the app.\n\nAfter I went to the MyChevrolet webpage and requested vehicle status there, the app started displaying status correctly and the vehicle problem error went away.\n\nReally like the one stop dashboard display of vehicle status instead of scrolling through all the vehicle status options.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7360548930","version":"5.2.0","date":"2021-05-19T12:09:51.000Z","authorName":"Threecurl","rating":1,"title":"Functionally useless","body":"The Chevy app is a case study relentless mediocrity, and a cautionary tale of the awful things that follow when you let an organization like GM dabble in software. Launch time for the app is best measured in geologic epochs, and this is the function the app performs best. Need to unlock your vehicle? Get comfortable, because that's a process that takes anywhere from 45 seconds to five full minutes, which is in no way an exaggeration. How about a basic function provided by competing automakers' apps, like remote start. Sorry, that feature is only available as a paid service through OnStar. The galactic ineptitude of the team behind this farce should, in a functioning corporation, result in their being escorted from the building to spend their remaining years cooking raccoons under an overpass, but GM seems to be fine with their performance.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7359493459","version":"5.2.0","date":"2021-05-19T07:00:14.000Z","authorName":"cmr1994","rating":3,"title":"Auto start","body":"I used to love this app, I could start my car before lunch but since the recent update it doesn’t even show start on my car, only my wife’s car","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7358815902","version":"5.2.0","date":"2021-05-19T03:01:54.000Z","authorName":"BBuehler","rating":1,"title":"Badly broken","body":"They did make the app look nice but broke it in the process. Even after deleting and reinstalling, it continues to have a wide variety of malfunctions. It’s so bad that it’s like they tried to make it unusable on purpose.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7358804441","version":"5.2.0","date":"2021-05-19T02:58:08.000Z","authorName":"h\\5hnh5nnhnnh53nh","rating":1,"title":"No working","body":"It isn’t working at all","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7358725646","version":"5.2.0","date":"2021-05-19T02:32:21.000Z","authorName":"xomikeox","rating":4,"title":"Remote windows down","body":"The app is fairly good generally speaking. I really want to see the windows down function. Would great on hot days to use when the key fob doesn’t have line of sight or range. Add that and I’d say it’s a solid five star, IMO.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7358259472","version":"5.2.0","date":"2021-05-19T00:07:19.000Z","authorName":"JoeR91","rating":1,"title":"Doesn’t start","body":"These past few weeks the app won’t even start for me. My screen turns gray and that’s it. I can exit it but I am unable to use it at all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"},{"id":"7357542609","version":"5.2.0","date":"2021-05-18T20:44:19.000Z","authorName":"ELIZTERR","rating":1,"title":"Worst version ever.","body":"I have to delete and re-download several times a week to keep features working.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"398596699","appName":"My Chevrolet"}]